<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《故武衞將軍挽歌三首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》1.152",
"版本"=>
array(
"詩題"=>"故武衛將軍挽謌三首",
"詩文"=>array("嚴警當寒夜。前軍落大星。壯夫思敢決。哀詔惜精靈。王者今無戰。書生已勒銘。封侯意踈闊。編簡為誰青。","舞劍過人絶。鳴弓射獸能。銛鋒行愜順。猛噬失蹻騰。赤羽千夫膳。黄河十月冰。横行沙漠外。神速至今稱。","哀挽青門去。新阡絳水遥。路人紛雨泣。天意颯風飈。部曲精仍銳。匈奴氣不驕。無由覩雄略。大樹日蕭蕭。",),

"坐標版本異文、夾注"=>array(
"〚0152:1〛"=>"〖1〗故武衛將軍挽謌三首",
"〚0152:1:8.1.4〛"=>"〖疏〗踈",
"〚0152:1:8.2.3〛"=>"〖爲〗為",
"〚0152:2:12.1.5〛"=>"〖絕〗絶",
"〚0152:2:14.2.1〛"=>"〖黃〗黄",
"〚0152:2:15.1.1〛"=>"〖橫〗横",
"〚0152:3:19.2.5〛"=>"〖遙〗遥",
),
),

);
?>