<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《病後過王倚飲贈歌》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》1.223",
"版本"=>
array(
"詩文"=>"麟角鳳觜世莫識。煎膠續弦奇自見。尚看王生抱此懷。在於甫也何由羡。且遇王生慰疇昔。素知賤子甘貧賤。酷見凍餒不足恥。多病沉年苦無健。王生怪我顔色惡。答云伏枕艱難徧。瘧癘三秋孰可忍。寒熱百日相交戰。頭白眼暗坐有胝。肉黄皮皺命如綫。惟生哀我未平復。為我力致美肴膳。遣人向市賒香粳。喚婦出房親自饌。長安冬葅酸且緑。金城土酥淨如練。兼求畜豪且割鮮。密沽斗酒諧終宴。故人情義晚誰似。令我手脚輕欲旋。老馬為駒信不虚。當時得意況深眷。但使殘年飽喫飯。只願無事長相見。",
"坐標版本異文、夾注"=>array(
"〚0223:4.2.7〛"=>"〖羨〗羡",
"〚0223:6.1.7〛"=>"〖耻〗恥",
"〚0223:7.1.5〛"=>"〖顏〗顔",
"〚0223:9.2.1-7〛"=>"〖肉黃皮皺命如線〗肉黄皮皺命如綫",
"〚0223:10.2.1-2〛"=>"〖爲我〗為我",
"〚0223:12.1.7〛"=>"〖綠〗緑",
"〚0223:14.2.4〛"=>"〖腳〗脚",
"〚0223:15.1.3-7〛"=>"〖爲駒信不虛〗為駒信不虚",
),
),

);
?>