<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《兵車行》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》",
"版本"=>
array(
"詩文"=>"車轔轔。馬蕭蕭。行人弓箭各在腰。耶娘妻子走相送[古樂府云：「不聞耶娘哭子聲，但聞黄河流水一濺濺。」]。塵埃不見咸陽橋。牽衣頓足攔道哭。哭聲直上干雲霄。道傍過者問行人。行人但云點行頻。或從十五北防河。便至四十西營田。去時里正與裹頭。歸來頭白還戍邊。邊庭流血成海水。武皇開邊意未已。君不聞漢家山東二百州。千村萬落生荊杞。縱有健婦把鋤犂。禾生隴畝無東西。況復秦兵耐苦戰。被驅不異犬與雞。長者雖有問。役夫敢伸恨。且如今年冬。未休關西卒。縣官急索租。租税從何出。信知生男惡。反是生女好。生女猶是嫁比鄰。生男埋没隨百草。君不見青海頭。古來白骨無人收。新鬼煩寃舊鬼哭。天陰雨濕聲啾啾。",
"坐標版本異文、夾注"=>array(
"〚0229:5.1.5-7〛"=>"〖走相送〗走相送[古樂府云：「不聞耶娘哭子聲，但聞黄河流水一濺濺。」]",
"〚0229:11.2.5-7〛"=>"〖生荆杞〗生荊杞",
"〚0229:16.2.1-2〛"=>"〖租稅〗租税",
"〚0229:18.2.3-4〛"=>"〖埋沒〗埋没",
""=>"〖冤〗寃",
),
),

);
?>