<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《奉贈鮮于京兆二十韻》的資料。
*/
$蕭内容=array(
"書名"=>"滌非主編《杜甫全集校注》1.328",
"版本"=>
array(
"詩文"=>"王國稱多士。賢良復幾人。異才應閒出。爽氣必殊倫。始見張京兆。宜居漢近臣。驊騮開道路。鵰鶚離風塵。侯伯知何筭。文章實致身。奮飛超等級。容易失沉淪。脱略磻溪釣。操持郢匠斤。雲霄今已逼。台衮更誰親。鳳穴鶵皆好。龍門客又新。義聲紛感激。敗績自逡巡。途遠欲何向。天高難重陳。學詩猶孺子。鄉賦忝嘉賓。不得同晁錯。吁嗟後郄詵。計踈疑翰墨。時過憶松筠。獻納紆皇眷。中閒謁紫宸。且隨諸彦集。方覬薄才伸。破膽遭前政。陰謀獨秉鈞。微生霑忌刻。萬事益酸辛。交合丹青地。恩傾雨露辰。有儒愁餓死。早晚報平津。",
"坐標版本異文、夾注"=>array(
"〚0328:4.1.4〛"=>"〖間〗閒",
"〚0328:6.2.1〛"=>"〖雕〗鵰",
"〚0328:9.1.1-2〛"=>"〖脫略〗脱略",
"〚0328:11.1.3〛"=>"〖雛〗鶵",
"〚0328:14.2.1〛"=>"〖鄕〗鄉",
"〚0328:16.1.2〛"=>"〖疏〗踈",
"〚0328:18.1.4〛"=>"〖彥〗彦",
),
),

);
?>