<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《陪鄭廣文遊何將軍山林十首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》1.356",
"版本"=>
array(
"詩文"=>array("不識南塘路。今知第五橋。名園依緑水。野竹上青霄。谷口舊相得。濠梁同見招。平生為幽興。未惜馬蹄遥。","百頃風潭上。千章夏木清。卑枝低結子。接葉暗巢鸎。鮮鯽銀絲鱠。香芹碧澗羹。翻疑柂樓底。晚飯越中行。","萬里戎王子。何年别月支。異花開絶域。滋蔓匝清池。漢使徒空到。神農竟不知。露翻兼雨打。開拆漸離披。","旁舍連高竹。踈籬帶晚花。碾渦深没馬。藤蔓曲藏虵。詞賦工無益。山林跡未賒。盡拈書籍賣。來問爾東家。","剩水滄江破。殘山碣石開。綠垂風折笋。紅綻雨肥梅。銀甲彈箏用。金魚换酒來。興移無洒埽。隨意坐莓苔。","風磴吹陰雪。雲門吼瀑泉。酒醒思臥簟。衣冷得裝綿。野老來看客。河魚不取錢。秖疑淳朴處。自有一山川。","棘樹寒雲色。茵蔯春藕香。脆添生菜美。陰益食單涼。野鶴清晨出。山精白日藏。石林蟠水府。百里獨蒼蒼。","憶過楊柳渚。走馬定昆池。醉把青荷葉。狂遺白接䍦。刺船思郢客。解水乞吳兒。坐對秦山晚。江湖興頗隨。","床上書連屋。階前樹拂雲。將軍不好武。稚子總能文。醒酒微風入。聽詩靜夜分。絺衣挂蘿薜。涼月白紛紛。","幽意忽不愜。歸期無奈何。出門流水住。廻首白雲多。自笑燈前舞。誰憐醉後歌。秖應與朋好。風雨亦來過。",),
),

);
?>