<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《渼陂行》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》1.443",
"版本"=>
array(
"詩文"=>"岑參兄弟皆好奇。携我遠來游渼陂。天地黤慘忽異色。波濤萬頃堆瑠璃。瑠璃漫汗泛舟入。事殊興極憂思集。鼉作鯨吞不復知。惡風白浪何嗟及。主人錦帆相為開。舟子喜甚無氛埃。鳧鷖散亂棹謳發。絲管啁啾空翠來。沈竿續蔓深莫測。菱葉荷花靜如拭。宛在中流渤澥清。下歸無極終南黑。半陂已南純浸山。動影裊窕冲融閒。舩舷暝戞雲際寺。水面月出藍田關。此時驪龍亦吐珠。馮夷擊鼓羣龍趨。湘妃漢女出歌舞。金支翠旗光有無。咫尺但愁雷雨至。蒼茫不曉神靈意。少壯幾時奈老何。向來哀樂何其多。",
"坐標版本異文、夾注"=>array(
"〚0443:3.2.1-5〛"=>"〖攜我遠來遊〗携我遠來游",
"〚0443:7.1.6〛"=>"〖爲〗為",
"〚0443:9.1.1〛"=>"〖沉〗沈",
"〚0443:11.2.5-7〛"=>"〖沖融間〗冲融閒",
"〚0443:12.1.1〛"=>"〖船〗舩",
),
),

);
?>