<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《秋雨歎三首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非《杜甫全集校注》1.465",
"版本"=>
array(
"詩文"=>array("雨中百草秋爛死。堦下決明顔色鮮。著葉滿枝翠羽蓋。開花無數黄金錢。涼風蕭蕭吹汝急。恐汝後時難獨立。堂上書生空白頭。臨風三嗅馨香泣。","闌風長雨秋紛紛。四海八荒同一雲。去馬來牛不復辯。濁涇清渭何當分。禾頭生耳黍穗黑。農夫田父無消息。城中斗米換衾裯。相許寧論兩相直。","長安布衣誰比數。反鏁衡門守環堵。老夫不出長蓬蒿。稚子無憂走風雨。雨聲颼颼催早寒。胡鴈翅濕高飛難。秋來未曾見白日。泥污后土何時乾。",),

"坐標版本異文、夾注"=>array(
"〚0465:1:5.2.1-5〛"=>"〖階下決明顏〗堦下決明顔",
"〚0465:1:6.2.5-7〛"=>"〖黃金錢〗黄金錢",
"〚0465:2:13.1.7〛"=>"〖辨〗辯",
"〚0465:3:19.2.2〛"=>"〖鎖〗鏁",
"〚0465:3:21.2.2〛"=>"〖雁〗鴈",
),
),

);
?>