<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《奉贈太常張卿垍二十韻》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》1.506",
"版本"=>
array(
"詩文"=>"方丈三韓外。崑崙萬國西。建標天地闊。詣絶古今迷。氣得神仙迥。恩承雨露低。相門清議衆。儒術大名齊。軒冕羅天闕。琳琅識介珪。伶官詩必誦。夔樂典猶稽。健筆凌鸚鵡。銛鋒瑩鸊鵜。友于皆挺拔。公望各端倪。通籍踰青瑣。亨衢照紫泥。靈虬傳夕箭。歸馬散霜蹄。能事聞重譯。嘉謩及遠黎。弼諧方一展。班序更何躋。適越空顛躓。遊梁竟慘悽。謬知終畫虎。微分是䤈雞。萍泛無休日。桃陰想舊蹊。吹嘘人所羨。騰躍事仍暌。碧海真難涉。青雲不可梯。顧深慙鍛鍊。才小辱提携。檻束哀猿巧。枝驚夜鵲棲。幾時陪羽獵。應指釣璜溪。",
"坐標版本異文、夾注"=>array(
"〚0506:4.2.2〛"=>"〖絕〗絶",
"〚0506:6.1.5〛"=>"〖眾〗衆",
"〚0506:13.2.2〛"=>"〖謨〗謩",
"〚0506:18.1.2〛"=>"〖噓〗嘘",
"〚0506:19.1.3〛"=>"〖眞〗真",
"〚0506:20.1.3〛"=>"〖慚〗慙",
"〚0506:20.2.5〛"=>"〖攜〗携",
"〚0506:21.2.5〛"=>"〖栖〗棲",
"〚0506:12.1.1-2〛"=>"〖靈虯〗靈虬",
),
),

);
?>