<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《橋陵詩三十韻因呈縣內諸官》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》1.515",
"版本"=>
array(
"詩文"=>"先帝昔晏駕。兹山朝百靈。崇岡擁象設。沃野開天庭。即事壯重險。論功超五丁。坡陁因厚地。却略羅峻屏。雲闕虛冉冉。風松肅泠泠。石門霜露白。玉殿莓苔青。宮女曉知曙。祠官朝見星。空梁簇畫戟。陰井敲銅瓶。中使日夜繼。惟王心不寧。豈徒䘏備享。尚謂求無形。孝理敦國政。神凝推道經。瑞芝産廟柱。好鳥鳴巖扃。高岳前嵂崒。洪河左瀅濴。金城蓄峻趾。沙菀交迴汀。永與奧區固。川原紛眇冥。居然赤縣立。臺榭爭岧亭。官屬果稱是。聲華真可聽。王劉美竹潤。裴李春蘭馨。鄭氏才振古。啖侯筆不停。遣詞必中律。利物常發硎。綺繡相展轉。琳琅愈青熒。側聞魯恭化。秉德崔瑗銘。太史候鳬影。王喬隨鶴翎。朝儀限霄漢。客思迴林坰。轗軻辭下杜。飄颻陵濁涇。諸生舊短褐。旅泛一浮萍。荒歲兒女瘦。暮途涕泗零。主人念老馬。廨署容秋螢。流寓理豈愜。窮愁醉未醒。何當擺俗累。浩蕩乘滄溟。",
"坐標版本異文、夾注"=>array(
"〚0515:3.2.1〛"=>"〖茲〗兹",
"〚0515:5.1.1〛"=>"〖卽〗即",
"〚0515:6.2.1-5〛"=>"〖卻略羅峻屛〗却略羅峻屏",
"〚0515:10.2.5〛"=>"〖甁〗瓶",
"〚0515:14.1.3〛"=>"〖產〗産",
"〚0515:19.2.3〛"=>"〖眞〗真",
"〚0515:25.1.4〛"=>"〖鳧〗鳬",
),
),

);
?>