<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《醉歌行》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》2.598",
"版本"=>
array(
"詩題"=>"醉歌行[别從姪勤落第歸]",
"詩文"=>"陸機二十作文賦。汝更小年能綴文。總角草書又神速。世上兒子徒紛紛。驊騮作駒已汗血。鷙鳥舉翮連青雲。詞源倒流三峽水。筆陣獨掃千人軍。只今年纔十六七。射策君門期第一。舊穿楊葉真自知。暫蹶霜蹄未為失。偶然擢秀非難取。會是排風有毛質。汝身已見唾成珠。汝伯何由髮如漆。春光淡沲秦東亭。渚蒲牙白水荇青。風吹客衣日杲杲。樹攪離思花冥冥。酒盡沙頭雙玉瓶。衆賓皆醉我獨醒。乃知貧賤别更苦。吞聲躑躅涕淚零。",
"坐標版本異文、夾注"=>array(
"〚0598:1〛"=>"〖1〗醉歌行[别從姪勤落第歸]",
"〚0598:8.1.5〛"=>"〖眞〗真",
"〚0598:8.2.6〛"=>"〖爲〗為",
"〚0598:11.1.4〛"=>"〖沱〗沲",
"〚0598:13.1.7〛"=>"〖甁〗瓶",
"〚0598:13.2.1〛"=>"〖眾〗衆",
"〚0598:14.1.5〛"=>"〖別〗别",
),
),

);
?>