<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《大雲寺贊公房四首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》2.797",
"版本"=>
array(
"詩文"=>array("心在水精域。衣霑春雨時。洞門盡徐步。深院果幽期。到扉開復閉。撞鐘齋及兹。醍醐長發性。飲食過扶衰。把臂有多日。開懷無媿詞。黄[時西郊逆賊拒官軍未已]鸎度結構。紫鴿下罘罳。愚意會所適。花邊行自遲。湯休起我病。微笑索題詩。","細軟青絲履。光明白㲲巾。深藏供老宿。取用及吾身。自顧轉無趣。交情何尚新。道林才不世。惠遠德過人。雨瀉暮簷竹。風吹春井芹。天隂對圖畫。最覺潤龍鱗。","燈影照無睡。心清聞妙香。夜深殿突兀。風動金琅璫。天黑閉春院。地清棲暗芳。玉繩廻斷絕。鐵鳳森翱翔。梵放時出寺。鐘殘仍殷牀。明朝在沃野。苦見塵沙黄[時西郊逆賊拒官軍未已]。","童兒汲井華。慣捷瓶上手。霑灑不濡地。掃除似無箒。明霞爛複閣。霽霧搴高牖。側塞被徑花。飄颻委墀柳。艱難世事迫。隱遁佳期後。晤語契深心。那能揔鉗口。奉辭還杖策。蹔别終回首。泱泱泥污人。㹞㹞國多狗。既未免羈絆。時來憩奔走。近公如白雪。執熱煩何有。",),

"坐標版本異文、夾注"=>array(
"〚0797:1:7.2.5〛"=>"〖茲〗兹",
"〚0797:1:9.2.4〛"=>"〖愧〗媿",
"〚0797:1:10.1.2〛"=>"〖鶯〗鸎",
"〚0797:2:21.1.2〛"=>"〖陰〗隂",
"〚0797:3:27.2.3〛"=>"〖栖〗棲",
"〚0797:3:28.1.3〛"=>"〖迴〗廻",
"〚0797:1:10.1.1〛"=>"〖黃〗黄[時西郊逆賊拒官軍未已]",
"〚0797:4:34.2.3〛"=>"〖甁〗瓶",
"〚0797:4:40.2.1-2〛"=>"〖暫別〗蹔别",
"〚0797:4:42.1.1〛"=>"〖旣〗既",
),
),

);
?>