<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《羌村三首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》2.934",
"版本"=>
array(
"詩文"=>array("崢嶸赤雲西。日脚下平地。柴門鳥雀噪。歸客千里至。妻孥怪我在。驚定還拭淚。世亂遭飄蕩。生還偶然遂。鄰人滿牆頭。感歎亦歔欷。夜闌更秉燭。相對如夢寐。","晚歲迫偷生。還家少歡趣。嬌兒不離膝。畏我復却去。憶昔好追涼。故繞池邊樹。蕭蕭北風勁。撫事煎百慮。賴知禾黍收。已覺糟牀注。如今足斟酌。且用慰遲暮。","群雞正亂叫。客至雞鬬爭。驅雞上樹木。始聞叩柴荊。父老四五人。問我久遠行。手中各有携。傾榼濁復清。苦辭酒味薄。黍地無人耕。兵革既未息。兒童盡東征。請爲父老歌。艱難媿深情。歌罷仰天歎。四座淚縱橫。",),

"坐標版本異文、夾注"=>array(
"〚0934:1:5.2.2〛"=>"〖腳〗脚",
"〚0934:2:15.2.4〛"=>"〖卻〗却",
"〚0934:3:23.1.1〛"=>"〖羣〗群",
"〚0934:3:24.2.5〛"=>"〖荆〗荊",
"〚0934:3:26.1.5〛"=>"〖攜〗携",
"〚0934:3:28.1.3〛"=>"〖旣〗既",
"〚0934:3:29.2.3〛"=>"〖愧〗媿",
),
),

);
?>