<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《閿鄕姜七少府設鱠戲贈長歌》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》3.1216",
"版本"=>
array(
"詩題"=>"閿鄉姜七少府設鱠戲贈長歌",
"詩文"=>"姜侯設鱠當嚴冬。昨日今日皆天風。河凍未漁不易得。鑿冰恐侵河伯宫。饔人受魚鮫人手。洗魚磨刀魚眼紅。無聲細下飛碎雪。有骨已剁觜[平聲]春葱。偏勸腹腴愧年少。軟炊香飯緣老翁。落碪何曾白紙濕。放筯未覺金盤空。新歡便飽姜侯德。清觴異味情屢極。東歸貪路自覺難。欲别上馬身無力。可怜為人好心事。於我見子真顏色。不恨我衰子貴時。悵望且爲今相憶。",
"坐標版本異文、夾注"=>array(
"〚1216:1〛"=>"〖1〗閿鄉姜七少府設鱠戲贈長歌",
"〚1216:4.2.7〛"=>"〖宮〗宫",
"〚1216:6.2.5〛"=>"〖觜〗觜[平聲]",
"〚1216:10.2.2〛"=>"〖別〗别",
"〚1216:11.1.2-3〛"=>"〖憐爲〗怜為",
"〚1216:11.2.5〛"=>"〖眞〗真",
"〚1216:11.1.3〛"=>"〖爲〗為",
),
),

);
?>