<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《洗兵馬》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》3.1252",
"版本"=>
array(
"詩文"=>"中興諸將收山東。捷書夕報清晝同。河廣傳聞一葦過。胡危命在破竹中。秖殘鄴城不日得。獨任朔方無限功。京師皆騎汗血馬。廻紇餧肉蒲萄宫。已喜皇威清海岱。常思仙仗過崆峒。三年笛裏關山月。萬國兵前草木風。成王功大心轉小。郭相謀深古來少。司徒清鑒懸明鏡。尚書氣與秋天杳。二三豪俊為時出。整頓乾坤濟時了。東走無復憶鱸魚。南飛覺有安巢鳥。青春復隨冠冕入。紫禁正耐煙花繞。鶴駕通霄鳳輦備。鷄鳴問寢龍樓曉。攀龍附鳳世莫當。天下盡化為侯王。汝等豈知䝉帝力。時來不得誇身強。關中既留蕭丞相。幕下復用張子房。張公一生江海客。身長九尺鬚眉蒼。徵起適遇風雲會。扶顛始知籌策良。青袍白馬更何有。後漢今周喜再昌。寸地尺天皆入貢。奇祥異瑞爭來送。不知何國致白環。復道諸山得銀甕。隱士休歌紫芝曲。詞人解撰清河頌。田家望望惜雨乾。布穀處處催春種。淇上健兒歸莫懶。城南思婦愁多夢。安得壯士挽天河。淨洗甲兵長不用。",
"坐標版本異文、夾注"=>array(
"〚1252:5.1.1〛"=>"〖祇〗秖",
"〚1252:6.2.1-7〛"=>"〖回紇餧肉蒲萄宮〗廻紇餧肉蒲萄宫",
"〚1252:11.1.5-6〛"=>"〖爲時〗為時",
"〚1252:14.2.1〛"=>"〖雞〗鷄",
"〚1252:15.2.4-5〛"=>"〖化爲〗化為",
"〚1252:16.1.5〛"=>"〖蒙〗䝉",
"〚1252:17.1.3〛"=>"〖旣〗既",
),
),

);
?>