<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《新婚別》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》3.1299",
"版本"=>
array(
"詩題"=>"新婚别",
"詩文"=>"兔絲附蓬麻。引蔓故不長。嫁女與征夫。不如弃路傍。結髮為妻子。席不煖君牀。暮婚晨告别。無乃太怱忙。君行雖不遠。守邊赴河陽。妾身未分明。何以拜姑嫜。父母養我時。日夜令我藏。生女有所歸。鷄狗亦得將。君今往死地。沈痛迫中腸。誓欲隨君去。形勢反蒼黄。勿為新婚念。努力事戎行。婦人在軍中。兵氣恐不揚。自嗟貧家女。久致羅襦裳。羅襦不復施。對君洗紅妝。仰視百鳥飛。大小必雙翔。人事多錯迕。與君永相望。",
"坐標版本異文、夾注"=>array(
"〚1299:1〛"=>"〖1〗新婚别",
"〚1299:4.2.3〛"=>"〖棄〗弃",
"〚1299:5.1.3-4〛"=>"〖爲妻〗為妻",
"〚1299:6.1.5〛"=>"〖別〗别",
"〚1299:6.2.4〛"=>"〖匆〗怱",
"〚1299:10.2.1〛"=>"〖雞〗鷄",
"〚1299:11.2.1〛"=>"〖沉〗沈",
"〚1299:12.2.5〛"=>"〖黃〗黄",
"〚1299:13.1.1-2〛"=>"〖勿爲〗勿為",
),
),

);
?>