<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《有懷台州鄭十八司戶》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》3.",
"版本"=>
array(
"詩題"=>"有懷台州鄭十八司户[虔]",
"詩文"=>"天台隔三江。風浪無晨暮。鄭公縱得歸。老病不識路。昔如水上鷗。今如罝中兔。性命由他人。悲辛但狂顧。山鬼獨一脚。蝮虵長如樹。呼號旁孤城。歲月誰與度。從來禦魑魅。多為才名誤。夫子嵇阮流。更被時俗惡。海隅微小吏。眼暗髮垂素。黄帽映青袍。非供折𦝫具。平生一杯酒。見我故人遇。相望無所成。乾坤莽廻互。",
"坐標版本異文、夾注"=>array(
"〚1366:1〛"=>"〖1〗有懷台州鄭十八司户[虔]",
"〚1366:7.1.5〛"=>"〖腳〗脚",
"〚1366:7.2.2〛"=>"〖蛇〗虵",
"〚1366:9.2.2〛"=>"〖爲〗為",
"〚1366:12.1.1〛"=>"〖黃〗黄",
"〚1366:12.2.4〛"=>"〖腰〗𦝫",
"〚1366:14.2.4〛"=>"〖迴〗廻",
),
),

);
?>