<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《遣興五首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》3.1376",
"版本"=>
array(
"詩文"=>array("蟄龍三冬臥。老鶴萬里心。昔時賢俊人。未遇猶視今。嵇康不得死。孔明有知音。又如隴坻松。用捨在所尋。大哉霜雪幹。歲久為枯林。","昔者龐德公。未曾入州府。襄陽耆舊閒。處士節獨苦。豈無濟時策。終竟畏羅罟。林茂鳥有歸。水深魚知聚。舉家隱鹿門。劉表焉得取。","陶潛避俗翁。未必能達道。觀其著詩集。頗亦恨枯槁。達生豈是足。默識蓋不早。有子賢與愚。何其掛懷抱。","賀公雅吳語。在位常清狂。上疏乞骸骨。黃冠歸故鄉。爽氣不可致。斯人今則亡。山陰一茅宇。江海日淒涼。","吾憐孟浩然。裋褐即長夜。賦詩何必多。往往凌鮑謝。清江空舊魚。春雨餘甘蔗。每望東南雲。令人幾悲吒。",),

"坐標版本異文、夾注"=>array(
"〚1376:1:9.2.3〛"=>"〖爲〗為",
"〚1376:2:14.1.5〛"=>"〖間〗閒",
"〚1376:3:24.2.3〛"=>"〖挂〗掛",
"〚1376:4:29.2.5〛"=>"〖鄕〗鄉",
"〚1376:5:35.2.3〛"=>"〖卽〗即",
),
),

);
?>