<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《西枝村尋置草堂地，夜宿贊公土室二首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》3.1488",
"版本"=>
array(
"詩文"=>array("出郭眄細岑。披榛得微路。溪行一流水。曲折方屢渡。贊公湯休徒。好静心跡素。昨枉霞上作。盛論巖中趣。怡然共携手。恣意同遠步。捫蘿澁先登。陟巘眩反顧。要求陽岡暖。苦涉陰嶺冱。惆悵老大藤。沈吟屈蟠樹。卜居意未展。杖策廻且暮。曾巔餘落日。草蔓已多露。","天寒鳥已歸。月出山更靜。土室延白光。松門耿踈影。躋攀倦日短。語樂寄夜永。明燃林中薪。暗汲石底井。大師京國舊。德業天機秉。從來支許遊。興趣江湖逈。數奇謫關塞。道廣存箕潁。何知戎馬閒。復接塵事屏。幽尋豈一路。遠色有諸嶺。晨光稍曚曨。更越西南頂。",),

"坐標版本異文、夾注"=>array(
"〚1488:1:7.2.2-4〛"=>"〖靜心迹〗静心跡",
"〚1488:1:9.1.4〛"=>"〖攜〗携",
"〚1488:1:10.1.3〛"=>"〖澀〗澁",
"〚1488:1:12.2.1〛"=>"〖沉〗沈",
"〚1488:1:13.2.3〛"=>"〖迴〗廻",
"〚1488:2:19.2.4〛"=>"〖疏〗踈",
"〚1488:2:23.2.5〛"=>"〖迥〗逈",
"〚1488:2:25.1.5〛"=>"〖間〗閒",
"〚1488:2:25.2.5〛"=>"〖屛〗屏",
),
),

);
?>