<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《乾元中寓居同谷縣作歌七首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》4.1770",
"版本"=>
array(
"詩文"=>array("有客有客字子美。白頭亂髮垂過耳。歲拾橡栗隨狙公。天寒日暮山谷裏。中原無書歸不得。手腳凍皴皮肉死。嗚呼一歌兮歌已哀。悲風為我從天來。","長鑱長鑱白木柄。我生託子以為命。黃精無苗山雪盛。短衣數挽不掩脛。此時與子空歸來。男呻女吟四壁靜。嗚呼二歌兮歌始放。鄰里為我色惆悵。","有弟有弟在遠方。三人各瘦何人強。生別展轉不相見。胡塵暗天道路長。東飛鴐鵝後鶖鶬。安得送我置汝傍。嗚呼三歌兮歌三發。汝歸何處收兄骨。","有妹有妹在鍾離。良人早歿諸孤癡。長淮浪高蛟龍怒。十年不見來何時。扁舟欲往箭滿眼。杳杳南國多旌旗。嗚呼四歌兮歌四奏。林猿為我啼清晝。","四山多風溪水急。寒雨颯颯枯樹濕。黃蒿古城雲不開。白狐跳梁黃狐立。我生胡為在窮谷。中夜起坐萬感集。嗚呼五歌兮歌正長。魂招不來歸故鄉。","南有龍兮在山湫。古木巃嵸枝相樛。木葉黃落龍正蟄。蝮虵東來水上游。我行怪此安敢出。拔劍欲斬且復休。嗚呼六歌兮歌思遲。溪壑為我廻春姿。","男兒生不成名身已老。三年飢走荒山道。長安卿相多少年。富貴應須致身早。山中儒生舊相識。但話宿昔傷懷抱。嗚呼七歌兮悄終曲。仰視皇天白日速。",),

"坐標版本異文、夾注"=>array(
"〚1770:1:8.2.3-7〛"=>"〖爲我從天來〗為我從天來",
"〚1770:2:12.2.5-7〛"=>"〖以爲命〗以為命",
"〚1770:2:15.2.3-7〛"=>"〖爲我色惆悵〗為我色惆悵",
"〚1770:4:29.2.3-7〛"=>"〖爲我啼清晝〗為我啼清晝",
"〚1770:5:35.1.3-7〛"=>"〖胡爲在窮谷〗胡為在窮谷",
"〚1770:5:36.2.7〛"=>"〖鄕〗鄉",
"〚1770:6:41.2.2〛"=>"〖蛇〗虵",
"〚1770:6:43.2.3-7〛"=>"〖爲我迴春姿〗為我廻春姿",
),
),

);
?>