<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《江畔獨步尋花七絕句》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》4.2219",
"版本"=>
array(
"詩文"=>array("江上被花惱不徹。無處告訴只顛狂。走覓南鄰愛酒伴。經旬出飲獨空牀[斛斯融吾酒徒]。","稠花亂蕊畏江濱。行步欹危實怕春。詩酒尚堪驅使在。未須料理白頭人。","江深竹靜兩三家。多事紅花映白花。報答春光知有處。應須美酒送生涯。","東望少城花滿煙。百花高樓更可憐。誰能載酒開金盞。喚取佳人舞繡筵。","黄師塔前江水東。春光懶困倚微風。桃花一簇開無主。可愛深紅愛淺紅。","黄四孃家花滿蹊。千朵萬朵壓枝低。留連戲蝶時時舞。自在嬌鶯恰恰啼。","不是愛花即肯死。只恐花盡老相催。繁枝容易紛紛落。嫩葉商量細細開。",),

"坐標版本異文、夾注"=>array(
"〚2219:1:6.2.7〛"=>"〖牀〗牀[斛斯融吾酒徒]",
"〚2219:5:25.1.1-2〛"=>"〖黃師〗黄師",
"〚2219:6:30.1.1-2〛"=>"〖黃四〗黄四",
"〚2219:7:35.1.5〛"=>"〖卽〗即",
),
),

);
?>