<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《茅屋爲秋風所破歌》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非《杜甫全集校注》4.2345",
"版本"=>
array(
"詩題"=>"茅屋為秋風所破歌",
"詩文"=>"八月秋高風怒號。卷我屋上三重茅。茅飛度江洒江郊。高者挂罥長林梢。下者飄轉沉塘坳。南村群童欺我老無力。忍能對面為盜賊。公然抱茅入竹去。唇焦口燥呼不得。歸來倚杖自歎息。俄頃風定雲墨色。秋天漠漠向昏黑。布衾多年冷似鐵。嬌兒惡臥踏裏裂。床床屋漏無乾處。雨腳如麻未斷絕。自經喪亂少睡眠。長夜沾濕何由徹。安得廣廈千萬間。大庇天下寒士俱歡顏。風雨不動安如山。嗚呼。何時眼前突兀見此屋。吾廬獨破受凍死亦足。",
"坐標版本異文、夾注"=>array(
"〚2345:1〛"=>"〖1〗茅屋為秋風所破歌",
"〚2345:6.1.3-4〛"=>"〖羣童〗群童",
"〚2345:6.2.5-7〛"=>"〖爲盜賊〗為盜賊",
"〚2345:8.1.1〛"=>"〖脣〗唇",
"〚2345:11.1.1-2〛"=>"〖牀牀〗床床",
),
),

);
?>