<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《江頭五詠》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》5.2516",
"版本"=>
array(
"詩文"=>array("丁香體柔弱。亂結枝猶墊。細葉帶浮毛。踈花披素豔。深栽小齋後。庶近幽人占。晚墮蘭麝中。休懷粉身念。","百草競春華。麗春應最勝。少須好顔色。多漫枝條剩。紛紛桃李枝。處處總能移。如何此貴重。却怕有人知。","梔子比衆木。人間誠未多。於身色有用。與道氣傷和。紅取風霜實。青看雨露柯。無情移得汝。貴在映江波。","故使籠寬織。須知動損毛。看雲莫悵望。失水任呼號。六翮曾經剪。孤飛卒未高。且無鷹隼慮。留滯莫辭勞。","花鴨無泥滓。階前每緩行。羽毛知獨立。黑白太分明。不覺群心妬。休牽衆眼驚。稻粱霑汝在。作意莫先鳴。",),

"坐標版本異文、夾注"=>array(
"〚2516:1:6.2.1-2〛"=>"〖疏花〗踈花",
"〚2516:2:13.1.4-5〛"=>"〖顏色〗顔色",
"〚2516:2:15.2.1-2〛"=>"〖卻怕〗却怕",
"〚2516:3:19.1.4-5〛"=>"〖眾木〗衆木",
"〚2516:5:35.1.3-4〛"=>"〖羣心〗群心",
"〚2516:5:35.2.3-4〛"=>"〖眾眼〗衆眼",
),
),

);
?>