<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《屏跡三首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》5.2530",
"版本"=>
array(
"詩題"=>"屏迹三首",
"詩文"=>array("衰年甘屏迹。幽事供高卧。鳥下竹根行。龜開萍葉過。年荒酒價乏。日併園蔬課。猶酌甘泉歌。歌長擊樽破。","用拙存吾道。幽居近物情。桑麻深雨露。燕雀半生成。村鼓時時急。漁舟箇箇輕。杖藜從白首。心跡喜雙清。","晚起家何事。無營地轉幽。竹光團野色。舍影漾江流。失學從兒懶。長貧任婦愁。百年渾得醉。一月不梳頭。",),

"坐標版本異文、夾注"=>array(
"〚2530:1〛"=>"〖1〗屏迹三首",
"〚2530:1:5.1.3-5〛"=>"〖甘屛迹〗甘屏迹",
"〚2530:1:5.2.4-5〛"=>"〖高臥〗高卧",
"〚2530:1:7.2.1-2〛"=>"〖日倂〗日併",
"〚2530:1:8.2.3-4〛"=>"〖擊尊〗擊樽",
"〚2530:2:15.2.1-2〛"=>"〖心迹〗心跡",
),
),

);
?>