<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《戲題寄上漢中王三首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》5.2674",
"版本"=>
array(
"詩文"=>array("西漢親王子。成都老客星。百年雙白鬢。一别五秋螢。忍斷杯中物。祗看坐右銘。不能隨皂蓋。自醉逐浮萍。","策杖時能出。王門異昔遊。已知嗟不起。未許醉相留。蜀酒濃無敵。江魚美可求。終思一酩酊。凈掃雁池頭。","群盗無歸路。衰顔會遠方。尚憐詩警策。猶記酒顛狂。魯衛彌尊重。徐陳略喪亡。空餘枚叟在。應念早升堂。",),

"坐標版本異文、夾注"=>array(
"〚2674:1:6.2.1-2〛"=>"〖一別〗一别",
"〚2674:1:8.1.4-5〛"=>"〖皁蓋〗皂蓋",
"〚2674:2:15.2.1-2〛"=>"〖淨掃〗凈掃",
"〚2674:3:19.1.1-2〛"=>"〖羣盜〗群盗",
"〚2674:3:19.2.1-2〛"=>"〖衰顏〗衰顔",
"〚2674:3:21.1.1-2〛"=>"〖魯衞〗魯衛",
),
),

);
?>