<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《將適吳楚，留別章使君留後兼幕府諸公，得柳字》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》5.3005",
"版本"=>
array(
"詩題"=>"將適吳楚，留别章使君留後兼幕府諸公，得柳字",
"詩文"=>"我來入蜀門。歲月亦已久。豈唯長兒童。自覺成老醜。常恐性坦率。失身為杯酒。近辭痛飲徒。折節萬夫後。昔如縱壑魚。今如喪家狗。既無遊方戀。行止復何有。相逢半新故。取别隨薄厚。不意青草湖。扁舟落吾手。眷眷章梓州。開筵俯高柳。樓前出騎馬。帳下羅賓友。健兒簸紅旗。此樂或難朽。日車隱崑崙。鳥雀噪户牖。波濤未足畏。三峽徒雷吼。所憂盜賊多。重見衣冠走。中原消息斷。黄屋今安否。終作適荊蠻。安排用莊叟。隨雲拜東皇。挂席上南斗。有使即寄書。無使長迴首。",
"坐標版本異文、夾注"=>array(
"〚3005:1〛"=>"〖1〗將適吳楚，留别章使君留後兼幕府諸公，得柳字",
"〚3005:5.2.3-5〛"=>"〖爲杯酒〗為杯酒",
"〚3005:8.1.1-2〛"=>"〖旣無〗既無",
"〚3005:9.2.1-2〛"=>"〖取別〗取别",
"〚3005:14.2.4-5〛"=>"〖戶牖〗户牖",
"〚3005:17.2.1-2〛"=>"〖黃屋〗黄屋",
"〚3005:18.1.4-5〛"=>"〖荆蠻〗荊蠻",
"〚3005:20.1.3-5〛"=>"〖卽寄書〗即寄書",
"〚3005:20.2.4-5〛"=>"〖回首〗迴首",
),
),

);
?>