<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《傷春五首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3036",
"版本"=>
array(
"詩文"=>array("天下兵雖滿。春光日自濃。西京疲百戰。北闕任群兇。關塞三千里。烟花一萬重。蒙塵清露急。御宿且誰供。殷復前王道。周遷舊國容。蓬萊足雲氣。應合總從龍。","鶯入新年語。花開滿故枝。天青風卷幔。草碧水通池。牢落官軍速。蕭條萬事危。鬢毛元自白。淚點向來垂。不是無兄弟。其如有别離。巴山春色靜。北望轉逶迤。","日月還相鬬。星辰屢合圍。不成誅執法。焉得變危機。大角纏兵氣。鈎陳出帝畿。烟塵昏御道。耆舊把天衣。行在諸軍闕。來朝大將稀。賢多隱屠釣。王肯載同歸。","再有朝廷亂。難知消息真。近傳王在洛。復道使歸秦。奪馬悲公主。登車泣貴嬪。蕭關迷北上。滄海欲東巡。敢料安危體。猶多老大臣。豈無嵇紹血。霑灑屬車塵。","聞說初東幸。孤兒却走多。難分太倉粟。競棄魯陽戈。胡虜登前殿。王公出御河。得無中夜舞。誰憶大風歌。春色生烽燧。幽人泣薜蘿。君臣重修德。猶足見時和。",),

"坐標版本異文、夾注"=>array(
"〚3036:1:6.2.4-5〛"=>"〖羣兇〗群兇",
"〚3036:1:7.2.1-2〛"=>"〖煙花〗烟花",
"〚3036:2:18.2.4-5〛"=>"〖別離〗别離",
"〚3036:3:26.1.1-2〛"=>"〖煙塵〗烟塵",
"〚3036:4:32.2.3-5〛"=>"〖消息眞〗消息真",
"〚3036:5:41.2.3-5〛"=>"〖卻走多〗却走多",
),
),

);
?>