<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《將赴成都草堂，途中有作，先寄嚴鄭公五首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3124",
"版本"=>
array(
"詩文"=>array("得歸茅屋赴成都。直爲文翁再剖符。但使閭閻還揖讓。敢論松竹久荒蕪。魚知丙穴由來美。酒憶郫筒不用酤。五馬舊曾諳小徑。幾廻書札待潛夫。","處處青江帶白蘋。故園猶得見殘春。雪山斥候無兵馬。錦里逢迎有主人。休怪兒童延俗客。不教鵝鴨惱比鄰。習池未覺風流盡。況復荊州賞更新。","竹寒沙碧浣花溪。菱刺藤梢咫尺迷。過客徑須愁出入。居人不自解東西。書籤藥裹封蛛網。野店山橋送馬蹄。豈藉荒庭春草色。先判一飲醉如泥。","常苦沙崩損藥欄。也從江檻落風湍。新松恨不高千尺。惡竹應須斬萬竿。生理祗憑黃閣老。衰顏欲付紫金丹。三年奔走空皮骨。信有人間行路難。","錦官城西生事微。烏皮几在還思歸。昔去為憂亂兵入。今來已恐鄰人非。側身天地更懷古。廻首風塵甘息機。共說總戎雲鳥陣。不妨遊子芰荷衣。",),

"坐標版本異文、夾注"=>array(
"〚3124:1:8.2.1-2〛"=>"〖幾迴〗幾廻",
"〚3124:2:15.2.3-4〛"=>"〖荆州〗荊州",
"〚3124:5:34.1.3-4〛"=>"〖爲憂〗為憂",
"〚3124:5:35.2.1-2〛"=>"〖回首〗廻首",
),
),

);
?>