<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《草堂》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3141",
"版本"=>
array(
"詩文"=>"昔我去草堂。蠻夷塞成都。今我歸草堂。成都適無虞。請陳初亂時。反覆乃須臾。大將赴朝廷。群小起異圖。中宵斬白馬。盟歃氣已麤。西取卭南兵。北斷劒閣隅。布衣數十人。亦擁專城居[即楊子琳栢正節之徒]。其勢不兩大。始聞蕃漢殊。西卒却倒戈。賊臣互相誅。焉知肘腋禍。自及梟鏡徒。義士皆痛憤。紀綱亂相踰。一國實三公。萬人欲為魚。唱和作威福。孰肯辨無辜。眼前列杻械。背後吹笙竽。談笑行殺戮。濺血滿長衢。到今用鉞地。風雨聞號呼。鬼妾與鬼馬。色悲充爾娛。國家法令在。此又足驚吁。賤子且奔走。三年望東吳。弧矢暗江海。難為遊五湖。不忍竟舍此。復來薙榛蕪。入門四松在。步屧萬竹踈。舊犬喜我歸。低徊入衣裾。鄰舍喜我歸。酤酒携胡蘆。大官喜我來。遣騎問所須。城郭喜我來。賓客隘村墟。天下尚未寧。健兒勝腐儒。飄颻風塵際。何地置老夫。於時見疣贅。骨髓幸未枯。飲啄媿殘生。食薇不願餘。",
"坐標版本異文、夾注"=>array(
"〚3141:6.2.1-2〛"=>"〖羣小〗群小",
"〚3141:8.1.3-4〛"=>"〖邛南〗卭南",
"〚3141:8.2.3-4〛"=>"〖劍閣〗劒閣",
"〚3141:9.2.4-5〛"=>"〖城居〗城居[即楊子琳栢正節之徒]",
"〚3141:11.1.3-5〛"=>"〖卻倒戈〗却倒戈",
"〚3141:14.2.4-5〛"=>"〖爲魚〗為魚",
"〚3141:22.2.1-2〛"=>"〖難爲〗難為",
"〚3141:24.2.3-5〛"=>"〖萬竹疏〗萬竹踈",
"〚3141:26.2.3-5〛"=>"〖攜胡蘆〗携胡蘆",
"〚3141:32.1.3-5〛"=>"〖愧殘生〗媿殘生",
),
),

);
?>