<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《四松》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3151",
"版本"=>
array(
"詩文"=>"四松初移時。大抵三尺強。别來忽三歲。離立如人長。會看根不拔。莫計枝凋傷。幽色幸秀發。踈柯亦昂藏。所插小藩籬。本亦有隄防。終然棖撥損。得吝千葉黃。敢為故林主。黎庶猶未康。避賊今始歸。春草滿空堂。覽物嘆衰謝。及兹慰淒涼。清風為我起。洒面若微霜。足以送老姿。聊待偃蓋張。我生無根蔕。配爾亦茫茫。有情且賦詩。事迹可兩忘。勿矜千載後。慘澹蟠穹蒼。",
"坐標版本異文、夾注"=>array(
"〚3151:4.1.1-2〛"=>"〖別來〗别來",
"〚3151:6.2.1-2〛"=>"〖疏柯〗踈柯",
"〚3151:9.1.1-2〛"=>"〖敢爲〗敢為",
"〚3151:11.1.3-5〛"=>"〖歎衰謝〗嘆衰謝",
"〚3151:11.2.1-2〛"=>"〖及茲〗及兹",
"〚3151:12.1.3-4〛"=>"〖爲我〗為我",
"〚3151:16.2.1-2〛"=>"〖慘淡〗慘澹",
),
),

);
?>