<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《丹青引》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3200",
"版本"=>
array(
"詩文"=>"將軍魏武之子孫。於今為庶為清門。英雄割據雖已矣。文彩風流今尚存。學書初學衛夫人。但恨無過王右軍。丹青不知老將至。富貴於我如浮雲。開元之中常引見。承恩數上南薰殿。凌煙功臣少顔色。將軍下筆開生面。良相頭上進賢冠。猛將腰間大羽箭。褒公鄂公毛髮動。英姿颯爽來酣戰。先帝天馬玉花驄。畫工如山貌不同。是日牽來赤墀下。迥立閶闔生長風。詔謂將軍拂絹素。意匠慘淡經營中。斯須九重真龍出。一洗萬古凡馬空。玉花却在御榻上。榻上庭前屹相向。至尊含笑催賜金。圉人太僕皆惆悵。弟子韓幹早入室。亦能畫馬窮殊相。幹唯畫肉不畫骨。忍使驊騮氣凋喪。將軍盡善蓋有神。必逢佳士亦寫真。即今飄泊干戈際。屢貌尋常行路人。途窮返遭俗眼白。世上未有如公貧。但看古來盛名下。終日坎壈纏其身。",
"坐標版本異文、夾注"=>array(
"〚3200:3.2.3-7〛"=>"〖爲庶爲清門〗為庶為清門",
"〚3200:5.1.5-7〛"=>"〖衞夫人〗衛夫人",
"〚3200:8.1.5-7〛"=>"〖少顏色〗少顔色",
"〚3200:14.1.5-6〛"=>"〖眞龍〗真龍",
"〚3200:15.1.3-4〛"=>"〖卻在〗却在",
"〚3200:19.2.6-7〛"=>"〖寫眞〗寫真",
"〚3200:20.1.1-2〛"=>"〖卽今〗即今",
"〚3200:21.1.3-4〛"=>"〖反遭〗返遭",
),
),

);
?>