<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《韋諷錄事宅觀曹將軍畫馬圖》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3207",
"版本"=>
array(
"詩題"=>"韋諷録事宅觀曹將軍畫馬圖",
"詩文"=>"國初已來畫鞍馬。神妙獨數江都王。將軍得名三十載。人間又見真乘黄。曾貌先帝照夜白。龍池十日飛霹靂。内府殷紅馬腦盤。婕妤傳詔才人索。盌賜將軍拜舞歸。輕紈細綺相追飛。貴戚權門得筆跡。始覺屏障生光輝。昔日太宗拳毛騧。近時郭家師子花。今之新圖有二馬。復令識者久嘆嗟。此皆騎戰一敵萬。縞素漠漠開風沙。其餘七匹亦殊絕。逈若寒空動煙雪。霜蹄蹴踏長楸間。馬官厮養森成列。可憐九馬爭神駿。顧視清高氣深穩。借問苦心愛者誰。後有韋諷前支遁。憶昔巡幸新豐宫。翠華拂天來向東。騰驤磊落三萬匹。皆與此圖筋骨同。自從獻寶朝河宗。無復射蛟江水中。君不見金粟堆前松柏裏。龍媒去盡鳥呼風。",
"坐標版本異文、夾注"=>array(
"〚3207:1〛"=>"〖1〗韋諷録事宅觀曹將軍畫馬圖",
"〚3207:4.2.5-7〛"=>"〖眞乘黃〗真乘黄",
"〚3207:6.1.1-2〛"=>"〖內府〗内府",
"〚3207:6.1.5-6〛"=>"〖瑪瑙〗馬腦",
"〚3207:7.1.1-2〛"=>"〖碗賜〗盌賜",
"〚3207:8.1.6-7〛"=>"〖筆迹〗筆跡",
"〚3207:8.2.3-4〛"=>"〖屛障〗屏障",
"〚3207:10.2.6-7〛"=>"〖歎嗟〗嘆嗟",
"〚3207:12.2.1-2〛"=>"〖迥若〗逈若",
"〚3207:16.1.6-7〛"=>"〖豐宮〗豐宫",
),
),

);
?>