<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《絕句四首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3224",
"版本"=>
array(
"詩文"=>array("堂西長笋别開門。塹北行椒却背村。梅熟許同朱老喫。松高擬對阮生論[朱阮劍外相知]。","欲作魚梁雲覆湍。因驚四月雨聲寒。青溪先有蛟龍窟。竹石如山不敢安。","兩箇黃鸝鳴翠柳。一行白鷺上青天。䆫含西嶺千秋雪。門泊東吳萬里舡[西山白雪，四時不消]。","藥條藥甲潤青青。色過棕亭入草亭。苗滿空山慙取譽。根居隙地怯成形。",),

"坐標版本異文、夾注"=>array(
"〚3224:1:5.1.5-7〛"=>"〖別開門〗别開門",
"〚3224:1:5.2.5-7〛"=>"〖卻背村〗却背村",
"〚3224:1:6.2.5-7〛"=>"〖阮生論〗阮生論[朱阮劍外相知]",
"〚3224:3:16.1.1-2〛"=>"〖窗含〗䆫含",
"〚3224:3:16.2.5-7〛"=>"〖萬里船〗萬里舡[西山白雪，四時不消]",
"〚3224:4:21.1.5-7〛"=>"〖慚取譽〗慙取譽",
),
),

);
?>