<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《憶昔二首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3226",
"版本"=>
array(
"詩文"=>array("憶昔先皇廵朔方。千乘萬騎入咸陽。陰山驕子汗血馬。長驅東胡胡走藏。鄴城反覆不足怪。關中小兒壞紀綱。張后不樂上爲忙。至今今上猶撥亂。勞身焦思補四方。我昔近侍叨奉引。出兵整肅不可當。為留猛士守未央。致使岐雍防西羌。犬戎直來坐御牀。百官跣足隨天王。願見北地傅介子。老儒不用尚書郎。","憶昔開元全盛日。小邑猶藏萬家室。稻米流脂粟米白。公私倉廩俱豐實。九州道路無豺虎。遠行不勞吉日出。齊紈魯縞車班班。男耕女桑不相失。宫中聖人奏雲門。天下朋友皆膠漆。百餘年間未災變。叔孫禮樂蕭何律。豈聞一絹値萬錢。有田種穀今流血。洛陽宫殿燒焚盡。宗廟新除狐兔穴。傷心不忍問耆舊。復恐初從亂離說。小臣魯鈍無所能。朝廷記識蒙禄秩。周宣中興望我皇。灑血江漢長衰疾。",),

"坐標版本異文、夾注"=>array(
"〚3236:1:5.1.5-7〛"=>"〖巡朔方〗廵朔方",
"〚3236:1:11.1.1-2〛"=>"〖爲留〗為留",
"〚3236:2:21.1.1-2〛"=>"〖宮中〗宫中",
"〚3236:2:24.1.3-4〛"=>"〖宮殿〗宫殿",
"〚3236:2:26.2.6-7〛"=>"〖祿秩〗禄秩",
),
),

);
?>