<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《遣悶奉呈嚴鄭公二十韻》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3276",
"版本"=>
array(
"詩文"=>"白水魚竿客。清秋鶴髮翁。胡為來幕下。秖合在舟中。黄卷真如律。青袍也自公。老妻憂坐痺。幼女問頭風。平地專欹倒。分曹失異同。禮甘衰力就。義忝上官通。疇昔論詩早。光輝仗鉞雄。寬容存性拙。剪拂念途窮。露裛思藤架。煙霏想桂叢。信然龜觸網。直作鳥窺籠。西嶺紆村北。南江繞舍東。竹皮寒舊翠。椒實雨新紅。浪簸船應拆。杯乾瓮即空。藩籬生野徑。斤斧任樵童。束縛酬知己。蹉𧿶効小忠。周防期稍稍。太簡遂怱怱。曉入朱扉啓。昬歸畫角終。不成尋别業。未敢息微躬。烏鵲愁銀漢。駑駘怕錦幪。會希全物色。時放倚梧桐。",
"坐標版本異文、夾注"=>array(
"〚3276:4.1.1-2〛"=>"〖胡爲〗胡為",
"〚3276:4.2.1-2〛"=>"〖祇合〗秖合",
"〚3276:5.1.1-5〛"=>"〖黃卷眞如律〗黄卷真如律",
"〚3276:7.1.3-4〛"=>"〖專攲〗專欹",
"〚3276:15.2.4-5〛"=>"〖卽空〗即空",
"〚3276:17.2.1-3〛"=>"〖蹉跎效〗蹉𧿶効",
"〚3276:18.2.4-5〛"=>"〖匆匆〗怱怱",
"〚3276:19.1.5〛"=>"〖啟〗啓",
"〚3276:19.2.1-2〛"=>"〖昏歸〗昬歸",
"〚3276:20.1.4-5〛"=>"〖別業〗别業",
),
),

);
?>