<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《奉觀嚴鄭公廳事岷山沲江畫圖十韻》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3293",
"版本"=>
array(
"詩題"=>"奉觀嚴鄭公廳事岷山沲江畫圖十韻",
"詩文"=>"沲水流中座。岷山到此堂。白波吹粉壁。青嶂插雕梁。直訝杉松冷。兼疑菱荇香。雪雲虚點綴。沙草得微茫。嶺雁隨毫末。川蜺飲練光。霏紅洲蘂亂。拂黛石蘿長。暗谷非關雨。丹楓不為霜。秋成玄圃外。景物洞庭傍。繪事功殊絕。幽襟興激昂。從來謝太傅。邱壑道難忘。",
"坐標版本異文、夾注"=>array(
"〚3293:1〛"=>"〖1〗奉觀嚴鄭公廳事岷山沲江畫圖十韻",
"〚3293:3.1.1-2〛"=>"〖沱水〗沲水",
"〚3293:6.1.3-5〛"=>"〖虛點綴〗虚點綴",
""=>"〖川霓〗川蜺",
"〚3293:8.1.3-4〛"=>"〖洲蕊〗洲蘂",
"〚3293:9.2.3-4〛"=>"〖不爲〗不為",
"〚3293:12.2.1-2〛"=>"〖丘壑〗邱壑",
),
),

);
?>