<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《別唐十五誡，因寄禮部賈侍郎》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3304",
"版本"=>
array(
"詩文"=>"九載一相逢。百年能幾何。復為萬里别。送子山之阿。白鶴久同林。潛魚本同河。未知棲集期。衰老強高歌。歌罷兩悽惻。六龍忽蹉𧿶。相視髮皓白。况難駐羲和。胡星墜燕地。漢將仍橫戈。蕭條四海內。人少豺虎多。少人慎莫投。多虎信所過。飢有易子食。獸猶畏虞羅。子負經濟才。天門鬱嵯峨。飄颻適東周。來往若崩波。南宮吾故人。白馬金盤陁。雄筆映千古。見賢心靡他。念子善師事。歲寒守舊柯。為吾謝賈公。病肺卧江沲。",
"坐標版本異文、夾注"=>array(
"〚3304:4.1.1-5〛"=>"〖復爲萬里別〗復為萬里别",
"〚3304:6.1.3-4〛"=>"〖栖集〗棲集",
"〚3304:7.2.4-5〛"=>"〖蹉跎〗蹉𧿶",
"〚3304:8.2.1-2〛"=>"〖況難〗况難",
"〚3304:15.2.5〛"=>"〖陀〗陁",
"〚3304:18.1.1-2〛"=>"〖爲吾〗為吾",
"〚3304:18.2.1-5〛"=>"〖病肺臥江沱〗病肺卧江沲",
),
),

);
?>