<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《哭台州鄭司戶蘇少監》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3312",
"版本"=>
array(
"詩文"=>"故舊誰憐我。平生鄭與蘇。存亡不重見。喪亂獨前途。豪俊何人在。文章掃地無。羈遊萬里闊。凶問一年俱。白首中原上。清秋大海隅。夜臺當北斗。泉路著東吳。得罪台州去。時危棄碩儒。移官蓬閣後。穀貴歿潛夫。流慟嗟何及。銜寃有是夫。道消詩發興。心息酒為徒。許與才雖薄。追誰跡未拘。班揚名甚盛。嵇阮逸相須。會取君臣合。寧詮品命殊。賢良不必展。廊廟偶然趨。勝决風塵際。功安造化爐。從容詢舊學。慘淡閟陰符。擺落嫌疑久。哀傷志力輸。俗依綿谷異。客對雪山孤。童稚思諸子。交朋列友于。情乖清酒送。望絕撫墳呼。瘧痢餐巴水。瘡痍老蜀都。飄零迷哭處。天地日榛蕪。",
"坐標版本異文、夾注"=>array(
"〚3312:11.2.1-2〛"=>"〖銜冤〗銜寃",
"〚3312:12.2.4-5〛"=>"〖爲徒〗為徒",
"〚3312:13.2.3-5〛"=>"〖迹未拘〗跡未拘",
"〚3312:17.1.1-2〛"=>"〖勝決〗勝决",
),
),

);
?>