<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《狂歌行贈四兄》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3396",
"版本"=>
array(
"詩文"=>"與兄行年校一歲。賢者是兄愚者弟。兄將富貴等浮雲。弟切功名好權勢。長安秋雨十日泥。我曹鞴馬聽晨鷄。公卿朱門未開鏁。我曹已到肩相齊。吾兄睡穩方舒膝。不韈不巾踏曉日。男啼女哭莫我知。身上須繒腹中實。今年思我來嘉州。嘉州酒重花繞樓。樓頭喫酒樓下臥。長歌短詠還相酬。四時八節還拘禮。女拜弟妻男拜弟。幅巾鞶帶不掛身。頭脂足垢何曾洗。吾兄吾兄巢許倫。一生喜怒常任真。日斜枕肘寢已熟。啾啾唧唧何爲人。",
"坐標版本異文、夾注"=>array(
"〚3396:5.2.5-7〛"=>"〖聽晨雞〗聽晨鷄",
"〚3396:6.1.5-7〛"=>"〖未開鎖〗未開鏁",
"〚3396:12.1.5-7〛"=>"〖不挂身〗不掛身",
"〚3396:13.2.5-7〛"=>"〖常任眞〗常任真",
"〚3396:14.2.3-4〛"=>"〖喞喞〗唧唧",
),
),

);
?>