<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《十二月一日三首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3473",
"版本"=>
array(
"詩文"=>array("今朝臘月春意動。雲安縣前江可憐。一聲何處送書鴈。百丈誰家上水船。未將梅蘂驚愁眼。要取椒花媚遠天。明光起草人所羡。肺病幾時朝日邊。","寒輕市上山煙碧。日滿樓前江霧黄。負鹽出井此谿女。打鼓發船何郡郎。新亭舉目風景切。茂陵著書消渴長。春花不愁不爛熳。楚客唯聽棹相將。","即看鷰子入山扉。豈有黃鸝歷翠微。短短桃花臨水岸。輕輕柳絮點人衣。春來準擬開懷久。老去親知見面稀。他日一杯難强進。重嗟筋力故山違。",),

"坐標版本異文、夾注"=>array(
"〚3473:1:6.1.6-7〛"=>"〖書雁〗書鴈",
"〚3473:1:7.1.3-4〛"=>"〖梅蕊〗梅蘂",
"〚3473:1:8.1.5-7〛"=>"〖人所羨〗人所羡",
"〚3473:2:12.2.5-7〛"=>"〖江霧黃〗江霧黄",
"〚3473:2:15.1.6-7〛"=>"〖爛漫〗爛熳",
"〚3473:3:19.1.1-3〛"=>"〖卽看燕〗即看鷰",
"〚3473:3:22.1.5-7〛"=>"〖難強進〗難强進",
),
),

);
?>