<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《客居》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3504",
"版本"=>
array(
"詩文"=>"客居所居堂。前江後山根。下塹萬尋岸。蒼濤鬱飛飜。葱青衆木梢。邪豎雜石痕。子規晝夜啼。壯士斂精魂。峽開四千里。水合數百源。人虎相半居。相傷終兩存。蜀麻久不來。吳鹽擁荊門。西南失大將。商旅自星奔。今又降元戎。已聞動行軒。舟子候利涉。亦憑節制尊。我在路中央。生理不得論。臥愁病脚廢。徐步視小園。短畦帶碧草。悵望思王孫。鳳隨其皇去。籬雀暮喧繁。覽物想故國。十年別荒村。日暮歸幾翼。北林空自昬。安得覆八溟。爲君洗乾坤。稷契易爲力。犬戎何足吞。儒生老無成。臣子憂四番。篋中有舊筆。情至時復援。",
"坐標版本異文、夾注"=>array(
"〚3504:4.2.3-5〛"=>"〖鬱飛翻〗鬱飛飜",
"〚3504:5.1.3-5〛"=>"〖眾木梢〗衆木梢",
"〚3504:9.2.3-5〛"=>"〖擁荆門〗擁荊門",
"〚3504:14.1.3-5〛"=>"〖病腳廢〗病脚廢",
"〚3504:16.1.2-4〛"=>"〖隨其凰〗隨其皇",
"〚3504:18.2.3-5〛"=>"〖空自昏〗空自昬",
),
),

);
?>