<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《客堂》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3537",
"版本"=>
array(
"詩文"=>"憶昨離少城。而今異楚蜀。舍舟復深山。窅窕一林麓。棲泊雲安縣。消中内相毒。舊疾廿載來。衰年得無足。死爲殊方鬼。頭白免短促。老馬終望雲。南鴈意在北。别家長兒女。欲起慙筋力。客堂叙節改。具物對羈束。石暄蕨芽紫。渚秀蘆笋緑。巴鶯紛未稀。徼麥早向熟。悠悠日動江。漠漠春辭木。臺郎選才俊。自顧亦已極。前輩聲名人。埋没何所得。居然綰章紱。受性本幽獨。平生憩息地。必種數竿竹。事業只濁醪。營葺但草屋。上公有記者。累奏資薄禄。主憂豈濟時。身遠彌曠職。循文廟筭正。獻可天衢直。尚想趨朝廷。毫髮裨社稷。形骸今若是。進退委行色。",
"坐標版本異文、夾注"=>array(
"〚3537:5.1.1-2〛"=>"〖栖泊〗棲泊",
"〚3537:5.2.3-5〛"=>"〖內相毒〗内相毒",
"〚3537:8.2.1-2〛"=>"〖南雁〗南鴈",
"〚3537:9.1.1-2〛"=>"〖別家〗别家",
"〚3537:9.2.3-5〛"=>"〖慚筋力〗慙筋力",
"〚3537:10.1.3-5〛"=>"〖敍節改〗叙節改",
"〚3537:11.2.3-5〛"=>"〖蘆笋綠〗蘆笋緑",
"〚3537:15.2.1-2〛"=>"〖埋沒〗埋没",
"〚3537:19.2.3-5〛"=>"〖資薄祿〗資薄禄",
),
),

);
?>