<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《古柏行》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》6.3575",
"版本"=>
array(
"詩題"=>"古栢行",
"詩文"=>"孔明廟前有老栢。柯如青銅根如石。霜皮溜雨四十圍。黛色參天二千尺。君臣已與時際會。樹木猶爲人愛惜。雲來氣接巫峽長。月出寒通雪山白。憶昨路繞錦亭東。先主武侯同閟宫。崔嵬枝幹郊原古。窈窕丹青户牖空。落落盤踞雖得地。冥冥孤高多烈風。扶持自是神明力。正直元因造化功。大厦如傾要梁棟。萬牛迴首丘山重。不露文章世已驚。未辭翦伐誰能送。苦心豈免容螻蟻。香葉終經宿鸞鳳。志士幽人莫怨嗟。古來材大難爲用。",
"坐標版本異文、夾注"=>array(
"〚3575:1〛"=>"〖1〗古栢行",
"〚3575:3.1.5-7〛"=>"〖有老柏〗有老栢",
"〚3575:7.2.5-7〛"=>"〖同閟宮〗同閟宫",
"〚3575:8.2.5-6〛"=>"〖戶牖〗户牖",
"〚3575:11.1.1-2〛"=>"〖大廈〗大厦",
"〚3575:11.2.3-4〛"=>"〖回首〗迴首",
"〚3575:3.1.1〛"=>"〖〗",
),
),

);
?>