<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《贈崔十三評事公輔》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3598",
"版本"=>
array(
"詩文"=>"飄颻西極馬。來自渥洼池。颯飁寒山桂。低徊風雨枝。我聞龍正直。道屈爾何為。且有元戎命。悲歌識者知。官聯辭冗長。行路洗欹危。脫劍主人贈。去帆春色隨。陰沈鐵鳳闕。教練羽林兒。天子朝侵早。雲臺仗數移。分軍應供給。百姓日支離。黠吏因封己。公才或守雌。燕王買駿骨。渭老得熊羆。活國名公在。拜壇群寇疑。冰壺動瑤碧。野水失蛟螭。入幕諸彥聚。渴賢高選宜。鶱騰坐可致。九萬起於斯。復進出矛戟。昭然開鼎彝。會看之子貴。歎及老夫衰。豈但江曾決。還思霧一披。暗塵生古鏡。拂匣照西施。舅氏多人物。無慙困翮垂。",
"坐標版本異文、夾注"=>array(
"〚3598:5.2.3-5〛"=>"〖爾何爲〗爾何為",
"〚3598:7.2.3-5〛"=>"〖洗攲危〗洗欹危",
"〚3598:14.2.3-5〛"=>"〖羣寇疑〗群寇疑",
"〚3598:22.2.1-2〛"=>"〖無慚〗無慙",
),
),

);
?>