<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《貽華陽柳少府》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3612",
"版本"=>
array(
"詩文"=>"繫馬喬木間。問人野寺門。柳侯披衣笑。見我顏色溫。並坐石下堂。俛視大江奔。火雲洗月露。絕壁上朝暾。自非曉相訪。觸熱生病根。南方六七月。出入異中原。老少多暍死。汗踰水漿翻。俊才得之子。筋力不辭煩。指揮當世事。語及戎馬存。涕淚濺我裳。悲氣排帝𨵽。鬱陶抱長策。義仗知者論。吾衰臥江漢。但媿識璵璠。文章一小伎。於道未為尊。起余幸班白。因是託子孫。俱客古信州。結廬依毀垣。相去四五里。徑微山葉繁。時危挹佳士。况免軍旅喧。醉從趙女舞。歌鼓秦人盆。子壯顧我傷。我驩兼淚痕。餘生如過鳥。故里今空村。",
"坐標版本異文、夾注"=>array(
"〚3612:5.1.1-2〛"=>"〖幷坐〗並坐",
"〚3612:5.2.1-2〛"=>"〖俯視〗俛視",
"〚3612:12.2.4-5〛"=>"〖帝閽〗帝𨵽",
"〚3612:14.2.1-2〛"=>"〖但愧〗但媿",
"〚3612:15.2.3-5〛"=>"〖未爲尊〗未為尊",
"〚3612:19.2.1-2〛"=>"〖況免〗况免",
"〚3612:21.2.1-2〛"=>"〖我歡〗我驩",
),
),

);
?>