<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《七月三日亭午已後，校熱退，晚加小涼，穩睡有詩，因論壯年樂事，戲呈元二十一曹長》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3633",
"版本"=>
array(
"詩文"=>"今兹商用事。餘熱亦已末。衰年旅炎方。生意從此活。亭午減汗流。北鄰耐人聒。晚風爽烏匼。筋力蘇摧折。閉目踰十旬。大江不止渴。退藏恨雨師。健步聞旱魃。園蔬抱金玉。無以供采掇。密雲雖聚散。徂暑終衰歇。前聖眘焚巫。武王親救暍。陰陽相主客。時序遞廻斡。灑落唯清秋。昬霾一空闊。蕭蕭紫塞雁。南向欲行列。欻思紅顏日。霜露凍堦闥。胡馬挾雕弓。鳴弦不虛發。長鈚逐狡兔。突羽當滿月。惆悵白頭吟。蕭條游俠窟。臨軒望山閣。縹緲安可越。高人鍊丹砂。未念將朽骨。少壯跡頗踈。歡樂曾倐忽。杖藜風塵際。老醜難剪拂。吾子得神仙。本是池中物。賤夫美一睡。煩促嬰詞筆。",
"坐標版本異文、夾注"=>array(
"〚3633:3.1.1-2〛"=>"〖今茲〗今兹",
"〚3633:12.2.4-5〛"=>"〖迴斡〗廻斡",
"〚3633:13.2.1-2〛"=>"〖昏霾〗昬霾",
"〚3633:15.2.3-5〛"=>"〖凍階闥〗凍堦闥",
"〚3633:18.2.3-5〛"=>"〖遊俠窟〗游俠窟",
"〚3633:21.1.3-5〛"=>"〖迹頗疏〗跡頗踈",
),
),

);
?>