<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《牽牛織女》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3649",
"版本"=>
array(
"詩文"=>"牽牛出河西。織女處其東。萬古永相望。七夕誰見同。神光竟難候。此事終蒙朧。颯然精靈合。何必秋遂通。亭亭新糚立。龍駕具曾空。世人亦為爾。祈請走兒童。稱家隨豐儉。白屋達公宫。膳夫翊堂殿。鳴玉淒房櫳。曝衣遍天下。曳月揚微風。蛛絲小人態。曲綴瓜果中。初筵裛[從水裛聲，統一碼缺]重露。日出甘所終。嗟汝未嫁女。秉心鬱忡忡。防身動如律。竭力機杼中。雖無姑舅事。敢昧織作功。明明君臣契。咫尺或未容。義無弃禮法。恩始夫婦恭。小大有佳期。戒之在至公。方圓苟齟齬。丈夫多英雄。",
"坐標版本異文、夾注"=>array(
"〚3649:8.1.3-5〛"=>"〖亦爲爾〗亦為爾",
"〚3649:9.2.4-5〛"=>"〖公宮〗公宫",
"〚3649:13.1.3-5〛"=>"〖裛重露〗裛[從水裛聲，統一碼缺]重露",
"〚3649:18.1.3-5〛"=>"〖棄禮法〗弃禮法",
),
),

);
?>