<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《催宗文樹雞柵》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3670",
"版本"=>
array(
"詩題"=>"催宗文樹鷄柵",
"詩文"=>"吾衰怯行邁。旅次展崩迫。愈風傳烏鷄。秋卵方漫喫。自春生成者。隨母向百翮。驅趂制不禁。喧呼山腰宅。課奴殺青竹。終日憎赤幘。踏藉盤桉翻。塞蹊使之隔。牆東有隙地。可以樹高柵。避熱時來歸。問兒所為跡。織籠曹其內。令入不得擲。稀閒可突過。觜爪還污席。我寬螻蟻遭。彼免狐貉厄。應宜各長幼。自此均勍敵。籠柵念有脩。近身見損益。明明領處分。一一當剖析。不昧風雨晨。亂離減憂慼。其流則凡鳥。其氣心匪石。倚賴窮歲晏。撥煩去冰釋。未似尸鄉翁。拘留蓋阡陌。",
"坐標版本異文、夾注"=>array(
"〚3670:1〛"=>"〖1〗催宗文樹鷄柵",
"〚3670:4.1.3-5〛"=>"〖傳烏雞〗傳烏鷄",
"〚3670:6.1.1-2〛"=>"〖驅趁〗驅趂",
"〚3670:10.2.3-5〛"=>"〖所爲迹〗所為跡",
"〚3670:12.1.1-2〛"=>"〖稀間〗稀閒",
"〚3670:15.1.3-5〛"=>"〖念有修〗念有脩",
"〚3670:20.1.3-5〛"=>"〖尸鄕翁〗尸鄉翁",
),
),

);
?>