<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《驅竪子摘蒼耳》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3678",
"版本"=>
array(
"詩文"=>"江上秋已分。林中瘴猶劇。畦丁告勞苦。無以供日夕。蓬莠獨不燋。野蔬暗泉石。卷耳況療風。童兒且時摘。侵星驅之去。爛熳任遠適。放筐亭午際。洗剥相蒙冪。登床半生熟。下筯還小益。加點瓜薤閒。依稀橘奴跡。亂世誅求急。黎民糠籺窄。飽食復何心。荒哉膏粱客。富家厨肉臭。戰地骸骨白。寄語惡少年。黄金且休擲。",
"坐標版本異文、夾注"=>array(
"〚3678:7.2.1-2〛"=>"〖爛漫〗爛熳",
"〚3678:8.2.1-2〛"=>"〖洗剝〗洗剥",
"〚3678:9.1.1-2〛"=>"〖登牀〗登床",
"〚3678:10.1.3-5〛"=>"〖瓜薤間〗瓜薤閒",
"〚3678:10.2.3-5〛"=>"〖橘奴迹〗橘奴跡",
"〚3678:13.1.3-5〛"=>"〖廚肉臭〗厨肉臭",
"〚3678:14.2.1-2〛"=>"〖黃金〗黄金",
),
),

);
?>