<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《贈李十五丈別》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3726",
"版本"=>
array(
"詩題"=>"贈李十五丈别",
"詩文"=>"峽人鳥獸居。其室附層顛。下臨不測江。中有萬里船。多病紛倚薄。少留改歲年。絕域誰慰懷。開顏喜名賢。孤陋忝末親。等級敢比肩。人生意氣合。相與襟袂連。一日兩遣僕。三日一共筵。揚論展寸心。壯筆過飛泉。玄成美價存。子山舊業傳。不聞八尺軀。常受衆目憐。且為辛苦行。蓋被生事牽。北廻白帝棹。南入黔陽天。汧[從水开聲，統一碼缺]公制方隅。迥出諸侯先。封內如太古。時危獨蕭然。清高金莖露。正直朱絲絃。昔在堯四岳。今之黄潁川。于邁恨不同。所思無由宣。山深水增波。解榻秋露懸。客遊雖云久。主要月再圓。晨集風渚亭。醉操雲嶠篇。丈夫貴知己。歡罷念歸旋。",
"坐標版本異文、夾注"=>array(
"〚3726:1〛"=>"〖1〗贈李十五丈别",
"〚3726:12.2.3-5〛"=>"〖眾目憐〗衆目憐",
"〚3726:13.1.1-2〛"=>"〖且爲〗且為",
"〚3726:14.1.1-2〛"=>"〖北迴〗北廻",
"〚3726:15.1.1-2〛"=>"〖汧公〗汧[從水开聲，統一碼缺]公",
"〚3726:18.2.3-5〛"=>"〖黃潁川〗黄潁川",
),
),

);
?>