<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《夔州歌十絕句》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3747",
"版本"=>
array(
"詩文"=>array("中巴之東巴東山。江水開闢流其閒。白帝高為三峽鎮。瞿塘險過百牢關。","白帝夔州各異城。蜀江楚峽混殊名。英雄割據非天意。霸主并吞在物情。","羣雄競起問前朝。王者無外見今朝。比訝漁陽結怨恨。元聽舜日舊簫韶。","赤甲白鹽俱刺天。閭閻繚繞接山巔。楓林橘樹丹青合。複道重樓錦繡懸。","瀼東瀼西一萬家。江北江南春冬花。背飛鶴子遺瓊蘂。相趂鳬鶵入蔣芽。","東屯稻畦一百頃。北有澗水通青苗。晴浴狎鷗分處處。雨隨神女下朝朝。","蜀麻吳鹽自古通。萬斛之舟行若風。長年三老長謌裏。白晝攤錢高浪中。","憶昔咸陽都市合。山水之圖張賣時。巫峽曾經寶屏見。楚宮猶對碧峯疑。","閬風玄圃與蓬壺。中有高唐天下無。借問夔州壓何處。峽門江腹擁城隅。","武侯祠堂不可忘。中有松栢參天長。干戈滿地客愁破。雲日如火炎天凉。",),

"坐標版本異文、夾注"=>array(
"〚3747:1:5.2.5-7〛"=>"〖流其間〗流其閒",
"〚3747:1:6.1.3-4〛"=>"〖高爲〗高為",
"〚3747:2:11.2.3-4〛"=>"〖幷吞〗并吞",
"〚3747:5:26.1.5-7〛"=>"〖遺瓊蕊〗遺瓊蘂",
"〚3747:5:26.2.1-4〛"=>"〖相趁鳧雛〗相趂鳬鶵",
"〚3747:7:36.1.5-7〛"=>"〖長歌裏〗長謌裏",
"〚3747:8:41.1.5-7〛"=>"〖寶屛見〗寶屏見",
"〚3747:10:50.2.3-4〛"=>"〖松柏〗松栢",
"〚3747:10:51.2.5-7〛"=>"〖炎天涼〗炎天凉",
),
),

);
?>