<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《秋興八首》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.3789",
"版本"=>
array(
"詩文"=>array("玉露凋傷楓樹林。巫山巫峽氣蕭森。江閒波浪兼天湧。塞上風雲接地陰。叢菊兩開他日淚。孤舟一繫故園心。寒衣處處催刀尺。白帝城高急暮砧。","夔府孤城落日斜。每依北斗望京華。聽猿實下三聲淚。奉使虛隨八月查。畫省香爐違伏枕。山樓粉堞隱悲笳。請看石上藤蘿月。已映洲前蘆荻花。","千家山郭靜朝暉。日日江樓坐翠微。信宿漁人還泛泛。清秋燕子故飛飛。匡衡抗疏功名薄。劉向傳經心事違。同學少年多不賤。五陵衣馬自輕肥。","聞道長安似弈棊。百年世事不勝悲。王侯第宅皆新主。文武衣冠異昔時。直北關山金鼓振。征西車馬羽書遲。魚龍寂寞秋江冷。故國平居有所思。","蓬萊宫闕對南山。承露金莖霄漢閒。西望瑤池降王母。東來紫氣滿函關。雲移雉尾開宫扇。日繞龍鱗識聖顏。一臥滄江驚歲晚。幾迴青瑣點朝班。","瞿塘峽口曲江頭。萬里風煙接素秋。花萼夾城通御氣。芙蓉小苑入邊愁。珠簾繡柱圍黃鵠。錦纜牙檣起白鷗。迴首可憐歌舞地。秦中自古帝王州。","昆明池水漢時功。武帝旌旗在眼中。織女機絲虛夜月。石鯨鱗甲動秋風。波漂菰米沉雲黑。露冷蓮房墜粉紅。關塞極天唯鳥道。江湖滿地一漁翁。","昆吾御宿自逶迤。紫閣峯陰入渼陂。香稻啄餘鸚鵡粒。碧梧栖老鳳凰枝。佳人拾翠春相問。仙侶同舟晚更移。綵筆昔曾干氣象。白頭吟望苦低垂。",),

"坐標版本異文、夾注"=>array(
"〚3789:1:6.1.1-4〛"=>"〖江間波浪〗江閒波浪",
"〚3789:2:13.2.3-7〛"=>"〖虛隨八月槎〗虛隨八月查",
"〚3789:5:33.1.1-4〛"=>"〖蓬萊宮闕〗蓬萊宫闕",
"〚3789:5:33.2.5-7〛"=>"〖霄漢間〗霄漢閒",
"〚3789:5:35.1.5-7〛"=>"〖開宮扇〗開宫扇",
"〚3789:6:43.1.1-4〛"=>"〖回首可憐〗迴首可憐",
),
),

);
?>