<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《遣懷》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.4119",
"版本"=>
array(
"詩文"=>"昔我遊宋中。惟梁孝王都。名今陳留亞。劇則貝魏俱。邑中九萬家。高棟照通衢。舟車半天下。主客多歡娛。白刃讎不義。黄金傾有無。殺人紅塵裏。報答在斯須。憶與高李輩[適、白]。論交入酒壚。兩公壯藻思。得我色敷腴。氣酣登吹臺。懷古視平蕪。芒碭雲一去。鴈鶩空相呼。先帝正好武。寰海未凋枯。猛將收西域。長戟破林胡。百萬攻一城。獻捷不云輸。組練棄如泥。尺土負百夫。拓境功未已。元和辭大鑪。亂離朋友盡。合沓歲月徂。吾衰將焉託。存殁再嗚呼。蕭條益堪媿。獨在天一隅。乘黄已去矣。凡馬徒區區。不復見顏鮑。繫舟臥荊巫。臨餐吐更食。常恐違撫孤。",
"坐標版本異文、夾注"=>array(
"〚4119:7.2.1-5〛"=>"〖黃金傾有無〗黄金傾有無",
"〚4119:9.1.3-5〛"=>"〖高李輩〗高李輩[適、白]",
"〚4119:12.2.1-2〛"=>"〖雁鶩〗鴈鶩",
"〚4119:17.2.3-5〛"=>"〖辭大爐〗辭大鑪",
"〚4119:19.2.1-2〛"=>"〖存歿〗存殁",
"〚4119:20.1.3-5〛"=>"〖益堪愧〗益堪媿",
"〚4119:21.1.1-5〛"=>"〖乘黃已去矣〗乘黄已去矣",
"〚4119:22.2.3-5〛"=>"〖臥荆巫〗臥荊巫",
),
),

);
?>