<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《往在》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》7.4129",
"版本"=>
array(
"詩文"=>"往在西京時。胡來滿彤宮。中宵焚九廟。雲漢為之紅。解瓦飛十里。繐帷紛曾空。疚心惜木主。一一灰悲風。合昬排鐵騎。清旭散錦𩦺。賊臣表逆節。相賀以成功。是時妃嬪戮。連爲糞土叢。當宁陷玉座。白閒剝畫蟲。不知二聖處。私泣百歲翁。車駕既云還。楹角欻穹崇。故老復涕泗。祠官樹椅桐。宏壯不如初。已見帝力雄。前春禮郊廟。祀事親聖躬。微軀忝近臣。景從陪群公。登堦捧玉冊。峩冕聆金鍾。侍祠恧先露。掖垣邇濯龍。天子惟孝孫。五雲起九重。鏡奩換粉黛。翠羽猶葱朧。前者厭羯胡。後來遭犬戎。俎豆腐羶肉。罘罳行角弓。安得自西極。申命空山東。盡驅詣闕下。士庶塞關中。主將曉逆順。元元歸始終。一朝自罪己。萬里車書通。鋒鏑供鋤犁。征戍聽所從。冗官各復業。土著還力農。君臣節儉足。朝野懽呼同。中興似國初。繼體如太宗。端拱納諫諍[從言争聲，統一碼缺]。和風日沖融。赤墀櫻桃枝。隱映銀絲籠。千春薦陵寢。永永垂無窮。京都不再火。涇渭開愁容。歸號故松栢。老去苦飄蓬。",
"坐標版本異文、夾注"=>array(
"〚4129:4.2.3-5〛"=>"〖爲之紅〗為之紅",
"〚4129:7.1.1-2〛"=>"〖合昏〗合昬",
"〚4129:10.2.1-2〛"=>"〖白間〗白閒",
"〚4129:12.1.3-5〛"=>"〖旣云還〗既云還",
"〚4129:16.2.3-5〛"=>"〖陪羣公〗陪群公",
"〚4129:17.1.1-2〛"=>"〖登階〗登堦",
"〚4129:17.2.3-5〛"=>"〖聆金鐘〗聆金鍾",
"〚4129:29.2.3-5〛"=>"〖歡呼同〗懽呼同",
"〚4129:31.1.3-5〛"=>"〖納諫諍〗納諫諍[從言争聲，統一碼缺]",
"〚4129:35.1.3-5〛"=>"〖故松柏〗故松栢",
),
),

);
?>