<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《謁先主廟》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》8.4145",
"版本"=>
array(
"詩文"=>"慘澹風雲會。乘時各有人。力侔分社稷。志屈偃經綸。復漢留長策。中原仗老臣。雜耕心未已。歐血事酸辛。霸氣西南歇。雄圖曆數屯。錦江元過楚。劒閣復通秦。舊俗存祠廟。空山立鬼神。虛簷交鳥道。枯木半龍鱗。竹送清溪月。苔移玉座春。閭閻兒女換。歌舞歲時新。絶域歸舟遠。荒城繫馬頻。如何對搖落。况乃久風塵。孰與關張並。功臨耿鄧親。應天才不小。得士契無鄰。遲暮堪帷幄。飄零且釣緡。向來憂國淚。寂寞灑衣巾。",
"坐標版本異文、夾注"=>array(
"〚4145:3.1.1-5〛"=>"〖慘淡風雲會〗慘澹風雲會",
"〚4145:8.2.1-2〛"=>"〖劍閣〗劒閣",
"〚4145:13.1.1-2〛"=>"〖絕域〗絶域",
"〚4145:14.2.1-2〛"=>"〖況乃〗况乃",
"〚4145:15.1.3-5〛"=>"〖關張幷〗關張並",
"〚4145:18.2.3-5〛"=>"〖洒衣巾〗灑衣巾",
),
),

);
?>