<?php
/*
生成：本文檔用 PHP 生成。
說明：蕭滌非主編《杜甫全集校注》中關於《偶題》的資料。
*/
$蕭内容=array(
"書名"=>"蕭滌非主編《杜甫全集校注》8.4194",
"版本"=>
array(
"詩文"=>"文章千古事。得失寸心知。作者皆殊列。名聲豈浪垂。騷人嗟不見。漢道盛於斯。前輩飛騰入。餘波綺麗爲。後賢兼舊利。歷代各清規。法自儒家有。心從弱歲疲。永懷江左逸。多病鄴中奇。騄驥皆良馬。騏驎帶好兒。車輪徒已斲。堂構惜仍虧。漫作潛夫論。虛傳幼婦碑。緣情慰漂蕩。抱疾屢遷移。經濟慙長策。飛棲假一枝。塵沙傍蜂蠆。江峽繞蛟螭。蕭瑟唐虞遠。聯翩楚漢危。聖朝兼盜賊。異俗更喧卑。鬱鬱星辰劍。蒼蒼雲雨池。兩都開幕府。萬寓插軍麾。南海殘銅柱。東風避月支。音書恨烏鵲。號怒怪熊羆。稼穡分詩興。柴荊學土宜。故山迷白閣。秋水憶皇陂。不敢要佳句。愁來賦别離。",
"坐標版本異文、夾注"=>array(
"〚4194:14.1.3-5〛"=>"〖慚長策〗慙長策",
"〚4194:14.2.1-2〛"=>"〖飛栖〗飛棲",
"〚4194:22.2.1-2〛"=>"〖柴荆〗柴荊",
"〚4194:24.2.3-5〛"=>"〖賦別離〗賦别離",
),
),

);
?>