<?php
$詩文 = "蕭滌非主編《杜甫全集校注》

0003 望嶽

岱宗夫如何。齊魯青未了。造化鍾神秀。陰陽割昏曉。盪胸生曾雲。決眥入歸鳥。會當凌絶頂。一覽衆山小。

0008 登兗州城樓

東郡趨庭日。南樓縱目初。浮雲連海岱。平野入青徐。孤嶂秦碑在。荒城魯殿餘。從來多古意。臨眺獨躊躇。

0013 題張氏隱居二首

春山無伴獨相求。伐木丁丁山更幽。澗道餘寒歷冰雪。石門斜日到林邱。不貪夜識金銀氣。遠害朝看麋鹿遊。乘興杳然迷出處。對君疑是泛虚舟。
之子時相見。邀人晚興留。霽潭鱣發發。春草鹿呦呦。杜酒偏勞勸。張梨不外求。前村山路險。歸醉每無愁。

0022 劉九法曹鄭瑕丘石門宴集

秋水清無底。蕭然静客心。掾曹乘逸興。鞍馬到荒林。能吏逢聯璧。華筵直一金。晚來橫吹好。泓下亦龍吟。

0025 與任城許主簿遊南池

秋水通溝洫。城隅集小船。晚涼看洗馬。森木亂鳴蟬。菱熟經時雨。蒲荒八月天。晨朝降白露。遥憶舊青氈。

0027 對雨書懷走邀許主簿

東岳雲峯起。溶溶滿太虚。震雷翻幕鷰。驟雨落河魚。座對賢人酒。門聽長者車。相邀愧泥濘。騎馬到堦除。

0030 巳上人茅齋

巳公茅屋下。可以賦新詩。枕簟入林僻。茶瓜留客遲。江蓮摇白羽。天棘蔓青絲。空忝許詢輩。難酬支遁詞。

0034 房兵曹胡馬

胡馬大宛名。鋒稜瘦骨成。竹批雙耳峻。風入四蹄輕。所向無空闊。眞堪託死生。驍騰有如此。萬里可横行。

0038 畫鷹

素練風霜起。蒼鷹畫作殊。㩳身思狡兔。側目似愁胡。絛鏇光堪擿。軒楹勢可呼。何當擊凡鳥。毛血灑平蕪。

0042 遊龍門奉先寺

已從招提遊。更宿招提境。陰壑生虚籟。月林散清影。天闕象緯逼。雲臥衣裳冷。欲覺聞晨鍾。令人發深省。

0048 過宋員外之問舊莊

宋公舊池館。零落首陽阿。枉道祗從入。吟詩許更過。淹留問耆老。寂寞向山河。更識將軍樹。悲風日暮多。

0053 臨邑舍弟書至，苦雨，黄河泛溢，隄防之患，簿領所憂，因寄此詩，用寬其意

二儀積風雨。百谷漏波濤。聞道洪河坼。遥連滄海高。職司憂悄悄。郡國訴嗷嗷。舍弟卑棲邑。防川領簿曹。尺書前日至。版築不時操。難假黿鼉力。空瞻烏鵲毛。燕南吹畎畝。濟上没蓬蒿。螺蚌滿近郭。蛟螭乘九臯。徐關深水府。碣石小秋毫。白屋留孤樹。青天失萬艘。吾衰同泛梗。利涉想蟠桃。却倚天涯釣。猶能掣巨鼇。

0059 天寶初，南曹小司寇舅，於我太夫人堂下，壘土為山，一匱盈尺，以代彼朽木，承諸焚香瓷甌，甌甚安矣。旁植慈竹，蓋兹數峯，嶔岑嬋娟，宛有塵外數致。乃不知興之所至，而作是詩

一匱功盈尺。三峯意出羣。望中疑在野。幽處欲生雲。慈竹春陰覆。香爐曉勢分。惟南將獻壽。佳氣日氛氲。

0062 李監宅二首

尚覺王孫貴。豪家意頗濃。屏開金孔雀。褥隱繡芙蓉。且食雙魚美。誰看異味重。門闌多喜色。女壻近乘龍。
華館春風起。高城煙霧開。雜花分户映。嬌燕入簷廻。一見能傾座。虚懷只愛才。鹽官[《勘誤》改爲車]雖絆驥。名是漢庭來。

0068 夜宴左氏莊

風林纖月落。衣露淨琴張。暗水流花徑。春星帶草堂。檢書燒燭短。看劍引杯長。詩罷聞吳詠。扁舟意不忘。

0073 龍門

龍門橫野斷。驛樹出城來。氣色皇居近。金銀佛寺開。往還時屢改。川陸日悠哉。相閱征途上。生涯盡幾迴。

0076 贈李白

二年客東都。所歷厭機巧。野人對羶腥。蔬食常不飽。豈無青精飯。使我顔色好。苦乏大藥資。山林跡如掃。李侯金閨彦。脫身事幽討。亦有梁宋遊。方期拾瑶草。

0079 陪李北海宴歷下亭

東藩駐皂蓋。北渚淩青荷。海右此亭古。濟南名士多。雲山已發興。玉佩仍當謌。修竹不受暑。交流空湧波。蘊真愜所遇。落日將如何。貴賤俱物役。從公難重過。

0084 同李太守登歷下古城員外新亭

新亭結構罷。隱見清湖陰。跡藉臺觀舊。氣冥海岳深。圓荷想自昔。遺堞感至今。芳宴此時具。哀絲千古心。主稱壽尊客。筵秩宴北林。不阻蓬蓽興。得兼梁甫吟。

0092 暫如臨邑，至㟙山湖亭，奉懷李員外，率爾成興

野亭逼湖水。歇馬高林間。鼉吼風奔浪。魚跳日映山。暫遊阻詞伯。却望懷青關。靄靄生雲霧。唯應促駕還。

0095 與李十二白同尋范十隱居

李侯有佳句。往往似陰鏗。余亦東蒙客。憐君如弟兄。醉眠秋共被。携手日同行。更想幽期處。還尋北郭生。入門高興發。侍立小童清。落景聞寒杵。屯雲對古城。向來吟橘頌。誰欲討蓴羹。不願論簪笏。悠悠滄海情。

0099 贈李白

秋來相顧尚飄蓬。未就丹砂愧葛洪。痛飲狂歌空度日。飛揚跋扈為誰雄。

0103 冬日有懷李白

寂寞書齋裏。終朝獨爾思。更尋嘉樹傳。不忘角弓詩。裋褐風霜入。還丹日月遲。未因乘興去。空有鹿門期。

0107 春日憶李白

白也詩無敵。飄然思不羣。清新庾開府。俊逸鮑參軍。渭北春天樹。江東日暮雲。何時一樽酒。重與細論文。

0111 送孔巢父謝病歸遊江東兼呈李白

巢父掉頭不肯住。東將入海隨煙霧。詩卷長留天地間。釣竿欲拂珊瑚樹。深山大澤龍虵遠。春寒野陰風景暮。蓬萊織女廻雲車。指點虚無是征路。自是君身有仙骨。世人那得知其故。惜君只欲苦死留。富貴何如草頭露。蔡侯静者意有餘。清夜置酒臨前除。罷琴惆悵月照席。幾歲寄我空中書。南尋禹穴見李白。道甫問信今何如。

0120 鄭駙馬宅宴洞中

主家陰洞細煙霧。留客夏簟清琅玕。春酒盃濃琥珀薄。冰漿椀碧馬腦寒。悞疑茅堂過江麓。已入風磴霾雲端。自是秦樓壓鄭谷。時聞雜佩聲珊珊。

0126 贈特進汝陽王二十二韻

特進羣公表。天人夙德升。霜蹄千里駿。風翮九霄鵬。服禮求毫髮。惟忠忘寢興。聖情常有眷。朝退若無憑。仙醴來浮蟻。奇毛或賜鷹。清關塵不雜。中使日相乘。晚節嬉遊簡。平居孝義稱。自多親棣萼。誰敢問山陵。學業醇儒富。辭華哲匠能。筆飛鸞聳立。章罷鳳騫騰。精理通談笑。忘形向友朋。寸長堪繾綣。一諾豈驕矜。已忝歸曹植。何知對李膺。招要恩屢至。崇重力難勝。披霧初歡夕。高秋爽氣澄。樽罍臨極浦。鳧鴈宿張燈。花月窮遊宴。炎天避鬱蒸。硯寒金井水。簷動玉壺冰。瓢飲唯三逕。巖栖在百層。且持蠡測海。況挹酒如澠。鴻寶寧全祕。丹梯庶可凌。淮王門有客。終不媿孫登。

0136 飲中八仙歌

知章騎馬似乘船。眼花落井水底眠。汝陽三斗始朝天。道逢麴車口流涎。恨不移封向酒泉。左相日興費萬錢。飲如長鯨吸百川。銜盃樂聖稱避賢。宗之蕭灑美少年。舉觴白眼望青天。皎如玉樹臨風前。蘇晉長齋繡佛前。醉中往往愛逃禪。李白一斗詩百篇。長安市上酒家眠。天子呼來不上船。自稱臣是酒中仙。張旭三杯草聖傳。脫帽露頂王公前。揮毫落紙如雲煙。焦遂五斗方卓然。高談雄辯驚四筵。

0144 今夕行

今夕何夕歲云徂。更長燭明不可孤。咸陽客舍一事無。相與博塞為歡娱。馮陵大叫呼五白。袒跣不肯成梟盧。英雄有時亦如此。邂逅豈即非良圖。君莫笑劉毅從來布衣願。家無儋石輸百萬。

0148 贈比部蕭郎中十兄

有美生人傑。由來積德門。漢朝丞相系。梁日帝王孫。蘊藉為郎久。魁梧秉哲尊。詞華傾後輩。風雅藹孤騫。宅相榮姻戚。兒童惠討論。見知真自幼。謀拙媿諸昆。漂蕩雲天闊。沈埋日月奔。致君時已晚。懷古意空存。中散山陽鍛。愚公野谷村。寧紆長者轍。歸老任乾坤。

";
?>