<?php
$詩文 = "蕭滌非主編《杜甫全集校注》

0003 望嶽

岱宗夫如何。齊魯青未了。造化鍾神秀。陰陽割昏曉。盪胸生曾雲。決眥入歸鳥。會當凌絶頂。一覽衆山小。

0008 登兗州城樓

東郡趨庭日。南樓縱目初。浮雲連海岱。平野入青徐。孤嶂秦碑在。荒城魯殿餘。從來多古意。臨眺獨躊躇。

0013 題張氏隱居二首

春山無伴獨相求。伐木丁丁山更幽。澗道餘寒歷冰雪。石門斜日到林邱。不貪夜識金銀氣。遠害朝看麋鹿遊。乘興杳然迷出處。對君疑是泛虚舟。
之子時相見。邀人晚興留。霽潭鱣發發。春草鹿呦呦。杜酒偏勞勸。張梨不外求。前村山路險。歸醉每無愁。

0022 劉九法曹鄭瑕丘石門宴集

秋水清無底。蕭然静客心。掾曹乘逸興。鞍馬到荒林。能吏逢聯璧。華筵直一金。晚來橫吹好。泓下亦龍吟。

0025 與任城許主簿遊南池

秋水通溝洫。城隅集小船。晚涼看洗馬。森木亂鳴蟬。菱熟經時雨。蒲荒八月天。晨朝降白露。遥憶舊青氈。

0027 對雨書懷走邀許主簿

東岳雲峯起。溶溶滿太虚。震雷翻幕鷰。驟雨落河魚。座對賢人酒。門聽長者車。相邀愧泥濘。騎馬到堦除。

0030 巳上人茅齋

巳公茅屋下。可以賦新詩。枕簟入林僻。茶瓜留客遲。江蓮摇白羽。天棘蔓青絲。空忝許詢輩。難酬支遁詞。

0034 房兵曹胡馬

胡馬大宛名。鋒稜瘦骨成。竹批雙耳峻。風入四蹄輕。所向無空闊。眞堪託死生。驍騰有如此。萬里可横行。

0038 畫鷹

素練風霜起。蒼鷹畫作殊。㩳身思狡兔。側目似愁胡。絛鏇光堪擿。軒楹勢可呼。何當擊凡鳥。毛血灑平蕪。

0042 遊龍門奉先寺

已從招提遊。更宿招提境。陰壑生虚籟。月林散清影。天闕象緯逼。雲臥衣裳冷。欲覺聞晨鍾。令人發深省。

0048 過宋員外之問舊莊

宋公舊池館。零落首陽阿。枉道祗從入。吟詩許更過。淹留問耆老。寂寞向山河。更識將軍樹。悲風日暮多。

0053 臨邑舍弟書至，苦雨，黄河泛溢，隄防之患，簿領所憂，因寄此詩，用寬其意

二儀積風雨。百谷漏波濤。聞道洪河坼。遥連滄海高。職司憂悄悄。郡國訴嗷嗷。舍弟卑棲邑。防川領簿曹。尺書前日至。版築不時操。難假黿鼉力。空瞻烏鵲毛。燕南吹畎畝。濟上没蓬蒿。螺蚌滿近郭。蛟螭乘九臯。徐關深水府。碣石小秋毫。白屋留孤樹。青天失萬艘。吾衰同泛梗。利涉想蟠桃。却倚天涯釣。猶能掣巨鼇。

0059 天寶初，南曹小司寇舅，於我太夫人堂下，壘土為山，一匱盈尺，以代彼朽木，承諸焚香瓷甌，甌甚安矣。旁植慈竹，蓋兹數峯，嶔岑嬋娟，宛有塵外數致。乃不知興之所至，而作是詩

一匱功盈尺。三峯意出羣。望中疑在野。幽處欲生雲。慈竹春陰覆。香爐曉勢分。惟南將獻壽。佳氣日氛氲。

0062 李監宅二首

尚覺王孫貴。豪家意頗濃。屏開金孔雀。褥隱繡芙蓉。且食雙魚美。誰看異味重。門闌多喜色。女壻近乘龍。
華館春風起。高城煙霧開。雜花分户映。嬌燕入簷廻。一見能傾座。虚懷只愛才。鹽官[《勘誤》改爲車]雖絆驥。名是漢庭來。

0068 夜宴左氏莊

風林纖月落。衣露淨琴張。暗水流花徑。春星帶草堂。檢書燒燭短。看劍引杯長。詩罷聞吳詠。扁舟意不忘。

0073 龍門

龍門橫野斷。驛樹出城來。氣色皇居近。金銀佛寺開。往還時屢改。川陸日悠哉。相閱征途上。生涯盡幾迴。

0076 贈李白

二年客東都。所歷厭機巧。野人對羶腥。蔬食常不飽。豈無青精飯。使我顔色好。苦乏大藥資。山林跡如掃。李侯金閨彦。脫身事幽討。亦有梁宋遊。方期拾瑶草。

0079 陪李北海宴歷下亭

東藩駐皂蓋。北渚淩青荷。海右此亭古。濟南名士多。雲山已發興。玉佩仍當謌。修竹不受暑。交流空湧波。蘊真愜所遇。落日將如何。貴賤俱物役。從公難重過。

0084 同李太守登歷下古城員外新亭

新亭結構罷。隱見清湖陰。跡藉臺觀舊。氣冥海岳深。圓荷想自昔。遺堞感至今。芳宴此時具。哀絲千古心。主稱壽尊客。筵秩宴北林。不阻蓬蓽興。得兼梁甫吟。

0092 暫如臨邑，至㟙山湖亭，奉懷李員外，率爾成興

野亭逼湖水。歇馬高林間。鼉吼風奔浪。魚跳日映山。暫遊阻詞伯。却望懷青關。靄靄生雲霧。唯應促駕還。

0095 與李十二白同尋范十隱居

李侯有佳句。往往似陰鏗。余亦東蒙客。憐君如弟兄。醉眠秋共被。携手日同行。更想幽期處。還尋北郭生。入門高興發。侍立小童清。落景聞寒杵。屯雲對古城。向來吟橘頌。誰欲討蓴羹。不願論簪笏。悠悠滄海情。

0099 贈李白

秋來相顧尚飄蓬。未就丹砂愧葛洪。痛飲狂歌空度日。飛揚跋扈為誰雄。

0103 冬日有懷李白

寂寞書齋裏。終朝獨爾思。更尋嘉樹傳。不忘角弓詩。裋褐風霜入。還丹日月遲。未因乘興去。空有鹿門期。

0107 春日憶李白

白也詩無敵。飄然思不羣。清新庾開府。俊逸鮑參軍。渭北春天樹。江東日暮雲。何時一樽酒。重與細論文。

0111 送孔巢父謝病歸遊江東兼呈李白

巢父掉頭不肯住。東將入海隨煙霧。詩卷長留天地間。釣竿欲拂珊瑚樹。深山大澤龍虵遠。春寒野陰風景暮。蓬萊織女廻雲車。指點虚無是征路。自是君身有仙骨。世人那得知其故。惜君只欲苦死留。富貴何如草頭露。蔡侯静者意有餘。清夜置酒臨前除。罷琴惆悵月照席。幾歲寄我空中書。南尋禹穴見李白。道甫問信今何如。

0120 鄭駙馬宅宴洞中

主家陰洞細煙霧。留客夏簟清琅玕。春酒盃濃琥珀薄。冰漿椀碧馬腦寒。悞疑茅堂過江麓。已入風磴霾雲端。自是秦樓壓鄭谷。時聞雜佩聲珊珊。

0126 贈特進汝陽王二十二韻

特進羣公表。天人夙德升。霜蹄千里駿。風翮九霄鵬。服禮求毫髮。惟忠忘寢興。聖情常有眷。朝退若無憑。仙醴來浮蟻。奇毛或賜鷹。清關塵不雜。中使日相乘。晚節嬉遊簡。平居孝義稱。自多親棣萼。誰敢問山陵。學業醇儒富。辭華哲匠能。筆飛鸞聳立。章罷鳳騫騰。精理通談笑。忘形向友朋。寸長堪繾綣。一諾豈驕矜。已忝歸曹植。何知對李膺。招要恩屢至。崇重力難勝。披霧初歡夕。高秋爽氣澄。樽罍臨極浦。鳧鴈宿張燈。花月窮遊宴。炎天避鬱蒸。硯寒金井水。簷動玉壺冰。瓢飲唯三逕。巖栖在百層。且持蠡測海。況挹酒如澠。鴻寶寧全祕。丹梯庶可凌。淮王門有客。終不媿孫登。

0136 飲中八仙歌

知章騎馬似乘船。眼花落井水底眠。汝陽三斗始朝天。道逢麴車口流涎。恨不移封向酒泉。左相日興費萬錢。飲如長鯨吸百川。銜盃樂聖稱避賢。宗之蕭灑美少年。舉觴白眼望青天。皎如玉樹臨風前。蘇晉長齋繡佛前。醉中往往愛逃禪。李白一斗詩百篇。長安市上酒家眠。天子呼來不上船。自稱臣是酒中仙。張旭三杯草聖傳。脫帽露頂王公前。揮毫落紙如雲煙。焦遂五斗方卓然。高談雄辯驚四筵。

0144 今夕行

今夕何夕歲云徂。更長燭明不可孤。咸陽客舍一事無。相與博塞為歡娱。馮陵大叫呼五白。袒跣不肯成梟盧。英雄有時亦如此。邂逅豈即非良圖。君莫笑劉毅從來布衣願。家無儋石輸百萬。

0148 贈比部蕭郎中十兄

有美生人傑。由來積德門。漢朝丞相系。梁日帝王孫。蘊藉為郎久。魁梧秉哲尊。詞華傾後輩。風雅藹孤騫。宅相榮姻戚。兒童惠討論。見知真自幼。謀拙媿諸昆。漂蕩雲天闊。沈埋日月奔。致君時已晚。懷古意空存。中散山陽鍛。愚公野谷村。寧紆長者轍。歸老任乾坤。

0152 故武衛將軍挽謌三首

嚴警當寒夜。前軍落大星。壯夫思敢決。哀詔惜精靈。王者今無戰。書生已勒銘。封侯意踈闊。編簡為誰青。
舞劍過人絶。鳴弓射獸能。銛鋒行愜順。猛噬失蹻騰。赤羽千夫膳。黄河十月冰。横行沙漠外。神速至今稱。
哀挽青門去。新阡絳水遥。路人紛雨泣。天意颯風飈。部曲精仍銳。匈奴氣不驕。無由覩雄略。大樹日蕭蕭。

0161 奉寄河南韋尹丈人

有客傳河尹。逢人問孔融。青囊仍隱逸。章甫尚西東。鼎食為門户。詞場繼國風。尊榮瞻地絶。踈放憶途窮。濁酒尋陶令。丹砂訪葛洪。江湖漂短褐。霜雪滿飛蓬。牢落乾坤大。周流道術空。謬慙知薊子。真怯笑揚雄。盤錯神明懼。謳謌德義豐。尸鄉餘土室。難說祝雞翁。

0167 高都護驄馬行

安西都護胡青驄。聲價歘然來向東。此馬臨陣久無敵。與人一心成大功。功成惠養隨所致。飄飄遠自流沙至。雄姿未受伏櫪恩。猛氣猶思戰場利。腕促蹄高如踣鐵。交河幾蹴曾冰裂。五花散作雲滿身。萬里方看汗流血。長安壯兒不敢騎。走過掣電傾城知。青絲絡頭為君老。何由却出横門道。

0173 冬日洛城北謁玄元皇帝廟

配極玄都閟。憑高禁禦長。守祧嚴具禮。掌節鎮非常。碧瓦初寒外。金莖一氣旁。山河扶繡户。日月近雕梁。仙李盤根大。猗蘭奕葉光。世家遺舊史。道德付今王。畫手看前輩。吳生遠擅場。森羅移地軸。妙絶動宮牆。五聖聯龍袞。千官列鴈行。冕旒俱秀發。旌旆盡飛揚。翠栢深留景。紅梨迥得霜。風箏吹玉柱。露井凍銀牀。身退卑周室。經傳拱漢皇。谷神如不死。養拙更何鄉。

0184 行次昭陵

舊俗疲庸主。群雄問獨夫。讖歸龍鳳質。威定虎狼都。天屬尊堯典。神功協禹謨。風雲隨絶足。日月繼高衢。文物多師古。朝廷半老儒。直詞寧戮辱。賢路不崎嶇。往者災猶降。蒼生喘未蘇。指麾安率土。盪滌撫洪鑪。壯士悲陵邑。幽人拜鼎湖。玉衣晨自舉。鐵馬汗常趨。松栢瞻虚殿。塵沙立暝途。寂寥開國日。流恨滿山隅。

0199 重經昭陵

草昧英雄起。謳謌歷數歸。風塵三尺劍。社稷一戎衣。翼亮貞文德。丕承戢武威。聖圖天廣大。宗祀日光輝。陵寢盤空曲。熊羆守翠微。再窺松栢路。還見五雲飛。

0204 贈翰林張四學士

翰林逼華蓋。鯨力破滄溟。天上張公子。宮中漢客星。賦詩拾翠殿。佐酒望雲亭。紫誥仍兼綰。黄麻似六經。内分金帶赤。恩與荔枝青。無復隨高鳳。空餘泣聚螢。此生任春草。垂老獨漂萍。儻憶山陽會。悲謌在一聽。

0209 贈韋左丞丈濟

左轄頻虚位。今年得舊儒。相門韋氏在。經術漢臣須。時議歸前烈。天倫恨莫俱。鴒原荒宿草。鳳沼接亨衢。有客雖安命。衰容豈壯夫。家人憂几杖。甲子混泥途。不謂矜餘力。還來謁大巫。歲寒仍顧遇。日暮且踟蹰。老驥思千里。飢鷹待一呼。君能微感激。亦足慰榛蕪。

0214 樂遊園歌

樂遊古園崒森爽。煙緜碧草萋萋長。公子華筵勢最高。秦川對酒平如掌。長生木瓢示眞率。更調鞍馬狂歡賞。青春波浪芙蓉園。白日雷霆夾城仗。閶闔晴開詄蕩蕩。曲江翠幕排銀牓。拂水低徊舞袖翻。緣雲清切歌聲上。却憶年年人醉時。只今未醉已先悲。數莖白髮那拋得。百罰深杯亦不辭。聖朝已知賤士醜。一物自荷皇天慈。此身飲罷無歸處。獨立蒼茫自詠詩。

0223 病後過王倚飲贈歌

麟角鳳觜世莫識。煎膠續弦奇自見。尚看王生抱此懷。在於甫也何由羨。且遇王生慰疇昔。素知賤子甘貧賤。酷見凍餒不足耻。多病沉年苦無健。王生怪我顏色惡。答云伏枕艱難徧。瘧癘三秋孰可忍。寒熱百日相交戰。頭白眼暗坐有胝。肉黃皮皺命如線。惟生哀我未平復。爲我力致美肴膳。遣人向市賒香粳。喚婦出房親自饌。長安冬葅酸且綠。金城土酥淨如練。兼求畜豪且割鮮。密沽斗酒諧終宴。故人情義晚誰似。令我手腳輕欲旋。老馬爲駒信不虛。當時得意況深眷。但使殘年飽喫飯。只願無事長相見。

0229 兵車行

車轔轔。馬蕭蕭。行人弓箭各在腰。耶娘妻子走相送。塵埃不見咸陽橋。牽衣頓足攔道哭。哭聲直上干雲霄。道傍過者問行人。行人但云點行頻。或從十五北防河。便至四十西營田。去時里正與裹頭。歸來頭白還戍邊。邊庭流血成海水。武皇開邊意未已。君不聞漢家山東二百州。千村萬落生荆杞。縱有健婦把鋤犂。禾生隴畝無東西。況復秦兵耐苦戰。被驅不異犬與雞。長者雖有問。役夫敢伸恨。且如今年冬。未休關西卒。縣官急索租。租稅從何出。信知生男惡。反是生女好。生女猶是嫁比鄰。生男埋没隨百草。君不見青海頭。古來白骨無人收。新鬼煩寃舊鬼哭。天陰雨濕聲啾啾。

0241 前出塞九首

戚戚去故里。悠悠赴交河。公家有程期。亡命嬰禍羅。君已富土境。開邊一何多。弃絶父母恩。吞聲行負戈。
出門日已遠。不受徒旅欺。骨肉恩豈斷。男兒死無時。走馬脫轡頭。手中挑青絲。捷下萬仞岡。俯身試搴旗。
磨刀嗚咽水。水赤刃傷手。欲輕腸斷聲。心緒亂已久。丈夫誓許國。憤惋復何有。功名圖騏驎。戰骨當速朽。
送徒既有長。遠戍亦有身。生死向前去。不勞吏怒嗔。路逢相識人。附書與六親。哀哉兩決絕。不復同苦辛。
迢迢萬餘里。領我赴三軍。軍中異苦樂。主將寧盡聞。隔河見胡騎。倐忽數百羣。我始為奴僕。幾時樹功勳。
挽弓當挽强。用箭當用長。射人先射馬。擒寇先擒王。殺人亦有限。列國自有疆。苟能制侵陵。豈在多殺傷。
驅馬天雨雪。軍行入高山。逕危抱寒石。指落曾冰間。已去漢月遠。何時築城還。浮雲暮南征。可望不可攀。
單于寇我壘。百里風塵昬。雄劍四五動。彼軍爲我奔。虜其名王歸。繫頸授轅門。潛身備行列。一勝何足論。
從軍十年餘。能無分寸功。衆人貴苟得。欲語羞雷同。中原有鬬爭。況在狄與戎。丈夫四方志。安可辭固窮。

0262 投簡咸華兩縣諸子

赤縣官曹擁材傑。軟裘快馬當冰雪。長安苦寒誰獨悲。杜陵野老骨欲折。南山豆苗早荒穢。青門瓜地新凍裂。鄉里兒童項領成。朝廷故舊禮數絶。自然棄擲與時異。況乃踈頑臨事拙。飢臥動即向一旬。弊衣何啻聯百結。君不見空牆日色晚。此老無聲淚垂血。

0266 杜位宅守歲

守歲阿戎家。椒盤已頌花。盍簪喧櫪馬。列炬散林鴉。四十明朝過。飛騰暮景斜。誰能更拘束。爛醉是生涯。

0271 玄都壇歌寄元逸人

故人昔隱東蒙峯。已佩含景蒼精龍。故人今居子午谷。獨在陰崖結茅屋。屋前太古玄都壇。青石漠漠常風寒。子規夜啼山竹裂。王母晝下雲旗翻。知君此計誠長往。芝草琅玕日應長。鐵鏁高垂不可攀。致身福地何蕭爽。

0276 奉贈韋左丞丈二十二韻

紈袴不餓死。儒冠多誤身。丈人試靜聽。賤子請具陳。甫昔少年日。早充觀國賓。讀書破萬卷。下筆如有神。賦料揚雄敵。詩看子建親。李邕求識面。王翰願卜鄰。自謂頗挺出。立登要路津。致君堯舜上。再使風俗淳。此意竟蕭條。行謌非隱淪。騎驢三十載。旅食京華春。朝扣富兒門。暮隨肥馬塵。殘盃與冷炙。到處潛悲辛。主上頃見徵。欻然欲求伸。青冥却垂翅。蹭蹬無縱鱗。甚媿丈人厚。甚知丈人真。每於百寮上。猥誦佳句新。竊効貢公喜。難甘原憲貧。焉能心怏怏。秖是走踆踆。今欲東入海。即將西去秦。尚憐終南山。廻首清渭濱。常擬報一飯。況懷辭大臣。白鷗没浩蕩。萬里誰能馴。

0288 奉留贈集賢院崔于二學士

昭代將垂白。途窮乃呌閽。氣衝星象表。詞感帝王尊。天老書題目。春官驗討論。倚風遺鶂路。隨水到龍門。竟與蛟螭雜。寧無鷰雀喧。青冥猶契闊。陵厲不飛飜。儒術誠難起。家聲庶已存。故山多藥物。勝㮣憶桃源。欲整還鄉斾。長懷禁掖垣。謬稱三賦在。難述二公恩。

0295 同諸公登慈恩寺塔

高標跨蒼穹。烈風無時休。自非曠士懷。登兹翻百憂。方知象教力。足可追冥搜。仰穿龍虵窟。始出枝撑幽。七星在北户。河漢聲西流。羲和鞭白日。少昊行清秋。秦山忽破碎。涇渭不可求。俯視但一氣。焉能辨皇州。廻首叫虞舜。蒼梧雲正愁。惜哉瑶池飲。日晏崑崙丘。黃鵠去不息。哀鳴何所投。君看隨陽雁。各有稻粱謀。

0305 曲江三章章五句

曲江蕭條秋氣高。菱荷枯折隨風濤。游子空嗟垂二毛。白石素沙亦相蕩。哀鴻獨叫求其曹。即事非今亦非古。
長歌激越梢林莽。比屋豪華固難數。吾人甘作心似灰。弟姪何傷淚如雨。自斷此生休問天。杜曲幸有桑麻田。
故將移住南山邊。短衣匹馬隨李廣。看射猛虎終殘年。

0311 敬贈鄭諫議十韻

諫官非不達。詩義早知名。破的由來事。先鋒孰敢爭。思飄雲物外。律中鬼神驚。毫髮無遺恨。波瀾獨老成。野人寧得所。天意薄浮生。多病休儒服。冥搜信客旌。築居仙縹緲。旅食歲崢嶸。使者求顔闔。諸公厭禰衡。將期一諾重。欻使寸心傾。君見途窮哭。宜憂阮步兵。

0317 貧交行

翻手作雲覆手雨。紛紛輕薄何須數。君不見管鮑貧時交。此道今人弃如土。

0319 白絲行

繰絲須長不須白。越羅蜀錦金粟尺。象床玉手亂殷紅。萬草千花動凝碧。已悲素質隨時染。裂下鳴機色相射。美人細意熨帖平。裁縫滅盡針線跡。春天衣著為君舞。蛺蝶飛來黄鸝語。落絮遊絲亦有情。隨風照日宜輕舉。香汗清塵污顔色。開新合故置何許。君不見才士汲引難。恐懼弃捐忍羈旅。

0326 送韋書記赴安西

夫子欻通貴。雲泥相望懸。白頭無籍在。朱紱有哀憐。書記赴三捷。公車留二年。欲浮江海去。此别意蒼然。

0328 奉贈鮮于京兆二十韻

王國稱多士。賢良復幾人。異才應閒出。爽氣必殊倫。始見張京兆。宜居漢近臣。驊騮開道路。鵰鶚離風塵。侯伯知何筭。文章實致身。奮飛超等級。容易失沉淪。脫略磻溪釣。操持郢匠斤。雲霄今已逼。台衮更誰親。鳳穴鶵皆好。龍門客又新。義聲紛感激。敗績自逡巡。途遠欲何向。天高難重陳。學詩猶孺子。鄉賦忝嘉賓。不得同晁錯。吁嗟後郄詵。計踈疑翰墨。時過憶松筠。獻納紆皇眷。中間謁紫宸。且隨諸彦集。方覬薄才伸。破膽遭前政。陰謀獨秉鈞。微生霑忌刻。萬事益酸辛。交合丹青地。恩傾雨露辰。有儒愁餓死。早晚報平津。

0338 石硯詩

平公今詩伯。秀發吾所羡。奉使三峽中。長嘯得石硯。巨璞禹鑿餘。異狀君獨見。其滑乃波濤。其光或雷電。聯坳各盡墨。多水遞隱見。揮灑容數人。十手可對面。比公頭上冠。正質未為賤。當公賦佳句。況得終清宴。公含起草姿。不遠明光殿。致于丹青地。知汝隨顧眄。

0342 麗人行

三月三日天氣新。長安水邊多麗人。態濃意遠淑且真。肌理細膩骨肉勻。繡羅衣裳照暮春。蹙金孔雀銀麒麟。頭上何所有。翠為㔩葉垂鬢脣。背後何所見。珠壓腰衱穩稱身。就中雲幕椒房親。賜名大國虢與秦。紫駞之峯出翠釜。水精之盤行素鱗。犀筯厭飫久未下。鸞刀縷切空紛綸。黃門飛鞚不動塵。御厨絡繹送八珍。簫鼓哀吟感鬼神。賓從雜遝實要津。後來鞍馬何逡巡。當軒下馬入錦茵。楊花雪落覆白蘋。青鳥飛去銜紅巾。炙手可熱勢絶倫。慎莫近前丞相嗔。

0353 虢國夫人

虢國夫人承主恩。平明騎馬入宫門。却嫌脂粉涴顔色。淡掃蛾眉朝至尊。

0356 陪鄭廣文遊何將軍山林十首

不識南塘路。今知第五橋。名園依緑水。野竹上青霄。谷口舊相得。濠梁同見招。平生為幽興。未惜馬蹄遥。
百頃風潭上。千章夏木清。卑枝低結子。接葉暗巢鸎。鮮鯽銀絲鱠。香芹碧澗羹。翻疑柂樓底。晚飯越中行。
萬里戎王子。何年别月支。異花開絶域。滋蔓匝清池。漢使徒空到。神農竟不知。露翻兼雨打。開拆漸離披。
旁舍連高竹。踈籬帶晚花。碾渦深没馬。藤蔓曲藏虵。詞賦工無益。山林跡未賒。盡拈書籍賣。來問爾東家。
剩水滄江破。殘山碣石開。綠垂風折笋。紅綻雨肥梅。銀甲彈箏用。金魚换酒來。興移無洒埽。隨意坐莓苔。
風磴吹陰雪。雲門吼瀑泉。酒醒思臥簟。衣冷得裝綿。野老來看客。河魚不取錢。秖疑淳朴處。自有一山川。
棘樹寒雲色。茵蔯春藕香。脆添生菜美。陰益食單涼。野鶴清晨出。山精白日藏。石林蟠水府。百里獨蒼蒼。
憶過楊柳渚。走馬定昆池。醉把青荷葉。狂遺白接䍦。刺船思郢客。解水乞吳兒。坐對秦山晚。江湖興頗隨。
床上書連屋。階前樹拂雲。將軍不好武。稚子總能文。醒酒微風入。聽詩靜夜分。絺衣挂蘿薜。涼月白紛紛。
幽意忽不愜。歸期無奈何。出門流水住。廻首白雲多。自笑燈前舞。誰憐醉後歌。秖應與朋好。風雨亦來過。

0388 送高三十五書記

崆峒小麥熟。且願休王師。請公問主將。焉用窮荒為。飢鷹未飽肉。側翅隨人飛。高生跨鞍馬。有似幽并兒。脫身簿尉中。始與捶楚辭。借問今何官。觸熱向武威。荅云一書記。所媿國士知。人實不易知。更須慎其儀。十年出幕府。自可持旌麾。此行既特達。足以慰所思。男兒功名遂。亦在老大時。常恨結驩淺。各在天一涯。又如參與商。慘慘中腸悲。驚風吹鴻鵠。不得相追隨。黃塵翳沙漠。念子何當歸。邊城有餘力。早寄從軍詩。

0396 九日曲江

綴席茱萸好。浮舟菡萏衰。百年秋已半。九日意兼悲。江水清源曲。荆門此路疑。晚來高興盡。摇蕩菊花期。

0400 贈陳二補闕

世儒多汩沒。夫子獨聲名。獻納開東觀。君王問長卿。皂鵰寒始急。天馬老能行。自到青冥裏。休看白髮生。

0403 送張二十參軍赴蜀州，因呈楊五侍御

好去張公子。通家别恨添。兩行秦樹直。萬點蜀山尖。御史新驄馬。參軍舊紫髯。皇華吾善處。於汝定無嫌。

0406 寄高三十五書記

歎惜高生老。新詩日又多。美名人不及。佳句法如何。主將收才子。崆峒足凱歌。聞君已朱紱。且得慰蹉𧿶。

0409 醉時歌

諸公衮衮登臺省。廣文先生官獨冷。甲第紛紛厭粱肉。廣文先生飯不足。先生有道出羲皇。先生有才過屈宋。德尊一代常坎軻。名垂萬古知何用。杜陵野客人更嗤。被褐短窄鬢如絲。日糴太倉五升米。時赴鄭老同襟期。得錢即相覔。沽酒不復疑。忘形到爾汝。痛飲真吾師。清夜沉沉動春酌。燈前細雨簷花落。但覺高歌有鬼神。焉知餓死填溝壑。相如逸才親滌器。子雲識字終投閣。先生早賦歸去來。石田茅屋荒蒼苔。儒術於我何有哉。孔丘盗跖俱塵埃。不須聞此意慘愴。生前相遇且銜盃。

0419 重過何氏五首

問訊東橋竹。將軍有報書。倒衣還命駕。高枕乃吾廬。花妥鸎捎蝶。溪喧獺趁魚。重來休沐地。眞作野人居。
山雨樽仍在。沙沉榻未移。犬迎曾宿客。鴉護落巢兒。雲薄翠微寺。天清皇子陂。向來幽興極。步屣過東籬。
落日平臺上。春風啜茗時。石欄斜點筆。桐葉坐題詩。翡翠鳴衣桁。蜻蜓立釣絲。自今幽興熟。來往亦無期。
頗怪朝參懶。應耽野趣長。雨拋金鎖甲。苔臥緑沈槍。手自移蒲柳。家纔足稻粱。看君用幽意。白日到羲皇。
到此應常宿。相留可判年。蹉跎暮容色。悵望好林泉。何日霑微禄。歸山買薄田。斯遊恐不遂。把酒意茫然。

0434 城西陂泛舟

青蛾皓齒在樓船。橫笛短簫悲遠天。春風自信牙檣動。遲日徐看錦纜牽。魚吹細浪摇歌扇。鷰蹴飛花落舞筵。不有小舟能盪槳。百壺那送酒如泉。

0438 陪諸貴公子丈八溝携妓納涼，晚際遇雨二首

落日放舡好。輕風生浪遲。竹深留客處。荷淨納涼時。公子調冰水。佳人雪藕絲。片雲頭上黑。應是雨催詩。
雨來霑席上。風急打舡頭。越女紅裙濕。燕姬翠黛愁。纜侵隄柳繫。幔卷浪花浮。歸路翻蕭颯。陂塘五月秋。

0443 渼陂行

岑參兄弟皆好奇。携我遠來游渼陂。天地黤慘忽異色。波濤萬頃堆瑠璃。瑠璃漫汗泛舟入。事殊興極憂思集。鼉作鯨吞不復知。惡風白浪何嗟及。主人錦帆相為開。舟子喜甚無氛埃。鳧鷖散亂棹謳發。絲管啁啾空翠來。沈竿續蔓深莫測。菱葉荷花靜如拭。宛在中流渤澥清。下歸無極終南黑。半陂已南純浸山。動影裊窕冲融閒。舩舷暝戞雲際寺。水面月出藍田關。此時驪龍亦吐珠。馮夷擊鼓羣龍趨。湘妃漢女出歌舞。金支翠旗光有無。咫尺但愁雷雨至。蒼茫不曉神靈意。少壯幾時奈老何。向來哀樂何其多。

0452 與鄠縣源大少府宴渼陂

應為西陂好。金錢罄一餐。飯抄雲子白。瓜嚼水精寒。無計廻舡下。空愁避酒難。主人情爛熳。持荅翠琅玕。

0456 渼陂西南臺

高臺面蒼陂。六月風日冷。蒹葭離披去。天水相與永。懷新目似擊。接要心已領。仿像識鮫人。空蒙辨魚艇。錯磨終南翠。顛倒白閣影。𡺚崒增光輝。乘陵惜俄頃。勞生愧嚴鄭。外物慕張邴。世復輕驊騮。吾甘雜鼃黽。知歸俗可忽。取適事莫竝。身退豈待官。老來苦便靜。況資菱芡足。庶結茅茨迥。從此具扁舟。彌年逐清景。

0462 夏日李公見訪

遠林暑氣薄。公子過我遊。貧居類村塢。僻近城南樓。傍舍頗淳朴。所須亦易求。隔屋喚西家。借問有酒不。墻頭過濁醪。展席俯長流。清風左右至。客意已驚秋。巢多衆鳥鬬。葉密鳴蟬稠。苦遭此物聒。孰謂吾廬幽。水花晚色靜。庶足充淹留。預恐罇中盡。更起為君謀。

0465 秋雨歎三首

雨中百草秋爛死。堦下決明顔色鮮。著葉滿枝翠羽蓋。開花無數黃金錢。涼風蕭蕭吹汝急。恐汝後時難獨立。堂上書生空白頭。臨風三嗅馨香泣。
闌風長雨秋紛紛。四海八荒同一雲。去馬來牛不復辯。濁涇清渭何當分。禾頭生耳黍穗黑。農夫田父無消息。城中斗米換衾裯。相許寧論兩相直。
長安布衣誰比數。反鏁衡門守環堵。老夫不出長蓬蒿。稚子無憂走風雨。雨聲颼颼催早寒。胡鴈翅濕高飛難。秋來未曾見白日。泥污后土何時乾。

0476 苦雨奉寄隴西公兼呈王徵士[隴西公，即漢中王瑀。徵士，琅邪王澈]

今秋乃淫雨。仲月來寒風。羣木水光下。萬家雲氣中。所思礙行潦。九里信不通。悄悄素滻[從水産聲，統一碼缺]路。迢迢天漢東。願騰六尺馬。背若孤征鴻。劃見公子面。超然懽笑同。奮飛既胡越。局促傷樊籠。一飯四五起。憑軒心力窮。嘉蔬沒溷濁。時菊碎榛叢。鷹隼亦屈猛。烏鳶何所蒙。式瞻北鄰居。取適南巷翁。挂席釣川漲。焉知清興終。

0481 送裴二虬作尉永嘉

孤嶼亭何處。天涯水氣中。故人官就此。絶境興誰同。隱吏逢梅福。遊山憶謝公。扁舟吾已具。把釣待秋風。

0484 九日寄岑參

出門復入門。雨脚但如舊。所向泥活活。思君令人瘦。沉吟坐西軒。飲食錯昬晝。寸步曲江頭。難為一相就。吁嗟乎蒼生。稼穡不可救。安得誅雲師。疇能補天漏。大明韜日月。曠野號禽獸。君子强逶迤。小人困馳驟。維南有崇山。恐與川浸溜。是節東籬菊。紛披為誰秀。岑生多新詩。性亦嗜醇酎。采采黃金花。何由滿衣袖。

0490 歎庭前甘菊花

簷前甘菊移時晚。青蘂重陽不堪摘。明日蕭條醉盡醒。殘花爛漫開何益。籬邊野外多衆芳。采擷細瑣升中堂。念茲空長大枝葉。結根失所埋風霜。

0494 承沈八丈東美除膳部員外，阻雨未遂馳賀，奉寄此詩

今日西京掾。多除南省郎[府掾四人，同日拜郎。]。通家惟沈氏。謁帝似馮唐。詩律羣公問。儒門舊史長。清秋便寓直。列宿頓輝光。未暇申宴慰。含情空激揚。司存何所比。膳部默悽傷[甫大父昔任此官。]。貧賤人事略。經過霖潦妨。禮同諸父長。恩豈布衣忘。天路牽騏驥。雲臺引棟梁。徒懷貢公喜。颯颯鬢毛蒼。

0499 崔駙馬山亭宴集

蕭史幽棲地。林間踏鳳毛。洑流何處入。亂石閉門高。客醉揮金椀。詩成得繡袍。清秋多宴會。終日困香醪。

0501 示從孫濟

平明跨驢出。未知適誰門。權門多噂𠴲。且復尋諸孫。諸孫貧無事。宅舍如荒村。堂前自生竹。堂後自生萱。萱草秋已死。竹枝霜不蕃。淘米少汲水。汲多井水渾。刈葵莫放手。放手傷葵根。阿翁懶惰久。覺兒行步奔。所來為宗族。亦不為盤飱。小人利口實。薄俗難可論。勿受外嫌猜。同姓古所敦。

0506 奉贈太常張卿垍二十韻

方丈三韓外。崑崙萬國西。建標天地闊。詣絶古今迷。氣得神仙迥。恩承雨露低。相門清議衆。儒術大名齊。軒冕羅天闕。琳琅識介珪。伶官詩必誦。夔樂典猶稽。健筆凌鸚鵡。銛鋒瑩鸊鵜。友于皆挺拔。公望各端倪。通籍踰青瑣。亨衢照紫泥。靈虬傳夕箭。歸馬散霜蹄。能事聞重譯。嘉謩及遠黎。弼諧方一展。班序更何躋。適越空顛躓。遊梁竟慘悽。謬知終畫虎。微分是䤈雞。萍泛無休日。桃陰想舊蹊。吹嘘人所羨。騰躍事仍暌。碧海真難涉。青雲不可梯。顧深慙鍛鍊。才小辱提携。檻束哀猿巧。枝驚夜鵲棲。幾時陪羽獵。應指釣璜溪。

0515 橋陵詩三十韻因呈縣內諸官

先帝昔晏駕。兹山朝百靈。崇岡擁象設。沃野開天庭。即事壯重險。論功超五丁。坡陁因厚地。却略羅峻屏。雲闕虛冉冉。風松肅泠泠。石門霜露白。玉殿莓苔青。宮女曉知曙。祠官朝見星。空梁簇畫戟。陰井敲銅瓶。中使日夜繼。惟王心不寧。豈徒䘏備享。尚謂求無形。孝理敦國政。神凝推道經。瑞芝産廟柱。好鳥鳴巖扃。高岳前嵂崒。洪河左瀅濴。金城蓄峻趾。沙菀交迴汀。永與奧區固。川原紛眇冥。居然赤縣立。臺榭爭岧亭。官屬果稱是。聲華真可聽。王劉美竹潤。裴李春蘭馨。鄭氏才振古。啖侯筆不停。遣詞必中律。利物常發硎。綺繡相展轉。琳琅愈青熒。側聞魯恭化。秉德崔瑗銘。太史候鳬影。王喬隨鶴翎。朝儀限霄漢。客思迴林坰。轗軻辭下杜。飄颻陵濁涇。諸生舊短褐。旅泛一浮萍。荒歲兒女瘦。暮途涕泗零。主人念老馬。廨署容秋螢。流寓理豈愜。窮愁醉未醒。何當擺俗累。浩蕩乘滄溟。

0527 奉先劉少府新畫山水障歌

堂上不合生楓樹。怪底江山起煙霧。聞君掃却赤縣圖。乘興遣畫滄洲趣。畫師亦無數。好手不可遇。對此融心神。知君重毫素。豈但祁岳與鄭虔。筆迹遠過楊契丹。得非玄圃裂。無乃瀟湘飜。悄然坐我天姥下。耳邊已似聞清猨。反思前夜風雨急。乃是蒲城鬼神入。元氣淋漓障猶濕。眞宰上訴天應泣。野亭春還雜花遠。漁翁暝踏孤舟立。滄浪水深青冥闊。欹岸側島秋毫末。不見湘妃鼓瑟時。至今班竹臨江活。劉侯天機精。愛畫入骨髓。自有兩兒郎。揮灑亦莫比。大兒聰明到。能添老樹巔崖裏。小兒心孔開。貌得山僧及童子。若耶溪。雲門寺。吾獨胡為在泥滓。青鞋布襪從此始。

0536 贈獻納使起居田舍人

獻納司存雨露邊。地分清切任才賢。舍人退食收封事。宫女開函近御筵。曉漏追趨青瑣闥。晴窻點檢白雲篇。揚雄更有河東賦。唯待吹嘘送上天。

0541 沙苑行

君不見左輔白沙如白水。繚以周牆百餘里。龍媒昔是渥洼生。汗血今稱獻於此。苑中騋牝三千匹。豐草青青寒不死。食之豪健西域無。每歲攻駒冠邊鄙。王有虎臣司苑門。入門天廐皆雲屯。驌驦一骨獨當御。春秋二時歸至尊。內外馬數將盈億。伏櫪在坰空大存。逸羣絶足信殊傑。倜儻權奇難具論。纍纍塠阜藏奔突。往往坡陀縱超越。角壯飜同麋鹿游。浮深簸蕩黿鼉窟。泉出巨魚長比人。丹砂作尾黃金鱗。豈知異物同精氣。雖未成龍亦有神。

0549 天育驃騎歌

吾聞天子之馬走千里。今之畫圖無乃是。是何意態雄且傑。駿尾蕭梢朔風起。毛為緑縹兩耳黃。眼有紫焰雙瞳方。矯矯龍性合變化。卓立天骨森開張。伊昔太僕張景順。監牧攻駒閱清峻。遂令大奴字天育。别養驥子憐神俊。當時四十萬匹馬。張公歎其材盡下。故獨寫真傳世人。見之座右久更新。年多物化空形影。嗚呼健步無由騁。如今豈無騕褭與驊騮。時無王良伯樂死即休。

0557 贈田九判官

崆峒使節上青霄。河隴降王𣢾聖朝。宛馬總肥春苜蓿。將軍只數漢嫖姚。陳留阮瑀誰爭長。京兆田郎早見招。麾下賴君才並入。獨能無意向漁樵。

0563 投贈哥舒開府翰二十韻

今代騏驎閣。何人第一功。君王自神武。駕馭必英雄。開府當朝傑。論兵邁古風。先鋒百勝在。略地兩隅空。青海無傳箭。天山早挂弓。廉頗仍走敵。魏絳已和戎。每惜河湟弃。新兼節制通。智謀垂睿想。出入冠諸公。日月低秦樹。乾坤繞漢宮。胡人愁逐北。宛馬又從東。受命邊沙遠。歸來御席同。軒墀曾寵鶴。畋獵舊非熊。茅土加名數。山河誓始終。策行遺戰伐。契合動昭融。勲業青冥上。交親氣槩中。未為珠履客。已見白頭翁。壯節初題柱。生涯獨轉蓬。幾年春草歇。今日暮途窮。軍事留孫楚。行閒識吕蒙。防身一長劍。將欲倚崆峒。

0576 戲簡鄭廣文虔兼呈蘇司業源明

廣文到官舍。繫馬堂堦下。醉則騎馬歸。頗遭官長罵。垂名四十年。坐客寒無氊。賴有蘇司業。時時與酒錢。

0581 上韋左相二十韻

鳳曆軒轅紀。龍飛四十春。八荒開壽域。一氣轉洪鈞。霖雨思賢佐。丹青憶老臣。應圖求駿馬。驚代得騏驎。沙汰江河濁。調和鼎鼐新。韋賢初相漢。范叔已歸秦。盛業今如此。傳經固絕倫。豫樟深出地。滄海闊無津。北斗司喉舌。東方領搢紳。持衡留藻鑒。聽履上星辰。獨步才超古。餘波德照鄰。聰明過管輅。尺牘倒陳遵。豈是池中物。由來席上珍。廟堂知至理。風俗盡還淳。才傑俱登用。愚蒙但隱淪。長卿多病久。子夏索居頻。廻首驅流俗。生涯似衆人。巫咸不可問。鄒魯莫容身。感激時將晚。蒼茫興有神。為公歌此曲。涕淚在衣巾。

0592 夜聽許十誦詩愛而有作

許生五臺賓。業白出石壁。余亦師粲可。身猶縳禪寂。何階子方便。謬引為匹敵。離索晚相逢。包蒙欣有擊。誦詩渾遊衍。四座皆辟易。應手看捶鈎。清心聽鳴鏑。精微穿溟涬。飛動摧霹靂。陶謝不枝梧。風騷共推激。紫鸞自超詣。翠駮誰剪剔。君意人莫知。人閒夜寥闃。

0598 醉歌行[别從姪勤落第歸]

陸機二十作文賦。汝更小年能綴文。總角草書又神速。世上兒子徒紛紛。驊騮作駒已汗血。鷙鳥舉翮連青雲。詞源倒流三峽水。筆陣獨掃千人軍。只今年纔十六七。射策君門期第一。舊穿楊葉真自知。暫蹶霜蹄未為失。偶然擢秀非難取。會是排風有毛質。汝身已見唾成珠。汝伯何由髮如漆。春光淡沲秦東亭。渚蒲牙白水荇青。風吹客衣日杲杲。樹攪離思花冥冥。酒盡沙頭雙玉瓶。衆賓皆醉我獨醒。乃知貧賤别更苦。吞聲躑躅涕淚零。

0605 陪李金吾花下飲

勝地初相引。徐行得自娛。見輕吹鳥毳。隨意數花鬚。細草稱偏坐。香醪懶再沽。醉歸應犯夜。可怕李金吾。

0608 驄馬行

鄧公馬癖人共知。初得花驄大宛種。夙昔傳聞思一見。牽來左右神皆竦。雄姿逸態何崷崪。顧影驕嘶自矜寵。隅目青熒夾鏡懸。肉𩦲碨礧連錢動。朝來久試華軒下。未覺千金滿高價。赤汗微生白雪毛。銀鞍却覆香羅帕。卿家舊賜公能取。天廐真龍此其亞。晝洗須騰涇渭深。朝趨可刷幽并夜。吾聞良驥老始成。此馬數年人更驚。豈有四蹄疾於鳥。不與八駿俱先鳴。時俗造次那得致。雲霧晦冥方降精。近聞下詔喧都邑。肯使騏驎地上行。

0615 魏將軍歌

將軍昔著從事衫。鐵馬馳突重兩銜。被堅執銳略西極。崑崙月窟東嶄巖。君門羽林萬猛士。惡若哮虎子所監。五年起家列霜戟。一日過海收風帆。平生流輩徒蠢蠢。長安少年氣欲盡。魏侯骨聳精爽緊。華嶽峯尖見秋隼。星纏寶鉸金盤陀。夜騎天駟超天河。攙搶熒惑不敢動。翠蕤雲旓相蕩摩。吾為子起歌都護。酒闌插劍肝膽露。鈎陳蒼蒼玄武暮。萬歲千秋奉明主。臨江節士安足數。

0622 送蔡希魯都尉還隴右因寄高三十五書記

蔡子勇成癖。彎弓西射胡。健兒寧鬬死。壯士耻為儒。官是先鋒得。材緣挑戰須。身輕一鳥過。槍急萬人呼。雲幕隨開府。春城赴上都。馬頭金匼帀。駝背錦糢糊。咫尺雪山路。歸飛青海隅。上公猶寵錫。突將且前驅。漢使黄河遠。涼州白麥枯。因君問消息。好在阮元瑜。

0627 九日楊奉先會白水崔明府

今日潘懷縣。同時陸浚儀。坐開桑落酒。來把菊花枝。天宇清霜淨。公堂宿霧披。晚酣留客舞。鳧舄共差池。

0631 白水明府舅宅喜雨

吾舅政如此。古人誰復過。碧山晴又濕。白水雨偏多。精禱既不昧。歡娱將謂何。湯年旱頗甚。今日醉絃歌。

0633 官定後戲贈[時免河西尉爲右衛率府兵曹]

不作河西尉。淒涼爲折腰。老夫怕趨走。率府且逍遙。耽酒須微禄。狂歌託聖朝。故山歸興盡。廻首向風飇。

0636 後出塞五首

男兒生世閒。及壯當封侯。戰伐有功業。焉能守舊丘。召募赴薊門。軍動不可留。千金買馬鞭。百金裝刀頭。閭里送我行。親戚擁道周。班白居上列。酒酣進庶羞。少年别有贈。含笑看吳鈎。
朝進東門營。暮上河陽橋。落日照大旗。馬鳴風蕭蕭。平沙列萬幕。部伍各見招。中天懸明月。令嚴夜寂寥。悲笳數聲動。壯士慘不驕。借問大將誰。恐是霍嫖姚。
古人重守邊。今人重高勳。豈知英雄主。出師亘長雲。六合已一家。四夷且孤軍。遂使貔虎士。奮身勇所聞。拔劍擊大荒。日收胡馬群。誓開玄冥北。持以奉吾君。
獻凱日繼踵。兩蕃靜無虞。漁陽豪俠地。擊鼓吹笙竽。雲帆轉遼海。粳稻來東吳。越羅與楚練。照耀輿臺軀。主將位益崇。氣驕凌上都。邊人不敢議。議者死路衢。
我本良家子。出師亦多門。將驕益愁思。身貴不足論。躍馬二十年。恐辜明主恩。坐見幽州騎。長驅河洛昬。中夜閒道歸。故里但空村。惡名倖脫免。窮老無兒孫。

0652 去矣行

君不見韝上鷹。一飽則飛掣。焉能作堂上鷰。銜泥附炎熱。野人曠蕩無靦顔。豈可久在王侯閒。未試囊中飡玉法。明朝且入藍田山。

0656 奉同郭給事湯東靈湫作

東山氣濛鴻。宮殿居上頭。君來必十月。樹羽臨九州。陰火煮玉泉。噴薄漲巖幽。有時浴赤日。光抱空中樓。閬風入轍跡。廣原延冥搜[原，崑崙東北脚名也]。沸天萬乘動。觀水百丈湫。幽靈斯可佳。王命官屬休。初聞龍用壯。擘石摧林丘。中夜窟宅改。移因風雨秋。倒懸瑶池影。屈注蒼江流。味如甘露漿。揮弄滑且柔。翠旗淡偃蹇。雲車紛少留。簫鼓盪四溟。異香泱莽浮。鮫人獻微綃。曾祝沉豪牛。百祥奔盛明。古先莫能儔。坡陁金蝦蟆。出見蓋有由。至尊顧之笑。王母不遣收。復歸虛無底。化作長黃虬。飄飄青璅郎。文采珊瑚鈎。浩歌渌水曲。清絶聽者愁。

0668 自京赴奉先縣詠懷五百字

杜陵有布衣。老大意轉拙。許身一何愚。竊比稷與契。居然成濩落。白首甘契闊。蓋棺事則已。此志常覬豁。窮年憂黎元。歎息腸内熱。取笑同學翁。浩謌彌激烈。非無江海志。瀟洒送日月。生逢堯舜君。不忍便永訣。當今廊廟具。構厦豈云缺。葵藿傾太陽。物性固莫奪。顧惟螻蟻輩。但自求其穴。胡爲慕大鯨。輒擬偃溟渤。以兹悟生理。獨耻事干謁。兀兀遂至今。忍爲塵埃没。終愧巢與由。未能易其節。沉飲聊自遣。放謌頗愁絶。歲暮百草零。疾風高岡裂。天衢隂崢嶸。客子中夜發。霜嚴衣帶斷。指直不得結。凌晨過驪山。御榻在嵽嵲。蚩尤塞寒空。蹴踏崖谷滑。瑶池氣鬰律。羽林相摩戞。君臣留懽娱。樂動殷膠葛。賜浴皆長纓。與宴非短褐。彤庭所分帛。本自寒女出。鞭撻其夫家。聚歛貢城闕。聖人筐篚恩。實欲邦國活。臣如忽至理。君豈棄此物。多士盈朝廷。仁者宜戰慄。况聞内金盤。盡在衛霍室。中堂舞神仙。煙霧蒙玉質。煖客貂鼠裘。悲管逐清瑟。勸客駝蹄羹。霜橙壓香橘。朱門酒肉臭。路有凍死骨。榮枯咫尺異。惆悵難再述。北轅就涇渭。官渡又改轍。羣冰從西下。極目高崪兀。疑是崆峒來。恐觸天柱折。河梁幸未拆。枝撑聲窸窣。行旅相攀援。川廣不可越。老妻既異縣。十口隔風雪。誰能久不顧。庶往共飢渴。入門聞號咷。幼子飢已卒。吾寧捨一哀。里巷亦嗚咽。所愧爲人父。無食致夭折。豈知秋禾登。貧窶有倉卒。生常免租税。名不隸征伐。撫迹猶酸辛。平人固騷屑。默思失業徒。因念遠戍卒。憂端齊終南。澒洞不可掇。

0695 蘇端薛復筵簡薛華醉歌

文章有神交有道。端復得之名譽早。愛客滿堂盡豪翰。開筵上日思芳草。安得健步移遠梅。亂插繁花向晴昊。千里猶殘舊冰雪。百壺且試開懷抱。垂老惡聞戰鼓悲。急觴爲緩憂心擣。少年努力縱談笑。看我形容已枯槁。坐中薛華善醉歌。歌詞自作風格老。近來海内爲長句。汝與山東李白好。何劉沈謝力未工。才兼鮑昭愁絶倒。諸生頗盡新知樂。萬事終傷不自保。氣酣日落西風來。願吹野水添金杯。如澠之酒常快意。亦知窮愁安在哉。忽憶雨時秋井塌。古人白骨生青苔。如何不飲令心哀。

0703 晦日尋崔戢李封

朝光入甕牖。尸寢驚弊裘。起行視天宇。春氣漸和柔。興來不暇懶。今晨梳我頭。出門無所待。徒步覺自由。杖藜復恣意。免値公與侯。晚定崔李交。會心真罕儔。每過得酒傾。二宅可淹留。喜結仁里懽。況因令節求。李生園欲荒。舊竹頗修修。引客看掃除。隨時成獻酬。崔侯初筵色。已畏空樽愁。未知天下士。至性有此不。草牙既青出。蜂聲亦暖遊。思見農器陳。何當甲兵休。上古葛天氏。不貽黃屋憂。至今阮籍等。熟醉爲身謀。威鳳高其翔。長鯨吞九州。地軸爲之翻。百川皆亂流。當歌欲一放。淚下恐莫收。濁醪有妙理。庶用慰沉浮。

0710 送率府程録事還鄉[程携酒饌相就取别]

鄙夫行衰謝。抱病妄集。常時往還人。記一不識十。程侯晚相遇。與語才傑立。薰然耳目開。頗覺聰明入。千載得鮑叔。末契有所及。意鍾老栢青。義動修蛇蟄。若人可數見。慰我垂白泣。告别無淹晷。百憂復相襲。內愧突不黔。庶羞以賙給。素絲挈長魚。碧酒隨玉粒。途窮見交態。世梗悲路澁。東風吹春冰。泱莽后土濕。念君惜羽翮。既飽更思戢。莫作翻雲鶻。聞呼向禽急。

0715 白水縣崔少府十九翁高齋三十韻

客從南縣來。浩蕩無與適。旅食白日長。況當朱炎赫。高齋坐林杪。信宿遊衍闃。清晨陪躋攀。傲睨俯峭壁。崇岡相枕帶。曠野懷咫尺。始知賢主人。贈此遣愁寂。危堦根青冥。曾冰生淅瀝。上有無心雲。下有欲落石。泉聲聞復息。動靜隨所擊。鳥呼藏其身。有似懼彈射。吏隱道情性。兹焉其窟宅。白水見舅氏。諸公乃仙伯。杖藜長松隂。作尉窮谷僻。爲我炊彫胡。逍遥展良覿。坐久風頗愁。晚來山更碧。相對十丈蛟。欻翻盤渦拆。何得空裏雷。殷殷尋地脉。煙氛藹𡺚崒。魍魎森慘戚。崑崙崆峒顛。廻首如不隔。前軒頹反照。巉絶華岳赤。兵氣漲林巒。川光雜鋒鏑。知是相公軍。鐵馬雲霧積。玉觴淡無味。胡羯豈強敵。長謌激屋梁。淚下流衽席。人生半哀樂。天地有順逆。慨彼萬國夫。休明備征狄。猛將紛填委。廟謀蓄長策。東郊何時開。帶甲且未釋。欲告清宴罷。難拒幽明迫。三歎酒食傍。何由似平昔。

0725 三川觀水漲二十韻

我經華原來。不復見平陸。北上唯土山。連天走窮谷。火雲無時出。飛電常在目。自多窮岫雨。行潦相豗蹙。蓊匌川氣黃。羣流會空曲。清晨望高浪。忽謂隂崖踣。恐泥竄蛟龍。登危聚麋鹿。枯查卷拔樹。礧磈共充塞。聲吹鬼神下。勢閱人代速。不有萬穴歸。何以尊四瀆。及觀泉源漲。反懼江海覆。漂沙圻岸去。漱壑松柏禿。乘陵破山門。廻斡裂地軸。交洛赴洪河。及關豈信宿。應沈數州沒。如聽萬室哭。穢濁殊未清。風濤怒猶蓄。何時通舟車。隂氣不黲黷。浮生有蕩汩。吾道正羈束。人寰難容身。石壁滑側足。雲雷屯不已。艱險路更跼。普天無川梁。欲濟願水縮。因悲中林士。未脫衆魚腹。舉頭向蒼天。安得騎鴻鵠。

0733 月夜

今夜鄜州月。閨中只獨看。遥憐小兒女。未解憶長安。香霧雲鬟濕。清輝玉臂寒。何時倚虛幌。雙照淚痕乾。

0737 悲陳陶

孟冬十郡良家子。血作陳陶澤中水。野曠天清無戰聲。四萬義軍同日死。群胡歸來血洗箭。仍唱胡歌飲都市。都人迴面向北啼。日夜更望官軍至。

0742 悲青坂

我軍青坂在東門。天寒飲馬太白窟。黃頭奚兒日向西。數騎彎弓敢馳突。山雪河氷野蕭飋。青是烽煙白人骨。焉得附書與我軍。忍待明年莫倉卒。

0745 避地

避地歲時晚。竄身筋骨勞。詩書遂牆壁。奴僕且旌旄。行在僅聞信。此生隨所遭。神堯舊天下。會見出腥臊。

0748 對雪

戰哭多新鬼。愁吟獨老翁。亂雲低薄暮。急雪舞廻風。瓢弃樽無緑。爐存火似紅。數州消息斷。愁坐正書空。

0752 元日

近聞韋氏妹。迎在漢鍾離。郎伯殊方鎮。京華舊國移。春城廻北斗。郢樹發南枝。不見朝正使。啼痕滿面垂。

0755 塞蘆子

五城何迢迢。迢迢隔河水。邊兵盡東征。城南空荆杞。思明割懷衛。秀巖西未已。廻略大荒來。崤函蓋虚爾。延州秦北户。關防猶可倚。焉得一萬人。疾驅塞蘆子。岐有薛大夫。旁制山賊起。近聞昆戎徒。爲退三百里。蘆關扼兩寇。深意實在此。誰能叫帝𨵽。胡行速如鬼。

0760 哀江頭

少陵野老吞聲哭。春日潛行曲江曲。江頭宮殿鏁千門。細柳新蒲爲誰緑。憶昔霓旌下南苑。苑中萬物生顔色。昭陽殿裏第一人。同輦隨君侍君側。輦前才人帶弓箭。白馬嚼齧黃金勒。翻身向天仰射雲。一笑正墜雙飛翼。明眸皓齒今何在。血污遊魂歸不得。清渭東流劍閣深。去住彼此無消息。人生有情淚沾臆。江水江花豈終極。黃昬胡騎塵滿城。欲往城南忘南北。

0771 哀王孫

長安城頭頭白烏。夜飛延秋門上呼。又向人家啄大屋。屋底達官走避胡。金鞭斷折九馬死。骨肉不待同馳驅。腰下寶玦青珊瑚。可憐王孫泣路隅。問之不肯道姓名。但道困苦乞爲奴。已經百日竄荊棘。身上無有完肌膚。高帝子孫盡高準。龍種自與常人殊。豺狼在邑龍在野。王孫善保千金軀。不敢長語臨交衢。且爲王孫立斯須。昨夜東風吹血腥。東來橐駝滿舊都。朔方健兒好身手。昔何勇銳今何愚。竊聞天子已傳位。聖德北服南單于。花門剺面請雪耻。慎勿出口他人狙。哀哉王孫慎勿踈。五陵佳氣無時無。

0779 春望

國破山河在。城春草木深。感時花濺淚。恨别鳥驚心。烽火連三月。家書抵萬金。白頭搔更短。渾欲不勝簪。

0783 得舍弟消息二首

近有平隂信。遥憐舍弟存。側身千里道。寄食一家村。烽舉新酣戰。啼垂舊血痕。不知臨老日。招得幾人魂。
汝懦歸無計。吾衰往未期。浪傳烏鵲喜。深負鶺鴒詩。生理何顔面。憂端且歲時。兩京三十口。雖在命如絲。

0786 憶幼子[字驥子，時隔絶在鄜州]

驥子春猶隔。鶯歌暖正繁。别離驚節换。聦慧與誰論。澗水空山道。柴門老樹村。憶渠愁只睡。炙背俯晴軒。

0789 一百五日夜對月

無家對寒食。有淚如金波。斫却月中桂。清光應更多。仳離放紅蘂。想像嚬青蛾。牛女漫愁思。秋期猶渡河。

0794 遣興

驥子好男兒。前年學語時。問知人客姓。誦得老夫詩。世亂憐渠小。家貧仰母慈。鹿門携不遂。鴈足繫難期。天地軍麾滿。山河戰角悲。儻歸免相失。見日敢辭遲。

0797 大雲寺贊公房四首

心在水精域。衣霑春雨時。洞門盡徐步。深院果幽期。到扉開復閉。撞鐘齋及兹。醍醐長發性。飲食過扶衰。把臂有多日。開懷無媿詞。黃鸎度結構。紫鴿下罘罳。愚意會所適。花邊行自遲。湯休起我病。微笑索題詩。
細軟青絲履。光明白㲲巾。深藏供老宿。取用及吾身。自顧轉無趣。交情何尚新。道林才不世。惠遠德過人。雨瀉暮簷竹。風吹春井芹。天隂對圖畫。最覺潤龍鱗。
燈影照無睡。心清聞妙香。夜深殿突兀。風動金琅璫。天黑閉春院。地清棲暗芳。玉繩廻斷絕。鐵鳳森翱翔。梵放時出寺。鐘殘仍殷牀。明朝在沃野。苦見塵沙黃。
童兒汲井華。慣捷瓶上手。霑灑不濡地。掃除似無箒。明霞爛複閣。霽霧搴高牖。側塞被徑花。飄颻委墀柳。艱難世事迫。隱遁佳期後。晤語契深心。那能揔鉗口。奉辭還杖策。蹔别終回首。泱泱泥污人。㹞㹞國多狗。既未免羈絆。時來憩奔走。近公如白雪。執熱煩何有。

0809 雨過蘇端

鷄鳴風雨交。久旱雨亦好。杖藜入春泥。無食起我早。諸家憶所歷。一飯跡便掃。蘇侯得數過。懽喜每傾倒。也復可憐人。呼兒具梨棗。濁醪必在眼。盡醉據懷抱。紅稠屋角花。碧委墻隅草。親賓縱談謔。喧鬧慰衰老。況蒙霈澤垂。粮粒或自保。妻孥隔軍壘。撥弃不擬道。

0813 喜晴

皇天久不雨。既雨晴亦佳。出郭眺四郊。肅肅春增華。青熒陵陂麥。窈窕桃李花。春夏各有實。我飢豈無涯。干戈雖橫放。慘澹鬬龍虵。甘澤不猶愈。且耕今未賒。丈夫則帶甲。婦女終在家。力難及黍稷。得種菜與麻。千載商山芝。往者東門瓜。其人骨已朽。此道誰疵瑕。英賢遇轗軻。遠引蟠泥沙。顧慙昧所適。廻首白日斜。漢隂有鹿門。滄海有靈查。焉能學衆口。咄咄空咨嗟。

0819 鄭駙馬池臺喜遇鄭廣文同飲

不謂生戎馬。何知共酒盃。燃臍郿塢敗。握節漢臣迴。白髮千莖雪。丹心一寸灰。别離經死地。披寫忽登臺。重對秦簫發。俱過阮宅來。留連春夜舞。淚落強徘徊。

0824 喜達行在所三首

西憶岐陽信。無人遂却回。眼穿當落日。心死著寒灰。霧樹行相引。連山望忽開。所親驚老瘦。辛苦賊中來。
愁思胡笳夕。淒涼漢苑春。生還今日事。閒道暫時人。司隸章初覩。南陽氣已新。喜心翻倒極。嗚咽淚沾巾。
死去憑誰報。歸來始自憐。猶瞻太白雪。喜遇武功天。影靜千官裏。心蘇七校前。今朝漢社稷。新數中興年。

0833 送樊二十三侍御赴漢中判官

威弧不能弦。自爾無寧歲。川谷血横流。豺狼沸相噬。天子從北來。長驅振凋敝。頓兵岐梁下。却跨沙漠裔。二京陷未收。四極我得制。蕭索漢水清。緬通淮湖稅。使者紛星散。王綱尚旒綴。南伯從事賢。君行立談際。坐知七曜曆。手畫三軍勢。冰雪淨聰明。雷霆走精銳。幕府輟諫官。朝廷無此例。至尊方旰食。仗爾布嘉惠。補闕暮徵入。柱史晨征憇。正當艱難時。實藉長久計。廻風吹獨樹。白日照執袂。慟哭蒼煙根。山門萬重閉。居人莽牢落。遊子方迢遰。徘徊悲生離。局促老一世。陶唐歌遺民。後漢更列帝。我無匡復姿。聊欲從此逝。

0841 述懷一首

去年潼關破。妻子隔絶久。今夏草木長。脫身得西走。麻鞋見天子。衣袖露兩肘。朝廷慜生還。親故傷老醜。涕淚受拾遺。流離主恩厚。柴門雖得去。未忍即開口。寄書問三川。不知家在否。比聞同罹禍。殺戮到雞狗。山中漏茅屋。誰復依户牖。摧頹蒼松根。地冷骨未朽。幾人全性命。盡室豈相偶。嶔岑猛虎場。鬱結廻我首。自寄一封書。今已十月後。反畏消息來。寸心亦何有。漢運初中興。平生老耽酒。沈思歡會處。恐作窮獨叟。

0848 送長孫九侍御赴武威判官

驄馬新鑿蹄。銀鞍被來好。繡衣黄白郎。騎向交河道。問君適萬里。取别何草草。天子憂涼州。嚴程到須早。去秋群胡反。不得無電掃。此行牧遺甿。風俗方再造。族父領元戎。名聲國中老。奪我同官良。飄颻按城堡。使我不能飱。令我惡懷抱。若人才思闊。溟漲浸絶島。罇前失詩流。塞上得國寶。皇天悲送遠。雲雨白浩浩。東郊尚烽火。朝野色枯槁。西極柱亦傾。如何正穹昊。

0853 送從弟亞赴河西判官

南風作秋聲。殺氣薄炎熾。盛夏鷹隼擊。時危異人至。令弟草中來。蒼然請論事。詔書引上殿。奮舌動天意。兵法五十家。爾腹爲篋笥。應對如轉丸。踈通略文字。經綸皆新語。足以正神器。宗廟尚爲灰。君臣俱下淚。崆峒地無軸。青海天軒輊。西極最瘡痍。連山暗烽燧。帝曰大布衣。藉卿佐元帥。坐看清流沙。所以子奉使。歸當再前席。適遠作歷試。須存武威郡。爲畫長久利。孤峯石戴驛。快馬金纏轡。黃羊飫不羶。蘆酒多還醉。踴躍常人情。慘澹苦士志。安邊敵何有。反正計始遂。吾聞駕鼓車。不合用騏驥。龍吟廻其頭。夾輔待所致。

0861 送韋十六評事充同谷郡防禦判官

昔没賊中時。潛與子同遊。今歸行在所。王事有去留。偪側兵馬閒。主憂急良籌。子雖軀幹小。老氣橫九州。挺身艱難際。張目視寇讎。朝廷壯其節。奉詔令參謀。鑾輿駐鳳翔。同谷爲咽喉。西扼弱水道。南鎮枹罕陬。此邦承平日。剽劫吏所羞。況乃胡未滅。控帶莽悠悠。府中韋使君。道足示懷柔。令姪才俊茂。二美又何求。受詞太白脚。走馬仇池頭。古邑沙土裂。積隂雪雲稠。羌父豪猪靴。羌兒青兕裘。吹角向月窟。蒼山旌斾愁。鳥驚出死樹。龍怒拔老湫。古來無人境。今代橫戈矛。傷哉文儒士。憤激馳林丘。中原正格鬬。後會何緣由。百年賦命定。豈料沉與浮。且復戀良友。握手步道周。論兵還壑淨。亦可縱冥搜。題詩得秀句。札翰時相投。

0868 得家書

去憑遊客寄。來爲附家書。今日知消息。他鄉且舊居。熊兒幸無恙。驥子最憐渠。臨老羈孤極。傷時會合踈。二毛趨帳殿。一命侍鸞輿。北闕妖氛滿。西郊白露初。涼風新過鴈。秋雨欲生魚。農事空山裏。眷言終荷鋤。

0871 月

天上秋期近。人閒月影清。入河蟾不没。擣藥兔長生。只益丹心苦。能添白髮明。干戈知滿地。休照國西營。

0875 奉送郭中丞兼太僕卿充隴右節度使三十韻

詔發西山將。秋屯隴右兵。淒涼餘部曲。燀赫舊家聲。雕鶚乘時去。驊騮顧主鳴。艱難須上策。容易即前程。斜日當軒蓋。高風卷斾旌。松悲天水冷。沙亂雪山清。和虜猶懷惠。防邊不敢驚。古來於異域。鎮静示專征。燕薊奔封豕。周秦觸駭鯨。中原何慘黷。餘孽尚縱橫。箭入昭陽殿。笳吟細柳營。内人紅袖泣。王子白衣行。宸極祅星動。園陵殺氣平。空餘金椀出。無復繐帷輕。毀廟天飛雨。焚宮火徹明。罘罳朝共落。棆桷夜同傾。三月師逾整。群胡勢就烹。瘡痍親接戰。勇决冠垂成。妙譽期元宰。殊恩且列卿。幾時迴節鉞。勠力掃攙搶。圭竇三千士。雲梯七十城。恥非齊說客。秪似魯諸生。通籍微班忝。周行獨座榮。隨肩趨漏刻。短髮愧簪纓。徑欲依劉表。還疑猒禰衡。漸衰那此别。忍淚獨含情。廢邑狐狸語。空村虎豹爭。人頻墜塗炭。公豈忘精誠。元帥調新律。前軍壓舊京。安邊仍扈從。莫作後功名。

0890 送楊六判官使西蕃

送遠秋風落。西征海氣寒。帝京氛祲滿。人世别離難。絶域遥懷怒。和親願結歡。勅書憐贊普。兵甲望長安。宣命前程急。惟良待士寬。子雲清自守。今日起爲官。垂淚方投筆。傷時即據鞍。儒衣山鳥怪。漢節野童看。邊酒排金盞。夷歌捧玉盤。草輕蕃馬健。雪重拂廬乾。慎爾參籌畫。從兹正羽翰。歸來權可取。九萬一朝摶。

0896 送靈州李判官

羯胡腥四海。回首一茫茫。血戰乾坤赤。氛迷日月黄。將軍專策略。幕府盛才良。近賀中興主。神兵動朔方。

0899 奉贈嚴八閣老

扈聖登黃閣。明公獨妙年。蛟龍得雲雨。鵰鶚在秋天。客禮容踈放。官曹可接聯。新詩句句好。應任老夫傳。

0902 留别賈嚴二閣老兩院補闕[得雲字]

田園須蹔往。戎馬惜離群。去遠留詩别。愁多任酒醺。一秋常苦雨。今日始無雲。山路時吹角。那堪處處聞。

0904 九成宮

蒼山入百里。崖斷如杵臼。曾宫憑風廻。岌嶪土囊口。立神扶棟梁。鑿翠開户牖。其陽産靈芝。其陰宿牛斗。紛披長松倒。揭𡿗怪石走。哀猿啼一聲。客淚迸林藪。荒哉隋家帝。製此今頹朽。向使國不亡。焉爲巨唐有。雖無新增修。尚置官居守。巡非瑶水遠。跡是雕牆後。我行屬時危。仰望嗟嘆久。天王守太白。駐馬更搔首。

0909 徒步歸行

明公壯年値時危。經濟實籍英雄姿。國之社稷今若是。武定禍亂非公誰。鳳翔千官且飽飯。衣馬不復能輕肥。青袍朝士最困者。白頭拾遺徒步歸。人生交契無老少。論交何必先同調。妻子山中哭向天。須公櫪上追風驃。

0912 玉華宮

溪廻松風長。蒼鼠竄古瓦。不知何王殿。遺構絶壁下。陰房鬼火青。壞道哀湍瀉。萬籟真笙竽。秋色正蕭洒。美人爲黃土。況乃粉黛假。當時侍金輿。故物獨石馬。憂來藉草坐。浩歌淚盈把。冉冉征途間。誰是長年者。

0917 晚行口號

三川不可到。歸路晚山稠。落鴈浮寒水。飢烏集戍樓。市朝今日異。喪亂幾時休。遠媿梁江緫。還家尚黑頭。

0922 獨酌成詩

燈花何太喜。酒緑正相親。醉裏從爲客。詩成覺有神。兵戈猶在眼。儒術豈謀身。苦被微官縛。低頭媿野人。

0925 彭衙行

憶昔避賊初。北走經險艱。夜深彭衙道。月照白水山。盡室久徒步。逢人多厚顔。參差谷鳥吟。不見遊子還。癡女飢咬我。啼畏虎狼聞。懷中掩其口。反側聲愈嗔。小兒強解事。故索苦李餐。一旬半雷雨。泥濘相牽攀。既無禦雨備。徑滑衣又寒。有時經契闊。竟日數里閒。野果充糇糧。卑枝成屋椽。早行石上水。暮宿天邊煙。少留同家窪。欲出蘆子關。故人有孫宰。高義薄曾雲。延客已曛黑。張燈啓重門。煖湯濯我足。剪紙招我魂。從此出妻孥。相視涕闌干。衆鶵爛漫睡。喚起霑盤餐。誓將與夫子。永結爲弟昆。遂空所坐堂。安居奉我歡。誰肯艱難際。豁達露心肝。别來歲月周。胡羯仍構患。何當有翅翎。飛去墮爾前。

0934 羌村三首

崢嶸赤雲西。日脚下平地。柴門鳥雀噪。歸客千里至。妻孥怪我在。驚定還拭淚。世亂遭飄蕩。生還偶然遂。鄰人滿牆頭。感歎亦歔欷。夜闌更秉燭。相對如夢寐。
晚歲迫偷生。還家少歡趣。嬌兒不離膝。畏我復却去。憶昔好追涼。故繞池邊樹。蕭蕭北風勁。撫事煎百慮。賴知禾黍收。已覺糟牀注。如今足斟酌。且用慰遲暮。
群雞正亂叫。客至雞鬬爭。驅雞上樹木。始聞叩柴荊。父老四五人。問我久遠行。手中各有携。傾榼濁復清。苦辭酒味薄。黍地無人耕。兵革既未息。兒童盡東征。請爲父老歌。艱難媿深情。歌罷仰天歎。四座淚縱橫。

0943 北征

皇帝二載秋。閏八月初吉。杜子將北征。蒼茫問家室。維時遭艱虞。朝野少暇日。顧慙恩私被。詔許歸蓬蓽。拜辭詣闕下。怵惕久未出。雖乏諫諍姿。恐君有遺失。君誠中興主。經緯固密勿。東胡反未已。臣甫憤所切。揮涕戀行在。道途猶恍忽。乾坤含瘡痍。憂虞何時畢。靡靡踰阡陌。人煙眇蕭瑟。所遇多被傷。呻吟更流血。廻首鳳翔縣。旌旗晚明滅。前登寒山重。屢得飲馬窟。邠郊入地底。涇水中蕩潏。猛虎立我前。蒼崖吼時裂。菊垂今秋花。石戴古車轍。青雲動高興。幽事亦可悦。山果多瑣細。羅生雜橡栗。或紅如丹砂。或黑如點漆。雨露之所濡。甘苦齊結實。緬思桃源内。益歎身世拙。坡陀望鄜畤。巖谷互出没。我行已水濱。我僕猶木末。鴟鳥鳴黃桑。野鼠拱亂穴。夜深經戰場。寒月照白骨。潼關百萬師。往者散何卒。遂令半秦民。殘害爲異物。況我墮胡塵。及歸盡華髮。經年至茆屋。妻子衣百結。慟哭松聲廻。悲泉共幽咽。平生所嬌兒。顔色白勝雪。見耶背面啼。垢膩脚不襪。牀前兩小女。補綻纔過膝。海圖拆波濤。舊繡移曲折。天吳及紫鳳。顛倒在裋褐。老夫情懷惡。嘔泄臥數日。那無囊中帛。救汝寒凜慄。粉黛亦解苞。衾裯稍羅列。瘦妻面復光。癡女頭自櫛。學母無不爲。曉糚隨手抹。移時施朱鉛。狼籍畫眉闊。生還對童稚。似欲忘飢渴。問事競挽鬚。誰能即嗔喝。翻思在賊愁。甘受雜亂聒。新歸且慰意。生理焉得説。至尊尚蒙塵。幾日休練卒。仰看天色改。旁覺祅氣豁。陰風西北來。慘澹隨回紇。其王願助順。其俗善馳突。送兵五千人。驅馬一萬匹。此輩少爲貴。四方服勇決。所用皆鷹騰。破敵過箭疾。聖心頗虛佇。時議氣欲奪。伊洛指掌收。西京不足拔。官軍請深入。蓄鋭何俱發。此舉開青徐。旋瞻略恒碣。昊天積霜露。正氣有肅殺。禍轉亡胡歲。勢成擒胡月。胡命其能久。皇綱未宜絶。憶昨狼狽初。事與古先别。姦臣竟葅醢。同惡隨蕩析。不聞夏殷衰。中自誅襃妲。周漢獲再興。宣光果明哲。桓桓陳將軍。仗鉞奮忠烈。微爾人盡非。于今國猶活。淒涼大同殿。寂寞白獸闥。都人望翠華。佳氣向金闕。園陵固有神。埽灑數不缺。煌煌太宗業。樹立甚宏達。

0972 喜聞官軍已臨賊寇二十韻

胡虜潛京縣。官軍擁賊壕。鼎魚猶假息。穴蟻欲何逃。帳殿羅玄冕。轅門照白袍。秦山當警蹕。漢苑入旌旄。路失羊腸險。雲橫雉尾高。五原空壁壘。八水散風濤。今日看天意。遊魂貸爾曹。乞降那更得。尚詐莫徒勞。元帥歸龍種。司空握豹韜。前軍蘇武節。左將呂虔刀。兵氣回飛鳥。威聲没巨鰲。戈鋋開雪色。弓矢向秋毫。天步艱方盡。時和運更遭。誰云遺毒螫。已是沃腥臊。睿想丹墀近。神行羽衛牢。花門騰絶漠。拓羯渡臨洮。此輩感恩至。羸俘何足操。鋒先衣染血。騎突劔吹毛。喜覺都城動。悲連子女號。家家賣釵釧。只待獻春醪。

0979 收京三首

仙仗離丹極。妖星照玉除。須為下殿走。不可好樓居。暫屈汾陽駕。聊飛燕將書。依然七廟略。更與萬方初。
生意甘衰白。天涯正寂寥。忽聞哀痛詔。又下聖明朝。羽翼懷商老。文思憶帝堯。叨逢罪己日。霑灑望青霄。
汗馬收宮闕。春城鏟賊壕。賞應歌杕杜。歸及薦櫻桃。雜虜橫戈數。功臣甲第高。萬方頻送喜。毋乃聖躬勞。

0989 送鄭十八虔貶台州司户，傷其臨老陷賊之故，闕爲面别，情見于詩

鄭公樗散鬢成絲。酒後常稱老畫師。萬里傷心嚴譴日。百年垂死中興時。蒼惶已就長途往。邂逅無端出餞遲。便與先生應永訣。九重泉路盡交期。

0994 臘日

臘日常年暖尚遥。今年臘日凍全消。侵陵雪色還萱草。漏洩春光有柳條。縱酒欲謀良夜醉。還家初散紫宸朝。口脂面藥隨恩澤。翠管銀罌下九霄。

0998 奉和賈至舍人早朝大明宮

五夜漏聲催曉箭。九重春色醉仙桃。旌旗日暖龍蛇動。宮殿風微燕雀高。朝罷香煙携滿袖。詩成珠玉在揮毫。欲知世掌絲綸美。池上于今有鳳毛。

1006 奉答岑參補闕見贈

窈窕清禁闥。罷朝歸不同。君隨丞相後。我往日華東。冉冉柳枝碧。娟娟花蘂紅。故人得佳句。獨贈白頭翁。

1009 奉贈王中允維

中允聲名久。如今契闊深。共傳收庾信。不比得陳琳。一病緣明主。三年獨此心。窮愁應有作。試誦白頭吟。

1013 宣政殿退朝晚出左掖

天門日射黄金牓。春殿晴曛赤羽旗。宮草霏霏承委珮。鑪煙細細駐遊絲。雲近蓬萊常五色。雪殘鳷鵲亦多時。侍臣緩步歸青瑣。退食從容出每遲。

1017 紫宸殿退朝口號

户外昭容紫袖垂。雙瞻御座引朝儀。香飄合殿春風轉。花覆千官淑景移。晝漏希聞高閣報。天顔有喜近臣知。宮中每出歸東省。會送夔龍集鳳池。

1021 春宿左省

花隱掖垣暮。啾啾棲鳥過。星臨萬户動。月傍九霄多。不寢聽金鑰。因風想玉珂。明朝有封事。數問夜如何。

1025 晚出左掖

晝刻傳呼淺。春旗簇仗齊。退朝花底散。歸院柳邊迷。樓雪融城濕。宫雲去殿低。避人焚諫草。騎馬欲雞棲。

1028 題省中院壁

掖垣竹埤梧十尋。洞門對霤常陰陰。落花遊絲白日静。鳴鳩乳燕青春深。腐儒衰晚謬通籍。退食遲迴違寸心。衮職曾無一字補。許身媿比雙南金。

1034 送賈閣老出汝州

西掖梧桐樹。空留一院陰。艱難歸故里。去住損春心。宫殿青門隔。雲山紫邏深。人生五馬貴。莫受二毛侵。

1037 送翰林張司馬南海勒碑

冠冕通南極。文章落上台。詔從三殿去。碑到百蠻開。野舘濃花發。春帆細雨來。不知滄海上。天遣幾時迴。

1040 曲江陪鄭八丈南史飲

雀啄江頭黄柳花。鵁鶄鸂鶒滿晴沙。自知白髮非春事。且盡芳樽戀物華。近侍即今難浪跡。此身那得更無家。丈人文力猶強健。豈傍青門學種瓜。

1045 曲江二首

一片花飛減却春。風飄萬點正愁人。且看欲盡花經眼。莫厭傷多酒入唇。江上小堂巢翡翠。苑邊高冢臥麒麟。細推物理須行樂。何用浮名絆此身。
朝迴日日典春衣。每日江頭盡醉歸。酒債尋常行處有。人生七十古來稀。穿花蛺蝶深深見。點水蜻蜓款款飛。傳語風光共流轉。暫時相賞莫相違。

1052 曲江對酒

苑外江頭坐不歸。水精春殿轉霏微。桃花細逐楊花落。黃鳥時兼白鳥飛。縱飲久判人共弃。懶朝真與世相違。吏情更覺滄洲遠。老大悲傷未拂衣。

1058 曲江對雨

城上春雲覆苑牆。江亭晚色靜年芳。林花著雨燕脂落。水荇牽風翠帶長。龍武新軍深駐輦。芙蓉别殿謾焚香。何時詔此金錢會。暫醉佳人錦瑟傍。

1064 奉陪鄭駙馬韋曲二首

韋曲花無賴。家家惱殺人。渌樽須盡日。白髮好禁春。石角鈎衣破。藤枝刺眼新。何時占叢竹。頭戴小烏巾。
野寺垂楊裏。春畦亂水閒。美花多映竹。好鳥不歸山。城郭終何事。風塵豈駐顔。誰能共公子。薄暮欲俱還。

1069 送許八拾遺歸江寧覲省，甫昔時嘗客遊此縣，於許生處乞瓦棺寺維摩圖樣，志諸篇末

詔許辭中禁。慈顔赴北堂。聖朝新孝理。祖席倍輝光。內帛擎偏重。宫衣著更香。淮陰清夜驛。京口渡江航。春隔鷄人晝。秋期燕子涼。賜書誇父老。壽酒樂城隍。看畫曾飢渴。追蹤恨淼茫。虎頭金粟影。神妙獨難忘。

1075 因許八寄江寧旻上人

不見旻公三十年。封書寄與淚潺湲。舊來好事今能否。老去新詩誰與傳。碁局動隨尋澗竹。袈裟憶上泛湖船。聞君話我爲官在。頭白昬昬只醉眠。

1079 題李尊師松樹障子歌

老夫清晨梳白頭。玄都道士來相訪。握髮呼兒延入户。手提新畫青松障。障子松林靜杳冥。憑軒忽若無丹青。陰崖却承霜雪幹。偃蓋反走虬龍形。老夫生平好奇古。對此興與精靈聚。已知仙客意相親。更覺良工心獨苦。松下丈人巾屨同。偶坐似是商山翁。悵望聊歌紫芝曲。時危慘淡來悲風。

1083 得舍弟消息

風吹紫荊樹。色與春庭暮。花落辭故枝。風廻返無處。骨肉恩書重。漂泊難相遇。猶有淚成河。經天復東注。

1085 送李校書二十六韻

代北有豪鷹。生子毛盡赤。渥洼騏驥兒。尤異是龍脊。李舟名父子。清峻流輩伯。人間好少年。不必須白皙。十五富文史。十八足賓客。十九授校書。二十聲輝赫。衆中每一見。使我潛動魄。自恐二男兒。辛勤養無益。乾元元年春。萬姓始安宅。舟也衣綵衣。告我欲遠適。倚門固有望。斂衽就行役。南登吟白華。已見楚山碧。藹藹咸陽都。冠蓋日雲積。何時太夫人。堂上會親戚。汝翁草明光。天子正前席。歸期豈爛漫。别意終感激。顧我蓬屋資。謬通金閨籍。小來習性懶。晚節慵轉劇。每愁悔吝作。如覺天地窄。羡君齒髮新。行己能夕惕。臨歧意頗切。對酒不能喫。廻身視綠野。慘澹如荒澤。老鴈春忍飢。哀號待枯麥。時哉高飛燕。絢練新羽翮。長雲濕襃斜。漢水饒巨石。無令軒車遲。衰疾悲宿昔。

1095 偪仄行

偪仄何偪仄。我居巷南子巷北。可恨鄰里閒。十日不一見顔色。自從官馬送還官。行路難行澁如棘。我貧無乘非無足。昔者相過今不得。實不是愛微軀。又非關足無力。徒步翻愁官長怒。此心炯炯君應識。曉來急雨春風顛。睡美不聞鍾鼓傳。東家蹇驢許借我。泥滑不敢騎朝天。已令請急會通籍。男兒性命絶可憐。焉能終日心拳拳。憶君誦詩神凜然。辛夷始花亦已落。況我與子非壯年。街頭酒價常苦貴。方外酒徒稀醉眠。速宜相就飲一斗。恰有三百青銅錢。

1102 贈畢四曜

才大今詩伯。家貧苦宦卑。飢寒奴僕賤。顔狀老翁爲。同調嗟誰惜。論文笑自知。流傳江鮑體。相顧免無兒。

1105 題鄭十八著作丈

台州地闊海冥冥。雲水長和島嶼青。亂後故人雙别淚。春深逐客一浮萍。酒酣懶舞誰相拽。詩罷能吟不復聽。第五橋東流恨水。皇陂岸北結愁亭。賈生對鵩傷王傅。蘇武看羊陷賊庭。可念此翁懷直道。也霑新國用輕刑。禰衡實恐遭江夏。方朔虚傳是歲星。窮巷悄然車馬絶。案頭乾死讀書螢。

1110 義鶻行

陰崖有蒼鷹。養子黑柏顛。白蛇登其巢。吞噬恣朝餐。雄飛遠求食。雌者鳴辛酸。力強不可制。黃口無半存。其父從西歸。翻身入長煙。斯須領健鶻。痛憤寄所宣。斗上捩孤影。噭哮來九天。脩鱗脫遠枝。巨顙拆老拳。高空得蹭蹬。短草辭蜿蜒。折尾能一掉。飽腸皆已穿。生雖滅眾雛。死亦垂千年。物情有報復。快意貴目前。茲實鷙鳥最。急難心炯然。功成失所往。用捨何其賢。近經潏水湄。此事樵夫傳。飄蕭覺素髮。凜欲衝儒冠。人生許與分。只在顧眄間。聊爲義鶻行。用激壯士肝。

1118 畫鶻行

高堂見生鶻。颯爽動秋骨。初驚無拘攣。何得立突兀。乃知畫師妙。功刮造化窟。寫此神俊姿。充君眼中物。烏鵲滿樛枝。軒然恐其出。側腦看青霄。寧爲衆禽没。長翮如刀劍。人寰可超越。乾坤空崢嶸。粉墨且蕭瑟。緬思雲沙際。自有煙霧質。吾今意何傷。顧步獨紆鬱。

1122 端午日賜衣

宮衣亦有名。端午被恩榮。細葛含風軟。香羅疊雪輕。自天題處濕。當暑著來清。意內稱長短。終身荷聖情。

1126 酬孟雲卿

樂極傷頭白。更長愛燭紅。相逢難衮衮。告别莫怱怱。但恐天河落。寧辭酒盞空。明朝牽世務。揮淚各西東。

1129 至德二載，甫自京金光門出，間道歸鳳翔。乾元初，從左拾遺移華州掾，與親故别，因出此門，有悲往事

此道昔歸順。西郊胡正繁。至今殘破膽。應有未招魂。近侍歸京邑。移官豈至尊。無才日衰老。駐馬望千門。

1135 寄高三十五詹事

安穩高詹事。兵戈久索居。時來如宦達。歲晚莫情踈。天上多鴻雁。池中足鯉魚。相看過半百。不寄一行書。

1139 題鄭縣亭子

鄭縣亭子澗之濱。户牖憑高發興新。雲斷岳蓮臨大路。天晴宫柳暗長春[宫名]柳暗長春。巢邊野雀群欺鷰。花底山蜂遠趂人。更欲題詩滿青竹。晚來幽獨恐傷神。

1144 望岳

西岳崚嶒竦處尊。諸峯羅立如兒孫。安得仙人九節杖。拄到玉女洗頭盆。車箱入谷無歸路。箭栝通天有一門。稍待秋風涼冷後。高尋白帝問真源。

1151 早秋苦熱堆案相仍

七月六日苦炎蒸。對食暫飡還不能。每愁夜中自足蝎。況乃秋後轉多蠅。束帶發狂欲大叫。簿書何急來相仍。南望青松架短壑。安得赤腳踏層冰。

1156 觀安西兵過赴關中待命二首

四鎮富精銳。摧鋒皆絕倫。還聞獻士卒。足以靜風塵。老馬夜知道。蒼鷹飢著人。臨危經久戰。用急始如神。奇兵不在眾。萬馬救中原。談笑無河北。心肝奉至尊。孤雲隨殺氣。飛鳥避轅門。竟日留歡樂。城池未覺喧。

1164 留花門

花門天驕子。飽肉氣勇決。高秋馬肥健。挾矢射漢月。自古以為患。詩人厭薄伐。修德使其來。羈縻固不絕。胡為傾國至。出入暗金闕。中原有驅除。隱忍用此物。公主歌黃鵠。君王指白日。連營屯左輔。百里見積雪。長戟鳥休飛。哀笳曙幽咽。田家最恐懼。麥倒桑枝折。沙苑臨清渭。泉香草豐㓗。渡河不用船。千騎常撇捩。胡塵踰太行。雜種抵京室。花門既須留。原野轉蕭瑟。

1173 九日藍田崔氏莊

老去悲秋強自寬。興來今日盡君歡。羞將短髮還吹帽。笑倩傍人為正冠。藍水遠從千㵎落。玉山高並兩峯寒。明年此會知誰健。醉把茱萸子細看。

1183 崔氏東山草堂

愛汝玉山草堂靜。高秋爽氣相鮮新。有時自發鐘磬響。落日更見漁樵人。盤剥白鴉谷口栗。飯煮青泥坊底芹。何為西莊王給事。柴門空閉鎖松筠[王維時被張通儒禁在東山北寺，有所歎息，故云。]。

1190 瘦馬行

東郊瘦馬使我傷。骨骼硉兀如堵牆。絆之欲動轉欹側。此豈有意仍騰驤。細看六印帶官字。眾道三軍遺路傍。皮乾剝落雜泥滓。毛暗蕭條連雪霜。去歲奔波逐餘寇。驊騮不慣不得將。士卒多騎內廄馬。惆悵恐是病乘黄。當時歷塊誤一蹶。委弃非汝能周防。見人慘澹若哀訴。失主錯漠無晶光。天寒遠放鴈為伴。日暮不收鳥啄瘡。誰家且養願終惠。更試明年春草長。

1197 遣興三首

我今日夜憂。諸弟各異方。不知死與生。何況道路長。避寇一分散。飢寒永相望。豈無柴門歸。欲出畏虎狼。仰看雲中鴈。禽鳥亦有行。
蓬生非無根。漂蕩隨高風。天寒落萬里。不復歸本叢。客子念故宅。三年門巷空。悵望但烽火。戎車滿關東。生涯能幾何。常在羇旅中。
昔在洛陽時。親友相追攀。送客東郊道。遨遊宿南山。煙塵阻長河。樹羽成皋閒。回首載酒地。豈無一日還。丈夫貴壯健。慘戚非朱顏。

1204 至日遣興奉寄北省舊閣老兩院故人二首

去歲兹辰捧御床。五更三點入鵷行。欲知趨走傷心地。正想氛氳滿眼香。無路從容陪語笑。有時顛倒著衣裳。何人錯憶窮愁日。愁日愁隨一線長。
憶昨逍遙供奉班。去年今日侍龍顏。麒麟不動鑪煙上。孔雀徐開扇影還。玉几由來天北極。朱衣只在殿中閒。孤城此日堪腸斷。愁對寒雲雪滿山。

1212 路逢襄陽楊少府入城戲呈楊員外綰

寄語楊員外。山寒少茯苓。歸來稍暄暖。當為斸青冥。翻動神仙窟。封題鳥獸形。兼將老藤杖。扶汝醉初醒。

1216 閿鄉姜七少府設鱠戲贈長歌

姜侯設鱠當嚴冬。昨日今日皆天風。河凍未漁不易得。鑿冰恐侵河伯宫。饔人受魚鮫人手。洗魚磨刀魚眼紅。無聲細下飛碎雪。有骨已剁觜[平聲]春葱。偏勸腹腴愧年少。軟炊香飯緣老翁。落碪何曾白紙濕。放筯未覺金盤空。新歡便飽姜侯德。清觴異味情屢極。東歸貪路自覺難。欲别上馬身無力。可怜為人好心事。於我見子真顏色。不恨我衰子貴時。悵望且為今相憶。

1222 戲贈閿鄉秦少公短歌

去年行宫當太白。朝廻君是同舍客。同心不減骨肉親。每語見許文章伯。今日時清兩京道。相逢苦覺人情好。昨夜邀歡樂更無。多才依舊能潦倒。

1225 湖城東遇孟雲卿，復歸劉顥宅宿，宴飲散，因為醉歌

疾風吹塵暗河縣。行子隔手不相見。湖城城東一開眼。駐馬偶識雲卿面。況非劉顥為地主。懶廻鞭轡成高宴。劉侯歎我攜客來。置酒張燈促華饌。且將款曲終今夕。休語艱難尚酣戰。照室紅爐促曙光。縈䆫素月垂文練。天開地裂長安陌。寒盡春生洛陽殿。豈知驅車復同軌。可惜刻漏隨更箭。人生會合不可常。庭樹雞鳴淚如線。

1230 李鄠縣丈人胡馬行

丈人駿馬名胡騮。前年避胡過金牛。廻鞭却走見天子。朝飲漢水暮靈州。自矜胡騮奇絕代。乘出千人萬人愛。一聞說盡急難材。轉益愁向駑駘輩。頭上銳耳批秋竹。腳下高蹄削寒玉。始知神龍别有種。不比俗馬空多肉。洛陽大道時再清。累日喜得俱東行。鳳臆龍鬐未易識。側身注目長風生。

1233 憶弟二首

喪亂聞吾弟。飢寒傍濟州。人稀吾不到。兵在見何由。憶昨狂催走。無時病去憂。即今千種恨。惟共水東流。
且喜河南定。不問鄴城圍。百戰今誰在。三年望汝歸。故園花自發。春日鳥還飛。斷絕人煙久。東西消息稀。

";
?>