<?php
/*
生成：本文檔用 PHP 生成。
生成程式：
php H:\github\Dufu-Analysis\analysis_programs\生成版本評論.php 蕭
說明：本文檔儲存蕭滌非主編《杜甫全集校注》評論。
應用程式： 
php h:\github\Dufu-Analysis\analysis_programs\搜索程式\頁碼、簡稱→評論.php 0003 蕭
*/
$蕭評論=array(
'〚0013:1:7〛'=>array(
'董養性曰:「三聯稱美張氏，内能清心寡欲，外能全身遠害。」',
),
'〚0013:2:15〛'=>array(
'李因篤曰：末二句謂與張深契，故醉歸忘山路之險。若云醉而不知，則淺矣。',
),
'〚0013:1:〛'=>array(
'張性曰：公言獨行春山以尋訪張君，聞伐木之聲，而山意更幽，見隱居之深僻，亦兼《伐木》篇求友之事。春山而澗道猶寒者，冰雪未消之故，公則歷冰雪而行。石門深杳，斜照方能及之，公到林丘，正日斜之時。因美張公惟能不貪，故夜間常識寶氣；惟能遠害全身，故見向時貴盛之家，一朝麋鹿遊其地。或云遠害而與麋鹿遊，意亦通。末言我乘興而來，乍入此隱居，其心已杳然而出處兩忘矣。對張君同坐，知其不貪而遠害，不爲名利所絆，若虛舟無繫而往回自在，公蓋心醉而神服也。前四句記來訪隱居之事，後四句美張君而致歎焉。（《杜律演義》前集）',
'津阪孝綽曰：「乘興」二字，結上起下，關係尤要。「杳然」，猶言悠然。「迷」，言疑而不決也。「出處」，用《易》「或出或處」。公固志存用世，今見張氏恬退如此，心竊有感，故偶發此言耳。結句極言心醉而神服之。「虛舟」，譬人之虛懷。其乘興相忘，如泛虛舟也。一結深致其景慕之忱。蓋昨夕以來，因對主人清曠襟懷，而吾亦萬慮消盡，胸中如洗，非復塵寰中人，殆與之俱化也。（《杜律詳解》卷上）',
),
'〚0013:2:〛'=>array(
'單復曰：此詩言張氏時相見而以晚興見留，霽潭、春草，言晚興。求梨、勸酒，言邀留，而以歸醉無愁結之，此足以見主賓相敬之深，禮意之厚也。（《讀杜詩愚得》卷一）',
'張溍曰：此首意皆七言所無，七言是日斜初來，五言是晚留共飲。前首「出」字，此首「歸」字，二詩共成起結，刪一首則其義不全，是知杜詩次序不宜亂，又宜通看。（《讀書堂杜詩注解》卷一）',
'陳訏曰：前首從山行景趣，結到乘興對君。次首從相見款留，結到歸路無愁。兩首迴環，共爲首尾。公連章詩每用此格，亦一定章法也。（《讀杜隨筆》上卷一）',
'盧元昌曰：句句與前章對發，「晚興」隱承「乘興」二字。「濟潭」二句，隱承「遠害」意。「鱣發發」，不罹網矣；「鹿呦呦」，不卽險矣。「杜酒」二句，隱承「不貪」意。蓋酒不他取，只須杜酒；梨不他覓，無過張梨也。「歸路險」，隱承「澗道」、「石門」。（《杜詩闡》卷一）',
'紀容舒曰：本一時之作，文意相承。前首言日斜始到，則已向晚矣；張具酒邀公，公遂乘興而留。「晚興留」三字，是一篇之主。（《杜律詳解》卷一）',
),
'〚1324:〛'=>array(
'',
));
?>