<?php
/*
生成：本文檔用人手生成、編輯。
說明：書目簡稱。
*/
$書目簡稱 = array(
// 杜詩資料庫文件夾
"=全"=>"《全唐詩》",
"=地"=>"《地名詞典》",
"=郭"=>"郭知達《新刊校定集注杜詩》",
"=黃"=>"黃希、黃鶴《黃氏補千家註紀年杜工部詩史》",
"=蔡"=>"蔡梦弼《杜工部草堂詩箋》",
"=奭"=>"王嗣奭《杜臆》",

//"=疊"=>"周春《杜詩雙聲疊韻譜括略》",
"=顧"=>"顧宸《辟疆園杜詩註解》",
"=錢"=>"錢謙益《錢注杜詩》",
"=朱"=>"朱鶴齡《杜工部詩集輯注》",
"=楊"=>"楊倫《杜詩鏡銓》",
"=浦"=>"浦起龍《讀杜心解》",
"=仇"=>"仇兆鰲《杜詩詳註》",
"=蕭"=>"蕭滌非主編《杜甫全集校注》",
"=謝"=>"謝思煒《杜甫集校注》",
"=默"=>"詩集",
"=名"=>"《名家注評全唐詩》",
"=今"=>"張志烈主編《杜詩全集（今注本）》",
"=粵"=>"陳永明《杜甫全集粵音注音》",
"=約"=>"陳永明《杜詩約注》",
"=筆"=>"陳永明《讀杜筆記》",
"=譯"=>"韓成武、張志民《杜甫詩全譯》",
// 其他
"=榷"=>"徐仁甫《杜詩注解商榷》",
"=訳"=>"下定雅弘、松原 朗《杜甫全詩訳注》",
"=趙"=>"林繼中輯校《杜詩趙次公先後解輯校》",
"=歐"=>"Stephen_Owen_The_Poetry_of_Du_Fu",
"=莫"=>"莫礪鋒、童強《杜甫詩選》",
"=典"=>"《引典出處》",
//""=>"",
);
?>