<?php
/*
生成：本文檔用 PHP 生成，人手編輯。
說明：浦起龍《讀杜心解》的冊、頁碼。
array( "中華書局冊.頁碼", "早稻田冊.頁碼", "已校" )
已校：校對，不包括早稻田

注意：這裏表示的是下載來的 PDF 電子書的頁碼，
不是實體書的頁碼。
*/
$浦PDF頁碼=array( //1.264
"0003 望嶽"=>array( "1.100", "2.3", "已校" ), // 0001
"0042 遊龍門奉先寺"=>array( "1.101", "2.4", "已校" ), // 0002
"0076 贈李白"=>array( "1.101", "2.4", "已校" ), // 0003
"0079 陪李北海宴歷下亭"=>array( "1.102", "2.5" ), // 0004
"0084 同李太守登歷下古城員外新亭"=>array( "1.103", "2.5" ), // 0005
"0276 奉贈韋左丞丈二十二韻"=>array( "1.103", "2.6" ), // 0006
"0241 前出塞九首"=>array( "1.105", "2.7" ), // 0007-0015
"0295 同諸公登慈恩寺塔"=>array( "1.108", "2.9" ), // 0016
"0388 送高三十五書記"=>array( "1.109", "2.9" ), // 0017




"0008 登兗州城樓"=>
	array( "2.3", "6.4" ),
"0013 題張氏隱居二首"=>array(
	array( "3.3", "8.5" ),   // 第一首
	array( "2.4", "6.5" ) ), // 第二首
"0022 劉九法曹鄭瑕丘石門宴集"=>
	array( "2.4", "6.5" ),
"0025 與任城許主簿遊南池"=>
	array( "2.4", "6.5" ),
"0027 對雨書懷走邀許主簿"=>
	array( "2.5", "6.6" ),
"0030 巳上人茅齋"=>
	array( "2.5", "6.6" ),
"0034 房兵曹胡馬"=>
	array( "2.6", "6.6" ),
"0038 畫鷹"=>
	array( "1.0", "1.0" ),
"0048 過宋員外之問舊莊"=>
	array( "1.", "1.0" ),
"0053 臨邑舍弟書至，苦雨，黃河泛溢，隄防之患，簿領所憂，因寄此詩，用寬其意"=>
	array( "3.88", "9.3" ),
"0059 天寶初，南曹小司寇舅，於我太夫人堂下，壘土爲山，一匱盈尺，以代彼朽木，承諸焚香瓷甌，甌甚安矣。旁植慈竹，蓋茲數峯，嶔岑嬋娟，宛有塵外數致。乃不知興之所至，而作是詩"=>
	array( "1.0", "1.0" ),
"0062 李監宅二首"=>
	array( "1.0", "1.0" ),
"0068 夜宴左氏莊"=>
	array( "1.0", "1.0" ),
"0073 龍門"=>
	array( "1.0", "1.0" ),
"0092 暫如臨邑，至㟙山湖亭，奉懷李員外，率爾成興"=>
	array( "1.0", "1.0" ),
"0095 與李十二白同尋范十隱居"=>
	array( "1.0", "1.0" ),
"0099 贈李白"=>
	array( "1.0", "1.0" ),
"0103 冬日有懷李白"=>
	array( "1.0", "1.0" ),
"0107 春日憶李白"=>
	array( "1.0", "1.0" ),
"0111 送孔巢父謝病歸遊江東兼呈李白"=>
	array( "1.0", "1.0" ),
"0120 鄭駙馬宅宴洞中"=>
	array( "1.0", "1.0" ),
"0126 贈特進汝陽王二十二韻"=>
	array( "1.0", "1.0" ),
"0136 飲中八仙歌"=>
	array( "1.0", "1.0" ),
"0144 今夕行"=>
	array( "1.0", "1.0" ),
"0148 贈比部蕭郎中十兄"=>
	array( "1.0", "1.0" ),
"0152 故武衞將軍挽歌三首"=>
	array( "1.0", "1.0" ),
"0161 奉寄河南韋尹丈人"=>
	array( "1.0", "1.0" ),
"0167 高都護驄馬行"=>
	array( "1.0", "1.0" ),
"0173 冬日洛城北謁玄元皇帝廟"=>
	array( "1.0", "1.0" ),
"0184 行次昭陵"=>
	array( "1.0", "1.0" ),
"0199 重經昭陵"=>
	array( "1.0", "1.0" ),
"0204 贈翰林張四學士"=>
	array( "1.0", "1.0" ),
"0209 贈韋左丞丈濟"=>
	array( "1.0", "1.0" ),
"0214 樂遊園歌"=>
	array( "1.0", "1.0" ),
"0223 病後過王倚飲贈歌"=>
	array( "1.0", "1.0" ),
"0229 兵車行"=>
	array( "1.0", "1.0" ),
"0262 投簡咸華兩縣諸子"=>
	array( "1.0", "1.0" ),
"0266 杜位宅守歲"=>
	array( "1.0", "1.0" ),
"0271 玄都壇歌寄元逸人"=>
	array( "1.0", "1.0" ),
"0288 奉留贈集賢院崔于二學士"=>
	array( "1.0", "1.0" ),
"0305 曲江三章章五句"=>
	array( "1.0", "1.0" ),
"0311 敬贈鄭諫議十韻"=>
	array( "1.0", "1.0" ),
"0317 貧交行"=>
	array( "1.0", "1.0" ),
"0319 白絲行"=>
	array( "1.0", "1.0" ),
"0326 送韋書記赴安西"=>
	array( "1.0", "1.0" ),
"0328 奉贈鮮于京兆二十韻"=>
	array( "1.0", "1.0" ),
"0338 石硯詩"=>
	array( "1.220", "3.40" ),
"0342 麗人行"=>
	array( "1.0", "1.0" ),
"0353 虢國夫人"=>
	array( "1.0", "1.0" ),
"0356 陪鄭廣文遊何將軍山林十首"=>
	array( "1.0", "1.0" ),
"0396 九日曲江"=>
	array( "1.0", "1.0" ),
"0400 贈陳二補闕"=>
	array( "1.0", "1.0" ),
"0403 送張二十參軍赴蜀州，因呈楊五侍御"=>
	array( "1.0", "1.0" ),
"0406 寄高三十五書記"=>
	array( "1.0", "1.0" ),
"0409 醉時歌"=>
	array( "1.0", "1.0" ),
"0419 重過何氏五首"=>
	array( "1.0", "1.0" ),
"0434 城西陂泛舟"=>
	array( "1.0", "1.0" ),
"0438 陪諸貴公子丈八溝携妓納涼，晚際遇雨二首"=>
	array( "1.0", "1.0" ),
"0443 渼陂行"=>
	array( "1.0", "1.0" ),
"0452 與鄠縣源大少府宴渼陂"=>
	array( "1.0", "1.0" ),
"0456 渼陂西南臺"=>
	array( "1.110", "2.10" ),
"0462 夏日李公見訪"=>
	array( "1.113", "2.13" ),
"0465 秋雨歎三首"=>
	array( "1.0", "1.0" ),
"0476 苦雨奉寄隴西公兼呈王徵士"=>
	array( "1.111", "2.11" ),
"0481 送裴二虬作尉永嘉"=>
	array( "1.0", "1.0" ),
"0484 九日寄岑參"=>
	array( "1.110", "2.11" ),
"0490 歎庭前甘菊花"=>
	array( "1.0", "1.0" ),
"0494 承沈八丈東美除膳部員外，阻雨未遂馳賀，奉寄此詩"=>
	array( "1.0", "1.0" ),
"0499 崔駙馬山亭宴集"=>
	array( "1.0", "1.0" ),
"0501 示從孫濟"=>
	array( "1.112", "2.12" ),
"0506 奉贈太常張卿垍二十韻"=>
	array( "1.0", "1.0" ),
"0515 橋陵詩三十韻因呈縣內諸官"=>
	array( "1.0", "1.0" ),
"0527 奉先劉少府新畫山水障歌"=>
	array( "1.0", "1.0" ),
"0536 贈獻納使起居田舍人"=>
	array( "1.0", "1.0" ),
"0541 沙苑行"=>
	array( "1.0", "1.0" ),
"0549 天育驃騎歌"=>
	array( "1.0", "1.0" ),
"0557 贈田九判官"=>
	array( "1.0", "1.0" ),
"0563 投贈哥舒開府翰二十韻"=>
	array( "1.0", "1.0" ),
"0576 戲簡鄭廣文虔兼呈蘇司業源明"=>
	array( "1.113", "2.13" ),
"0581 上韋左相二十韻"=>
	array( "1.0", "1.0" ),
"0592 夜聽許十誦詩愛而有作"=>
	array( "1.112", "2.12" ),
"0598 醉歌行"=>
	array( "1.0", "1.0" ),
"0605 陪李金吾花下飲"=>
	array( "1.0", "1.0" ),
"0608 驄馬行"=>
	array( "1.0", "1.0" ),
"0615 魏將軍歌"=>
	array( "1.0", "1.0" ),
"0622 送蔡希魯都尉還隴右因寄高三十五書記"=>
	array( "1.0", "1.0" ),
"0627 九日楊奉先會白水崔明府"=>
	array( "1.0", "1.0" ),
"0631 白水明府舅宅喜雨"=>
	array( "1.0", "1.0" ),
"0633 官定後戲贈"=>
	array( "1.0", "1.0" ),
"0636 後出塞五首"=>
	array( "1.114", "2.13" ),
"0652 去矣行"=>
	array( "1.0", "1.0" ),
"0656 奉同郭給事湯東靈湫作"=>
	array( "1.117", "2.16" ),
"0668 自京赴奉先縣詠懷五百字"=>
	array( "1.120", "2.17" ),
"0695 蘇端薛復筵簡薛華醉歌"=>
	array( "1.0", "1.0" ),
"0703 晦日尋崔戢李封"=>
	array( "1.123", "2.20" ),
"0710 送率府程錄事還鄕"=>
	array( "1.0", "1.0" ),
"0715 白水縣崔少府十九翁高齋三十韻"=>
	array( "1.124", "2.21" ),
"0725 三川觀水漲二十韻"=>
	array( "1.125", "2.22" ),
"0733 月夜"=>
	array( "1.0", "1.0" ),
"0737 悲陳陶"=>
	array( "1.0", "1.0" ),
"0742 悲青坂"=>
	array( "1.0", "1.0" ),
"0745 避地"=>
	array( "1.0", "1.0" ),
"0748 對雪"=>
	array( "1.0", "1.0" ),
"0752 元日"=>
	array( "1.0", "1.0" ),
"0755 塞蘆子"=>
	array( "1.127", "2.23" ),
"0760 哀江頭"=>
	array( "1.0", "1.0" ),
"0771 哀王孫"=>
	array( "1.0", "1.0" ),
"0779 春望"=>
	array( "1.0", "1.0" ),
"0783 得舍弟消息二首"=>
	array( "1.0", "1.0" ),
"0786 憶幼子"=>
	array( "1.0", "1.0" ),
"0789 一百五日夜對月"=>
	array( "1.0", "1.0" ),
"0794 遣興"=>
	array( "1.0", "1.0" ),
"0797 大雲寺贊公房四首"=>
	array( "1.128", "2.24" ),
"0809 雨過蘇端"=>
	array( "1.130", "2.25" ),
"0813 喜晴"=>
	array( "1.131", "2.26" ),
"0819 鄭駙馬池臺喜遇鄭廣文同飲"=>
	array( "1.0", "1.0" ),
"0824 喜達行在所三首"=>
	array( "1.0", "1.0" ),
"0833 送樊二十三侍御赴漢中判官"=>
	array( "1.132", "2.27" ),
"0841 述懷一首"=>
	array( "1.131", "2.26" ),
"0848 送長孫九侍御赴武威判官"=>
	array( "1.135", "2.29" ),
"0853 送從弟亞赴河西判官"=>
	array( "1.136", "2.29" ),
"0861 送韋十六評事充同谷郡防禦判官"=>
	array( "1.133", "2.28" ),
"0868 得家書"=>
	array( "1.0", "1.0" ),
"0871 月"=>
	array( "1.0", "1.0" ),
"0875 奉送郭中丞兼太僕卿充隴右節度使三十韻"=>
	array( "1.0", "1.0" ),
"0890 送楊六判官使西蕃"=>
	array( "1.0", "1.0" ),
"0896 送靈州李判官"=>
	array( "1.0", "1.0" ),
"0899 奉贈嚴八閣老"=>
	array( "1.0", "1.0" ),
"0902 留別賈嚴二閣老兩院補闕"=>
	array( "1.0", "1.0" ),
"0904 九成宮"=>
	array( "1.137", "2.30" ),
"0909 徒步歸行"=>
	array( "1.138", "2.31" ),
"0912 玉華宮"=>
	array( "1.0", "1.0" ),
"0917 晚行口號"=>
	array( "1.0", "1.0" ),
"0922 獨酌成詩"=>
	array( "1.0", "1.0" ),
"0925 彭衙行"=>
	array( "1.143", "2.37" ),
"0934 羌村三首"=>
	array( "1.142", "2.36" ),
"0943 北征"=>
	array( "1.138", "2.33" ),
"0972 喜聞官軍已臨賊寇二十韻"=>
	array( "1.0", "1.0" ),
"0979 收京三首"=>
	array( "1.0", "1.0" ),
"0989 送鄭十八虔貶台州司戶，傷其臨老陷賊之故，闕爲面別，情見于詩"=>
	array( "1.0", "1.0" ),
"0994 臘日"=>
	array( "1.0", "1.0" ),
"0998 奉和賈至舍人早朝大明宮"=>
	array( "1.0", "1.0" ),
"1006 奉答岑參補闕見贈"=>
	array( "1.0", "1.0" ),
"1009 奉贈王中允維"=>
	array( "1.0", "1.0" ),
"1013 宣政殿退朝晚出左掖"=>
	array( "1.0", "1.0" ),
"1017 紫宸殿退朝口號"=>
	array( "1.0", "1.0" ),
"1021 春宿左省"=>
	array( "1.0", "1.0" ),
"1025 晚出左掖"=>
	array( "1.0", "1.0" ),
"1028 題省中院壁"=>
	array( "1.0", "1.0" ),
"1034 送賈閣老出汝州"=>
	array( "1.0", "1.0" ),
"1037 送翰林張司馬南海勒碑"=>
	array( "1.0", "1.0" ),
"1040 曲江陪鄭八丈南史飲"=>
	array( "1.0", "1.0" ),
"1045 曲江二首"=>
	array( "1.0", "1.0" ),
"1052 曲江對酒"=>
	array( "1.0", "1.0" ),
"1058 曲江對雨"=>
	array( "1.0", "1.0" ),
"1064 奉陪鄭駙馬韋曲二首"=>
	array( "1.0", "1.0" ),
"1069 送許八拾遺歸江寧覲省，甫昔時嘗客遊此縣，於許生處乞瓦棺寺維摩圖樣，志諸篇末"=>
	array( "1.0", "1.0" ),
"1075 因許八寄江寧旻上人"=>
	array( "1.0", "1.0" ),
"1079 題李尊師松樹障子歌"=>
	array( "1.0", "1.0" ),
"1083 得舍弟消息"=>
	array( "1.144", "2.38" ),
"1085 送李校書二十六韻"=>
	array( "1.145", "2.38" ),
"1095 偪仄行"=>
	array( "1.0", "1.0" ),
"1102 贈畢四曜"=>
	array( "1.0", "1.0" ),
"1105 題鄭十八著作丈"=>
	array( "1.0", "1.0" ),
"1110 義鶻行"=>
	array( "1.146", "2.39" ),
"1118 畫鶻行"=>
	array( "1.149", "2.41" ),
"1122 端午日賜衣"=>
	array( "1.0", "1.0" ),
"1126 酬孟雲卿"=>
	array( "1.0", "1.0" ),
"1129 至德二載，甫自京金光門出，間道歸鳳翔。乾元初，從左拾遺移華州掾，與親故別，因出此門，有悲往事"=>
	array( "1.0", "1.0" ),
"1135 寄高三十五詹事"=>
	array( "1.0", "1.0" ),
"1139 題鄭縣亭子"=>
	array( "1.0", "1.0" ),
"1144 望岳"=>
	array( "1.0", "1.0" ),
"1151 早秋苦熱堆案相仍"=>
	array( "1.0", "1.0" ),
"1156 觀安西兵過赴關中待命二首"=>
	array( "1.0", "1.0" ),
"1164 留花門"=>
	array( "1.149", "2.41" ),
"1173 九日藍田崔氏莊"=>
	array( "1.0", "1.0" ),
"1183 崔氏東山草堂"=>
	array( "1.0", "1.0" ),
"1190 瘦馬行"=>
	array( "1.0", "1.0" ),
"1197 遣興三首"=>
	array( "1.165", "2.53" ),
"1204 至日遣興奉寄北省舊閣老兩院故人二首"=>
	array( "1.0", "1.0" ),
"1212 路逢襄陽楊少府入城戲呈楊員外綰"=>
	array( "1.0", "1.0" ),
"1216 閿鄕姜七少府設鱠戲贈長歌"=>
	array( "1.0", "1.0" ),
"1222 戲贈閿鄕秦少公短歌"=>
	array( "1.0", "1.0" ),
"1225 湖城東遇孟雲卿，復歸劉顥宅宿，宴飲散，因爲醉歌"=>
	array( "1.0", "1.0" ),
"1230 李鄠縣丈人胡馬行"=>
	array( "1.0", "1.0" ),
"1233 憶弟二首"=>
	array( "1.0", "1.0" ),
"1238 得舍弟消息"=>
	array( "1.0", "1.0" ),
"1243 觀兵"=>
	array( "1.0", "1.0" ),
"1245 不歸"=>
	array( "1.0", "1.0" ),
"1248 獨立"=>
	array( "1.0", "1.0" ),
"1252 洗兵馬"=>
	array( "1.0", "1.0" ),
"1276 重題鄭氏東亭"=>
	array( "1.0", "1.0" ),
"1280 新安吏"=>
	array( "1.151", "2.42" ),
"1288 石壕吏"=>
	array( "1.153", "2.44" ),
"1294 潼關吏"=>
	array( "1.152", "2.43" ),
"1299 新婚別"=>
	array( "1.154", "2.44" ),
"1308 垂老別"=>
	array( "1.154", "2.45" ),
"1316 無家別"=>
	array( "1.155", "2.46" ),
"1324 贈衛八處士"=>
	array( "1.150", "2.42" ),
"1330 夏日歎"=>
	array( "1.157", "2.47" ),
"1334 夏夜歎"=>
	array( "1.157", "2.47" ),
"1338 立秋後題"=>
	array( "1.158", "2.48" ),
"1340 遣興三首"=>
	array( "1.166", "2.53" ),
"1349 佳人"=>
	array( "1.162", "2.51" ),
"1356 夢李白二首"=>
	array( "1.163", "2.51" ),
"1366 有懷台州鄭十八司戶"=>
	array( "1.164", "2.52" ),
"1373 所思"=>
	array( "1.0", "1.0" ),
"1376 遣興五首"=>
	array( "1.167", "2.54" ),
"1390 遣興二首"=>
	array( "1.170", "2.56" ),
"1395 遣興五首"=>
	array( "1.168", "2.55" ),
"1405 秦州雜詩二十首"=>
	array( "1.0", "1.0" ),
"1471 月夜憶舍弟"=>
	array( "1.0", "1.0" ),
"1475 天末懷李白"=>
	array( "1.0", "1.0" ),
"1481 赤谷西崦人家"=>
	array( "1.159", "2.48" ),
"1484 宿贊公房"=>
	array( "1.0", "1.0" ),
"1488 西枝村尋置草堂地，夜宿贊公土室二首"=>
	array( "1.159", "2.48" ),
"1498 寄贊上人"=>
	array( "1.160", "2.49" ),
"1503 太平寺泉眼"=>
	array( "1.161", "2.50" ),
"1508 東樓"=>
	array( "1.0", "1.0" ),
"1511 雨晴"=>
	array( "1.0", "1.0" ),
"1514 寓目"=>
	array( "1.0", "1.0" ),
"1517 山寺"=>
	array( "1.0", "1.0" ),
"1521 卽事"=>
	array( "1.0", "1.0" ),
"1524 遣懷"=>
	array( "1.0", "1.0" ),
"1527 天河"=>
	array( "1.0", "1.0" ),
"1532 初月"=>
	array( "1.0", "1.0" ),
"1536 擣衣"=>
	array( "1.0", "1.0" ),
"1540 歸燕"=>
	array( "1.0", "1.0" ),
"1543 促織"=>
	array( "1.0", "1.0" ),
"1546 螢火"=>
	array( "1.0", "1.0" ),
"1551 蒹葭"=>
	array( "1.0", "1.0" ),
"1555 苦竹"=>
	array( "1.0", "1.0" ),
"1559 除架"=>
	array( "1.0", "1.0" ),
"1563 廢畦"=>
	array( "1.0", "1.0" ),
"1565 夕烽"=>
	array( "1.0", "1.0" ),
"1568 秋笛"=>
	array( "1.0", "1.0" ),
"1571 空囊"=>
	array( "1.0", "1.0" ),
"1575 病馬"=>
	array( "1.0", "1.0" ),
"1577 蕃劍"=>
	array( "1.0", "1.0" ),
"1580 銅瓶"=>
	array( "1.0", "1.0" ),
"1584 日暮"=>
	array( "1.0", "1.0" ),
"1586 野望"=>
	array( "1.0", "1.0" ),
"1590 送遠"=>
	array( "1.0", "1.0" ),
"1594 送人從軍"=>
	array( "1.0", "1.0" ),
"1597 示姪佐"=>
	array( "1.0", "1.0" ),
"1600 佐還山後寄三首"=>
	array( "1.0", "1.0" ),
"1607 從人覓小胡孫許寄"=>
	array( "1.0", "1.0" ),
"1610 貽阮隱居"=>
	array( "1.158", "2.48" ),
"1614 秋日阮隱居致薤三十束"=>
	array( "1.0", "1.0" ),
"1616 秦州見勅目，薛三璩授司議郎，畢四曜除監察，與二子有故，遠喜遷官，兼述索居，凡三十韻"=>
	array( "1.0", "1.0" ),
"1629 寄彭州高三十五使君適、虢州岑二十七長史參三十韻"=>
	array( "1.0", "1.0" ),
"1642 寄岳州賈司馬六丈、巴州嚴八使君兩閣老五十韻"=>
	array( "1.0", "1.0" ),
"1666 寄張十二山人彪三十韻"=>
	array( "1.0", "1.0" ),
"1681 寄李十二白二十韻"=>
	array( "1.0", "1.0" ),
"1694 別贊上人"=>
	array( "1.170", "2.57" ),
"1699 發秦州"=>
	array( "1.172", "3.3" ),
"1707 赤谷"=>
	array( "1.173", "3.4" ),
"1711 鐡堂峽"=>
	array( "1.174", "3.4" ),
"1717 鹽井"=>
	array( "1.174", "3.5" ),
"1722 寒硤"=>
	array( "1.175", "3.5" ),
"1727 法鏡寺"=>
	array( "1.175", "3.5" ),
"1733 青陽峽"=>
	array( "1.176", "3.6" ),
"1740 龍門鎮"=>
	array( "1.177", "3.6" ),
"1744 石龕"=>
	array( "1.177", "3.7" ),
"1750 積草嶺"=>
	array( "1.178", "3.7" ),
"1755 泥功山"=>
	array( "1.178", "3.7" ),
"1759 鳳凰臺"=>
	array( "1.179", "3.8" ),
"1770 乾元中寓居同谷縣作歌七首"=>
	array( "1.0", "1.0" ),
"1801 萬丈潭"=>
	array( "1.180", "3.8" ),
"1810 兩當縣吳十侍御江上宅"=>
	array( "1.171", "2.57" ),
"1821 發同谷縣"=>
	array( "1.181", "3.9" ),
"1828 木皮嶺"=>
	array( "1.181", "3.10" ),
"1835 白沙渡"=>
	array( "1.182", "3.10" ),
"1840 水會渡"=>
	array( "1.182", "3.10" ),
"1846 飛仙閣"=>
	array( "1.183", "3.11" ),
"1853 五盤"=>
	array( "1.183", "3.11" ),
"1857 龍門閣"=>
	array( "1.184", "3.12" ),
"1863 石櫃閣"=>
	array( "1.185", "3.12" ),
"1868 桔柏渡"=>
	array( "1.185", "3.12" ),
"1873 劍門"=>
	array( "1.186", "3.13" ),
"1885 鹿頭山"=>
	array( "1.187", "3.14" ),
"1892 成都府"=>
	array( "1.188", "3.14" ),
"1903 酬高使君相贈"=>
	array( "1.0", "1.0" ),
"1907 卜居"=>
	array( "1.0", "1.0" ),
"1912 王十五司馬弟出郭相訪兼遺營茅屋貲"=>
	array( "1.0", "1.0" ),
"1915 蕭八明府實處覔桃栽"=>
	array( "1.0", "1.0" ),
"1917 從韋二明府續處覔綿竹"=>
	array( "1.0", "1.0" ),
"1919 憑何十一少府邕覔榿木栽"=>
	array( "1.0", "1.0" ),
"1921 憑韋少府班覔松樹子"=>
	array( "1.0", "1.0" ),
"1923 又於韋處乞大邑瓷盌"=>
	array( "1.0", "1.0" ),
"1924 詣徐卿覔果栽"=>
	array( "1.0", "1.0" ),
"1926 堂成"=>
	array( "1.0", "1.0" ),
"1930 蜀相"=>
	array( "1.0", "1.0" ),
"1940 梅雨"=>
	array( "1.0", "1.0" ),
"1944 爲農"=>
	array( "1.0", "1.0" ),
"1947 有客"=>
	array( "1.0", "1.0" ),
"1953 賓至"=>
	array( "1.0", "1.0" ),
"1955 狂夫"=>
	array( "1.0", "1.0" ),
"1962 田舍"=>
	array( "1.0", "1.0" ),
"1965 江村"=>
	array( "1.0", "1.0" ),
"1970 江漲"=>
	array( "1.0", "1.0" ),
"1972 野老"=>
	array( "1.0", "1.0" ),
"1977 雲山"=>
	array( "1.0", "1.0" ),
"1980 遣興"=>
	array( "1.0", "1.0" ),
"1982 石笋行"=>
	array( "1.0", "1.0" ),
"1988 石犀行"=>
	array( "1.0", "1.0" ),
"1994 杜鵑行"=>
	array( "1.0", "1.0" ),
"1998 題畫馬歌"=>
	array( "1.0", "1.0" ),
"2001 戲題畫山水圖歌"=>
	array( "1.0", "1.0" ),
"2008 戲爲雙松圖歌"=>
	array( "1.0", "1.0" ),
"2013 北鄰"=>
	array( "1.0", "1.0" ),
"2016 南鄰"=>
	array( "1.0", "1.0" ),
"2023 因崔五侍御寄高彭州一絕"=>
	array( "1.0", "1.0" ),
"2025 奉簡高三十五使君"=>
	array( "1.0", "1.0" ),
"2027 和裴迪登新津寺寄王侍郎"=>
	array( "1.0", "1.0" ),
"2031 泛溪"=>
	array( "1.190", "3.16" ),
"2036 出郭"=>
	array( "1.0", "1.0" ),
"2040 恨別"=>
	array( "1.0", "1.0" ),
"2047 散愁二首"=>
	array( "1.0", "1.0" ),
"2052 贈蜀僧閭丘師兄"=>
	array( "1.188", "3.15" ),
"2061 建都十二韻"=>
	array( "1.0", "1.0" ),
"2073 村夜"=>
	array( "1.0", "1.0" ),
"2076 寄楊五桂州譚"=>
	array( "1.0", "1.0" ),
"2080 和裴迪登蜀州東亭送客逢早梅見寄"=>
	array( "1.0", "1.0" ),
"2093 西郊"=>
	array( "1.0", "1.0" ),
"2100 奉酬李都督表丈早春作"=>
	array( "1.0", "1.0" ),
"2106 題新津北橋樓"=>
	array( "1.0", "1.0" ),
"2110 暮登四安寺鐘樓寄裴十"=>
	array( "1.0", "1.0" ),
"2115 遊修覺寺"=>
	array( "1.0", "1.0" ),
"2119 後遊"=>
	array( "1.0", "1.0" ),
"2125 春夜喜雨"=>
	array( "1.0", "1.0" ),
"2131 客至"=>
	array( "1.0", "1.0" ),
"2139 遣意二首"=>
	array( "1.0", "1.0" ),
"2148 漫成二首"=>
	array( "1.0", "1.0" ),
"2161 春水生二絕"=>
	array( "1.0", "1.0" ),
"2165 江上值水如海勢，聊短述"=>
	array( "1.0", "1.0" ),
"2177 水檻遣心二首"=>
	array( "1.0", "1.0" ),
"2183 春水"=>
	array( "1.0", "1.0" ),
"2186 江亭"=>
	array( "1.0", "1.0" ),
"2193 早起"=>
	array( "1.0", "1.0" ),
"2198 落日"=>
	array( "1.0", "1.0" ),
"2202 獨酌"=>
	array( "1.0", "1.0" ),
"2207 可惜"=>
	array( "1.0", "1.0" ),
"2211 徐步"=>
	array( "1.0", "1.0" ),
"2215 寒食"=>
	array( "1.0", "1.0" ),
"2219 江畔獨步尋花七絕句"=>
	array( "1.0", "1.0" ),
"2232 絕句漫興九首"=>
	array( "1.0", "1.0" ),
"2256 少年行二首"=>
	array( "1.0", "1.0" ),
"2263 江漲"=>
	array( "1.0", "1.0" ),
"2266 石鏡"=>
	array( "1.0", "1.0" ),
"2270 琴臺"=>
	array( "1.0", "1.0" ),
"2277 朝雨"=>
	array( "1.0", "1.0" ),
"2281 晚晴"=>
	array( "1.0", "1.0" ),
"2286 高柟"=>
	array( "1.0", "1.0" ),
"2289 惡樹"=>
	array( "1.0", "1.0" ),
"2294 進艇"=>
	array( "1.0", "1.0" ),
"2300 一室"=>
	array( "1.0", "1.0" ),
"2306 所思"=>
	array( "1.0", "1.0" ),
"2311 聞斛斯六官未歸"=>
	array( "1.0", "1.0" ),
"2318 送裴五赴東川"=>
	array( "1.0", "1.0" ),
"2321 贈虞十五司馬"=>
	array( "1.0", "1.0" ),
"2326 徐卿二子歌"=>
	array( "1.0", "1.0" ),
"2329 戲作花卿歌"=>
	array( "1.0", "1.0" ),
"2335 贈花卿"=>
	array( "1.0", "1.0" ),
"2339 柟樹爲風雨所拔歎"=>
	array( "1.0", "1.0" ),
"2345 茅屋爲秋風所破歌"=>
	array( "1.0", "1.0" ),
"2353 百憂集行"=>
	array( "1.0", "1.0" ),
"2358 病柏"=>
	array( "1.190", "3.16" ),
"2364 病橘"=>
	array( "1.191", "3.17" ),
"2371 枯椶"=>
	array( "1.192", "3.17" ),
"2377 枯柟"=>
	array( "1.192", "3.18" ),
"2383 赴青城縣出成都寄陶、王二少尹"=>
	array( "1.0", "1.0" ),
"2389 野望因過常少仙"=>
	array( "1.0", "1.0" ),
"2393 丈人山"=>
	array( "1.0", "1.0" ),
"2395 逢唐興劉主簿弟"=>
	array( "1.0", "1.0" ),
"2398 敬簡王明府"=>
	array( "1.0", "1.0" ),
"2402 重簡王明府"=>
	array( "1.0", "1.0" ),
"2405 寄杜位"=>
	array( "1.0", "1.0" ),
"2410 送韓十四江東覲省"=>
	array( "1.0", "1.0" ),
"2417 不見"=>
	array( "1.0", "1.0" ),
"2424 草堂卽事"=>
	array( "1.0", "1.0" ),
"2429 徐九少尹見過"=>
	array( "1.0", "1.0" ),
"2432 范二員外邈、吳十侍御郁特枉駕闕展待，聊寄此"=>
	array( "1.0", "1.0" ),
"2435 王十七侍御掄許攜酒至草堂，奉寄此詩，便請邀高三十五使君同到"=>
	array( "1.0", "1.0" ),
"2442 王竟攜酒，高亦同過，共用寒字"=>
	array( "1.0", "1.0" ),
"2445 陪李七司馬皂江上觀造竹橋，卽日成，往來之人免冬寒入水，聊題短作，簡李公二首"=>
	array( "1.0", "1.0" ),
"2453 李司馬橋了，承高使君自成都回"=>
	array( "1.0", "1.0" ),
"2454 野望"=>
	array( "1.0", "1.0" ),
"2460 入奏行"=>
	array( "1.0", "1.0" ),
"2472 廣州段功曹到，得楊五長史譚書，功曹卻歸，聊寄此詩"=>
	array( "1.0", "1.0" ),
"2476 得廣州張判官叔卿書，使還，以詩代意"=>
	array( "1.0", "1.0" ),
"2480 送段功曹歸廣州"=>
	array( "1.0", "1.0" ),
"2484 魏十四侍御就弊廬相別"=>
	array( "1.0", "1.0" ),
"2487 贈別何邕"=>
	array( "1.0", "1.0" ),
"2493 贈別鄭鍊赴襄陽"=>
	array( "1.0", "1.0" ),
"2497 重贈鄭絕句"=>
	array( "1.0", "1.0" ),
"2501 戲爲六絕句"=>
	array( "1.0", "1.0" ),
"2516 江頭五詠"=>array(
	array( "1.193", "3.18" ),
	array( "1.194", "3.18" ),
	array( "2.99", "6.72" ),
	array( "2.100", "6.72" ),
	array( "2.100", "6.73" ) ),
"2527 畏人"=>
	array( "1.0", "1.0" ),
"2530 屏跡三首"=>
	array( "1.194", "3.19" ),
"2537 少年行"=>
	array( "1.0", "1.0" ),
"2539 絕句"=>
	array( "1.0", "1.0" ),
"2541 卽事"=>
	array( "1.0", "1.0" ),
"2542 奉酬嚴公寄題野亭之作"=>
	array( "1.0", "1.0" ),
"2548 嚴中丞枉駕見過"=>
	array( "1.0", "1.0" ),
"2552 遭田父泥飲美嚴中丞"=>
	array( "1.195", "3.19" ),
"2560 奉和嚴中丞西城晚眺十韻"=>
	array( "1.0", "1.0" ),
"2565 中丞嚴公雨中垂寄見憶一絕，奉答二絕"=>
	array( "1.0", "1.0" ),
"2568 謝嚴中丞送青城山道士乳酒一瓶"=>
	array( "1.0", "1.0" ),
"2570 三絕句"=>
	array( "1.0", "1.0" ),
"2576 野人送朱櫻"=>
	array( "1.0", "1.0" ),
"2582 嚴公仲夏枉駕草堂，兼攜酒饌"=>
	array( "1.0", "1.0" ),
"2588 嚴公廳宴同詠蜀道畫圖"=>
	array( "1.0", "1.0" ),
"2591 戲贈友二首"=>
	array( "1.196", "3.20" ),
"2594 大雨"=>
	array( "1.196", "3.20" ),
"2598 溪漲"=>
	array( "1.197", "3.21" ),
"2600 大麥行"=>
	array( "1.0", "1.0" ),
"2603 奉送嚴公入朝十韻"=>
	array( "1.0", "1.0" ),
"2608 送嚴侍郎到綿州同登杜使君江樓"=>
	array( "1.0", "1.0" ),
"2613 奉濟驛重送嚴公四韻"=>
	array( "1.0", "1.0" ),
"2615 送梓州李使君之任"=>
	array( "1.0", "1.0" ),
"2621 觀打魚歌"=>
	array( "1.0", "1.0" ),
"2624 又觀打魚"=>
	array( "1.0", "1.0" ),
"2628 越王樓歌"=>
	array( "1.0", "1.0" ),
"2631 海棕行"=>
	array( "1.0", "1.0" ),
"2633 姜楚公畫角鷹歌"=>
	array( "1.0", "1.0" ),
"2636 東津送韋諷攝閬州錄事"=>
	array( "1.0", "1.0" ),
"2639 光祿坂行"=>
	array( "1.0", "1.0" ),
"2641 苦戰行"=>
	array( "1.0", "1.0" ),
"2643 去秋行"=>
	array( "1.0", "1.0" ),
"2647 宗武生日"=>
	array( "1.0", "1.0" ),
"2651 寄高適"=>
	array( "1.0", "1.0" ),
"2654 題玄武禪師屋壁"=>
	array( "1.0", "1.0" ),
"2658 悲秋"=>
	array( "1.0", "1.0" ),
"2661 客夜"=>
	array( "1.0", "1.0" ),
"2664 客亭"=>
	array( "1.0", "1.0" ),
"2667 九日登梓州城"=>
	array( "1.0", "1.0" ),
"2670 九日奉寄嚴大夫"=>
	array( "1.0", "1.0" ),
"2674 戲題寄上漢中王三首"=>
	array( "1.0", "1.0" ),
"2681 玩月呈漢中王"=>
	array( "1.0", "1.0" ),
"2685 相從歌"=>
	array( "1.0", "1.0" ),
"2690 秋盡"=>
	array( "1.0", "1.0" ),
"2694 野望"=>
	array( "1.0", "1.0" ),
"2698 冬到金華山觀因得故拾遺陳公學堂遺迹"=>
	array( "1.198", "3.21" ),
"2703 陳拾遺故宅"=>
	array( "1.198", "3.22" ),
"2707 謁文公上方"=>
	array( "1.199", "3.22" ),
"2713 奉贈射洪李四丈"=>
	array( "1.200", "3.23" ),
"2716 早發射洪縣南途中作"=>
	array( "1.201", "3.23" ),
"2720 通泉驛南去通泉縣十五里山水作"=>
	array( "1.201", "3.24" ),
"2723 過郭代公故宅"=>
	array( "1.202", "3.24" ),
"2728 觀薛稷少保書畫壁"=>
	array( "1.202", "3.25" ),
"2733 通泉縣署屋壁後薛少保畫鶴"=>
	array( "1.203", "3.25" ),
"2737 陪王侍御宴通泉山野亭"=>
	array( "1.0", "1.0" ),
"2739 陪王侍御同登東山最高頂，宴姚通泉，晚擕酒泛江"=>
	array( "1.0", "1.0" ),
"2743 漁陽"=>
	array( "1.0", "1.0" ),
"2747 聞官軍收河南河北"=>
	array( "1.0", "1.0" ),
"2753 遠遊"=>
	array( "1.0", "1.0" ),
"2755 春日梓州登樓二首"=>
	array( "1.0", "1.0" ),
"2759 春日戲題惱郝使君兄"=>
	array( "1.0", "1.0" ),
"2761 花底"=>
	array( "1.0", "1.0" ),
"2764 柳邊"=>
	array( "1.0", "1.0" ),
"2766 奉送崔都水翁下峽"=>
	array( "1.0", "1.0" ),
"2769 郪城西原送李判官兄、武判官弟赴成都府"=>
	array( "1.0", "1.0" ),
"2771 涪城縣香積寺官閣"=>
	array( "1.0", "1.0" ),
"2774 涪江泛舟送韋班歸京"=>
	array( "1.0", "1.0" ),
"2776 泛江送魏十八倉曹還京，因寄岑中允參、范郎中季明"=>
	array( "1.0", "1.0" ),
"2779 送路六侍御入朝"=>
	array( "1.0", "1.0" ),
"2782 泛江送客"=>
	array( "1.0", "1.0" ),
"2784 上牛頭寺"=>
	array( "1.0", "1.0" ),
"2786 望牛頭寺"=>
	array( "1.0", "1.0" ),
"2789 登牛頭山亭子"=>
	array( "1.0", "1.0" ),
"2791 上兜率寺"=>
	array( "1.0", "1.0" ),
"2795 望兜率寺"=>
	array( "1.0", "1.0" ),
"2798 甘園"=>
	array( "1.0", "1.0" ),
"2800 陪李梓州、王閬州、蘇遂州、李果州四使君登惠義寺"=>
	array( "1.0", "1.0" ),
"2803 數陪李梓州泛江，有女樂在諸舫，戲爲豔曲二首贈李"=>
	array( "1.0", "1.0" ),
"2808 送何侍御歸朝"=>
	array( "1.0", "1.0" ),
"2810 行次鹽亭縣，聊題四韻，奉簡嚴遂州、蓬州兩使君、咨議諸昆季"=>
	array( "1.0", "1.0" ),
"2814 倚杖"=>
	array( "1.0", "1.0" ),
"2817 惠義寺送王少尹赴成都"=>
	array( "1.0", "1.0" ),
"2819 惠義寺園送辛員外"=>
	array( "1.0", "1.0" ),
"2820 又送"=>
	array( "1.0", "1.0" ),
"2823 巴西驛亭觀江漲呈竇使君二首"=>
	array( "1.0", "1.0" ),
"2828 又呈竇使君"=>
	array( "1.0", "1.0" ),
"2830 陪王漢州留杜綿州泛房公西湖"=>
	array( "1.0", "1.0" ),
"2834 得房公池鵝"=>
	array( "1.0", "1.0" ),
"2835 答楊梓州"=>
	array( "1.0", "1.0" ),
"2837 舟前小鵝兒"=>
	array( "1.0", "1.0" ),
"2840 官池春雁二首"=>
	array( "1.0", "1.0" ),
"2843 投簡梓州幕府兼簡韋十郎官"=>
	array( "1.0", "1.0" ),
"2845 漢州王大錄事宅作"=>
	array( "1.0", "1.0" ),
"2846 喜雨"=>
	array( "1.0", "1.0" ),
"2850 贈韋贊善別"=>
	array( "1.0", "1.0" ),
"2852 短歌行"=>
	array( "1.0", "1.0" ),
"2854 送韋郎司直歸成都"=>
	array( "1.0", "1.0" ),
"2856 寄題江外草堂"=>
	array( "1.204", "3.26" ),
"2862 述古三首"=>
	array( "1.205", "3.27" ),
"2870 送王十五判官扶侍還黔中"=>
	array( "1.0", "1.0" ),
"2875 陪章留後惠義寺餞嘉州崔都督赴州"=>
	array( "1.0", "1.0" ),
"2879 陪章留後侍御宴南樓"=>
	array( "1.0", "1.0" ),
"2884 臺上"=>
	array( "1.0", "1.0" ),
"2886 椶拂子"=>
	array( "1.206", "3.28" ),
"2890 章梓州橘亭餞成都竇少尹"=>
	array( "1.0", "1.0" ),
"2893 章梓州水亭"=>
	array( "1.0", "1.0" ),
"2896 隨章留後新亭會送諸君"=>
	array( "1.0", "1.0" ),
"2899 戲作寄上漢中王二首"=>
	array( "1.0", "1.0" ),
"2902 客舊館"=>
	array( "1.0", "1.0" ),
"2905 送陵州路使君赴任"=>
	array( "1.0", "1.0" ),
"2909 送元二適江左"=>
	array( "1.0", "1.0" ),
"2913 送竇九歸成都"=>
	array( "1.0", "1.0" ),
"2915 九日"=>
	array( "1.0", "1.0" ),
"2917 題郪縣郭三十二明府茅屋壁"=>
	array( "1.0", "1.0" ),
"2920 倦夜"=>
	array( "1.0", "1.0" ),
"2923 薄暮"=>
	array( "1.0", "1.0" ),
"2925 南池"=>
	array( "1.210", "3.32" ),
"2930 閬州奉送二十四舅使自京赴任青城"=>
	array( "1.0", "1.0" ),
"2932 王閬州筵奉酬十一舅惜別之作"=>
	array( "1.0", "1.0" ),
"2935 閬州東樓筵奉送十一舅往青城縣"=>
	array( "1.207", "3.28" ),
"2939 放船"=>
	array( "1.0", "1.0" ),
"2942 薄遊"=>
	array( "1.0", "1.0" ),
"2945 嚴氏溪放歌行"=>
	array( "1.0", "1.0" ),
"2949 與嚴二歸奉禮別"=>
	array( "1.0", "1.0" ),
"2952 贈裴南部"=>
	array( "1.0", "1.0" ),
"2955 對雨"=>
	array( "1.0", "1.0" ),
"2958 愁坐"=>
	array( "1.0", "1.0" ),
"2960 警急"=>
	array( "1.0", "1.0" ),
"2963 王命"=>
	array( "1.0", "1.0" ),
"2967 征夫"=>
	array( "1.0", "1.0" ),
"2969 西山三首"=>
	array( "1.0", "1.0" ),
"2976 遣憂"=>
	array( "1.0", "1.0" ),
"2979 巴山"=>
	array( "1.0", "1.0" ),
"2982 江陵望幸"=>
	array( "1.0", "1.0" ),
"2986 發閬中"=>
	array( "1.0", "1.0" ),
"2988 冬狩行"=>
	array( "1.0", "1.0" ),
"2994 山寺"=>
	array( "1.207", "3.28" ),
"3000 桃竹杖引"=>
	array( "1.0", "1.0" ),
"3005 將適吳楚，留別章使君留後兼幕府諸公，得柳字"=>
	array( "1.208", "3.29" ),
"3011 舍弟占歸草堂檢校，聊示此詩"=>
	array( "1.0", "1.0" ),
"3014 早花"=>
	array( "1.0", "1.0" ),
"3016 歲暮"=>
	array( "1.0", "1.0" ),
"3018 天邊行"=>
	array( "1.0", "1.0" ),
"3021 奉寄別馬巴州"=>
	array( "1.0", "1.0" ),
"3025 送李卿曄"=>
	array( "1.0", "1.0" ),
"3028 城上"=>
	array( "1.0", "1.0" ),
"3030 雙燕"=>
	array( "1.0", "1.0" ),
"3033 百舌"=>
	array( "1.0", "1.0" ),
"3036 傷春五首"=>
	array( "1.0", "1.0" ),
"3049 收京"=>
	array( "1.0", "1.0" ),
"3052 巴西聞收京，送班司馬入京二首"=>
	array( "1.0", "1.0" ),
"3056 釋悶"=>
	array( "1.0", "1.0" ),
"3059 有感五首"=>
	array( "1.0", "1.0" ),
"3074 閬山歌"=>
	array( "1.0", "1.0" ),
"3077 閬水歌"=>
	array( "1.0", "1.0" ),
"3079 陪王使君晦日泛江就黃家亭子二首"=>
	array( "1.0", "1.0" ),
"3083 江亭王閬州筵餞蕭遂州"=>
	array( "1.0", "1.0" ),
"3086 江亭送眉州辛別駕昇之"=>
	array( "1.0", "1.0" ),
"3088 贈別賀蘭銛"=>
	array( "1.209", "3.31" ),
"3092 泛江"=>
	array( "1.0", "1.0" ),
"3093 渡江"=>
	array( "1.0", "1.0" ),
"3095 暮寒"=>
	array( "1.0", "1.0" ),
"3097 遊子"=>
	array( "1.0", "1.0" ),
"3099 滕王亭子二首"=>
	array( "1.0", "1.0" ),
"3104 玉臺觀二首"=>
	array( "1.0", "1.0" ),
"3110 奉寄章十侍御"=>
	array( "1.0", "1.0" ),
"3114 奉待嚴大夫"=>
	array( "1.0", "1.0" ),
"3117 自閬州領妻子卻赴蜀山行三首"=>
	array( "1.0", "1.0" ),
"3122 别房太尉墓"=>
	array( "1.0", "1.0" ),
"3124 將赴成都草堂，途中有作，先寄嚴鄭公五首"=>
	array( "1.0", "1.0" ),
"3135 春歸"=>
	array( "1.0", "1.0" ),
"3138 歸來"=>
	array( "1.0", "1.0" ),
"3141 草堂"=>
	array( "1.211", "3.32" ),
"3148 題桃樹"=>
	array( "1.0", "1.0" ),
"3151 四松"=>
	array( "1.212", "3.33" ),
"3155 水檻"=>
	array( "1.213", "3.34" ),
"3158 破船"=>
	array( "1.213", "3.34" ),
"3160 過南鄰朱山人水亭"=>
	array( "1.0", "1.0" ),
"3162 登樓"=>
	array( "1.0", "1.0" ),
"3168 奉寄高常侍"=>
	array( "1.0", "1.0" ),
"3172 寄卭州崔錄事"=>
	array( "1.0", "1.0" ),
"3174 王錄事許修草堂貲不到聊小詰"=>
	array( "1.0", "1.0" ),
"3175 歸雁"=>
	array( "1.0", "1.0" ),
"3177 絕句二首"=>
	array( "1.0", "1.0" ),
"3179 寄司馬山人十二韻"=>
	array( "1.0", "1.0" ),
"3183 贈王二十四侍御契四十韻"=>
	array( "1.0", "1.0" ),
"3197 黃河二首"=>
	array( "1.0", "1.0" ),
"3200 丹青引"=>
	array( "1.0", "1.0" ),
"3207 韋諷錄事宅觀曹將軍畫馬圖"=>
	array( "1.0", "1.0" ),
"3214 送韋諷上閬州錄事參軍"=>
	array( "1.214", "3.35" ),
"3218 絕句六首"=>
	array( "1.0", "1.0" ),
"3224 絕句四首"=>
	array( "1.0", "1.0" ),
"3229 揚旗"=>
	array( "1.214", "3.34" ),
"3234 軍中醉歌寄沈八劉叟"=>
	array( "1.0", "1.0" ),
"3236 憶昔二首"=>
	array( "1.0", "1.0" ),
"3245 過故斛斯校書莊二首"=>
	array( "1.0", "1.0" ),
"3249 太子張舍人遺織成褥段"=>
	array( "1.215", "3.35" ),
"3256 立秋日雨院中有作"=>
	array( "1.0", "1.0" ),
"3258 寄董卿嘉榮十韻"=>
	array( "1.0", "1.0" ),
"3263 奉和軍城早秋"=>
	array( "1.0", "1.0" ),
"3266 院中晚晴懷西郭茅舍"=>
	array( "1.0", "1.0" ),
"3268 到村"=>
	array( "1.0", "1.0" ),
"3271 村雨"=>
	array( "1.0", "1.0" ),
"3273 宿府"=>
	array( "1.0", "1.0" ),
"3276 遣悶奉呈嚴鄭公二十韻"=>
	array( "1.0", "1.0" ),
"3283 嚴鄭公階下新松"=>
	array( "1.0", "1.0" ),
"3285 嚴鄭公宅同詠竹"=>
	array( "1.0", "1.0" ),
"3287 晚秋陪嚴鄭公摩訶池泛舟"=>
	array( "1.0", "1.0" ),
"3290 陪鄭公秋晚北池臨眺"=>
	array( "1.0", "1.0" ),
"3293 奉觀嚴鄭公廳事岷山沲江畫圖十韻"=>
	array( "1.0", "1.0" ),
"3299 送舍弟穎赴齊州三首"=>
	array( "1.0", "1.0" ),
"3304 別唐十五誡，因寄禮部賈侍郎"=>
	array( "1.216", "3.36" ),
"3310 懷舊"=>
	array( "1.0", "1.0" ),
"3312 哭台州鄭司戶蘇少監"=>
	array( "1.0", "1.0" ),
"3319 初冬"=>
	array( "1.0", "1.0" ),
"3322 觀李固請司馬弟山水圖三首"=>
	array( "1.0", "1.0" ),
"3328 至後"=>
	array( "1.0", "1.0" ),
"3331 送王侍御往東川放生池祖席"=>
	array( "1.0", "1.0" ),
"3333 寄賀蘭銛"=>
	array( "1.0", "1.0" ),
"3337 正月三日歸溪上有作，簡院內諸公"=>
	array( "1.0", "1.0" ),
"3339 敝廬遣興奉寄嚴公"=>
	array( "1.0", "1.0" ),
"3342 除草"=>
	array( "1.217", "3.37" ),
"3346 春日江村五首"=>
	array( "1.0", "1.0" ),
"3358 春遠"=>
	array( "1.0", "1.0" ),
"3361 絕句三首"=>
	array( "1.0", "1.0" ),
"3365 營屋"=>
	array( "1.218", "3.37" ),
"3368 喜雨"=>
	array( "1.204", "3.26" ),
"3370 長吟"=>
	array( "1.0", "1.0" ),
"3373 莫相疑行"=>
	array( "1.0", "1.0" ),
"3377 赤霄行"=>
	array( "1.0", "1.0" ),
"3381 三韻三篇"=>
	array( "1.218", "3.38" ),
"3386 寄贈王十將軍承俊"=>
	array( "1.0", "1.0" ),
"3390 去蜀"=>
	array( "1.0", "1.0" ),
"3393 宿青溪驛，奉懷張員外十五兄之緒"=>
	array( "1.219", "3.38" ),
"3396 狂歌行贈四兄"=>
	array( "1.0", "1.0" ),
"3401 宴戎州楊使君東樓"=>
	array( "1.0", "1.0" ),
"3405 渝州候嚴六侍御不到先下峽"=>
	array( "1.0", "1.0" ),
"3408 撥悶"=>
	array( "1.0", "1.0" ),
"3412 宴忠州使君姪宅"=>
	array( "1.0", "1.0" ),
"3415 禹廟"=>
	array( "1.0", "1.0" ),
"3419 題忠州龍興寺所居院壁"=>
	array( "1.0", "1.0" ),
"3422 哭嚴僕射歸櫬"=>
	array( "1.0", "1.0" ),
"3425 聞高常侍亡"=>
	array( "1.0", "1.0" ),
"3428 旅夜書懷"=>
	array( "1.0", "1.0" ),
"3433 放船"=>
	array( "1.0", "1.0" ),
"3436 雲安九日鄭十八攜酒陪諸公宴"=>
	array( "1.0", "1.0" ),
"3438 答鄭十七郎一絕"=>
	array( "1.0", "1.0" ),
"3440 別常徵君"=>
	array( "1.0", "1.0" ),
"3442 長江二首"=>
	array( "1.0", "1.0" ),
"3447 承聞故房相公靈櫬，自閬州啓殯歸葬東都，有作二首"=>
	array( "1.0", "1.0" ),
"3454 將曉二首"=>
	array( "1.0", "1.0" ),
"3459 懷錦水居止二首"=>
	array( "1.0", "1.0" ),
"3463 青絲"=>
	array( "1.0", "1.0" ),
"3466 三絕句"=>
	array( "1.0", "1.0" ),
"3470 遣憤"=>
	array( "1.0", "1.0" ),
"3473 十二月一日三首"=>
	array( "1.0", "1.0" ),
"3480 又雪"=>
	array( "1.0", "1.0" ),
"3483 雨"=>
	array( "1.0", "1.0" ),
"3485 南楚"=>
	array( "1.0", "1.0" ),
"3488 水閣朝霽，奉簡嚴雲安"=>
	array( "1.219", "3.39" ),
"3491 杜鵑"=>
	array( "1.219", "3.39" ),
"3498 子規"=>
	array( "1.0", "1.0" ),
"3502 近聞"=>
	array( "1.0", "1.0" ),
"3504 客居"=>
	array( "1.223", "3.42" ),
"3511 贈鄭十八賁"=>
	array( "1.221", "3.40" ),
"3516 別蔡十四著作"=>
	array( "1.222", "3.41" ),
"3521 寄常徵君"=>
	array( "1.0", "1.0" ),
"3525 寄岑嘉州"=>
	array( "1.0", "1.0" ),
"3529 移居夔州郭"=>
	array( "1.0", "1.0" ),
"3531 船下夔州郭宿，雨濕不得上岸，別王十二判官"=>
	array( "1.0", "1.0" ),
"3535 漫成一絕"=>
	array( "1.0", "1.0" ),
"3537 客堂"=>
	array( "1.224", "3.42" ),
"3544 引水"=>
	array( "1.0", "1.0" ),
"3546 示獠奴阿段"=>
	array( "1.0", "1.0" ),
"3550 寄韋有夏郎中"=>
	array( "1.0", "1.0" ),
"3553 上白帝城"=>
	array( "1.0", "1.0" ),
"3556 上白帝城二首"=>
	array( "1.0", "1.0" ),
"3561 陪諸公上白帝城頭宴越公堂之作"=>
	array( "1.0", "1.0" ),
"3564 白帝城最高樓"=>
	array( "1.0", "1.0" ),
"3569 武侯廟"=>
	array( "1.0", "1.0" ),
"3572 八陣圖"=>
	array( "1.0", "1.0" ),
"3575 古栢行"=>
	array( "1.0", "1.0" ),
"3583 負薪行"=>
	array( "1.0", "1.0" ),
"3587 最能行"=>
	array( "1.0", "1.0" ),
"3591 覽物"=>
	array( "1.0", "1.0" ),
"3595 憶鄭南"=>
	array( "1.0", "1.0" ),
"3598 贈崔十三評事公輔"=>
	array( "1.0", "1.0" ),
"3607 奉寄李十五秘書二首"=>
	array( "1.0", "1.0" ),
"3612 貽華陽柳少府"=>
	array( "1.229", "3.46" ),
"3619 雷"=>
	array( "1.226", "3.44" ),
"3626 熱三首"=>
	array( "1.0", "1.0" ),
"3633 七月三日亭午已後，校熱退，晚加小涼，穩睡有詩，因論壯年樂事，戲呈元二十一曹長"=>
	array( "1.230", "3.47" ),
"3643 火"=>
	array( "1.227", "3.45" ),
"3649 牽牛織女"=>
	array( "1.232", "3.48" ),
"3658 毒熱寄簡崔評事十六弟"=>
	array( "1.229", "3.46" ),
"3664 信行遠脩水筒"=>
	array( "1.233", "3.49" ),
"3670 催宗文樹雞柵"=>
	array( "1.235", "3.50" ),
"3678 驅竪子摘蒼耳"=>
	array( "1.234", "3.50" ),
"3683 雨"=>
	array( "1.236", "3.51" ),
"3686 種萵苣"=>
	array( "1.237", "3.52" ),
"3694 雨"=>
	array( "1.236", "3.51" ),
"3698 雨"=>
	array( "1.0", "1.0" ),
"3702 雨二首"=>
	array( "1.238", "3.53" ),
"3708 雨不絕"=>
	array( "1.0", "1.0" ),
"3712 晚晴"=>
	array( "1.0", "1.0" ),
"3714 殿中楊監見示張旭草書圖"=>
	array( "1.239", "3.54" ),
"3718 楊監又出畫鷹十二扇"=>
	array( "1.240", "3.54" ),
"3721 送殿中楊監赴蜀見相公"=>
	array( "1.0", "1.0" ),
"3726 贈李十五丈別"=>
	array( "1.241", "3.55" ),
"3734 白鹽山"=>
	array( "1.0", "1.0" ),
"3737 灩澦堆"=>
	array( "1.0", "1.0" ),
"3740 白帝"=>
	array( "1.0", "1.0" ),
"3743 黃草"=>
	array( "1.0", "1.0" ),
"3747 夔州歌十絕句"=>
	array( "1.0", "1.0" ),
"3763 諸將五首"=>
	array( "1.0", "1.0" ),
"3785 夜"=>
	array( "1.0", "1.0" ),
"3789 秋興八首"=>
	array( "1.0", "1.0" ),
"3841 詠懷古跡五首"=>
	array( "1.0", "1.0" ),
"3863 聽楊氏歌"=>
	array( "1.0", "1.0" ),
"3867 宿江邊閣"=>
	array( "1.0", "1.0" ),
"3870 西閣雨望"=>
	array( "1.0", "1.0" ),
"3873 西閣二首"=>
	array( "1.0", "1.0" ),
"3879 西閣夜"=>
	array( "1.0", "1.0" ),
"3881 西閣三度期大昌嚴明府同宿不到"=>
	array( "1.0", "1.0" ),
"3885 覆舟二首"=>
	array( "1.0", "1.0" ),
"3890 奉漢中王手札"=>
	array( "1.0", "1.0" ),
"3896 奉漢中王手札報韋侍御蕭尊師亡"=>
	array( "1.0", "1.0" ),
"3899 存殁口號二首"=>
	array( "1.0", "1.0" ),
"3904 月圓"=>
	array( "1.0", "1.0" ),
"3906 中宵"=>
	array( "1.0", "1.0" ),
"3910 不寐"=>
	array( "1.0", "1.0" ),
"3912 遠遊"=>
	array( "1.0", "1.0" ),
"3915 垂白"=>
	array( "1.0", "1.0" ),
"3918 雨晴"=>
	array( "1.0", "1.0" ),
"3921 搖落"=>
	array( "1.0", "1.0" ),
"3924 草閣"=>
	array( "1.0", "1.0" ),
"3927 江月"=>
	array( "1.0", "1.0" ),
"3930 江上"=>
	array( "1.0", "1.0" ),
"3933 中夜"=>
	array( "1.0", "1.0" ),
"3935 遣愁"=>
	array( "1.0", "1.0" ),
"3937 九日諸人集于林"=>
	array( "1.0", "1.0" ),
"3940 返照"=>
	array( "1.0", "1.0" ),
"3943 吹笛"=>
	array( "1.0", "1.0" ),
"3947 秋日寄題鄭監湖上亭三首"=>
	array( "1.0", "1.0" ),
"3955 八哀詩"=>
	array( "1.242", "4.3" ),
"4083 壯遊"=>
	array( "1.258", "4.15" ),
"4110 昔遊"=>
	array( "1.262", "4.17" ),
"4119 遣懷"=>
	array( "1.263", "4.18" ),
"4129 往在"=>
	array( "1.264", "4.19" ),
"4145 謁先主廟"=>
	array( "1.0", "1.0" ),
"4161 夔府書懷"=>
	array( "1.0", "1.0" ),
"4180 送李功曹之荊州充鄭侍御判官重贈"=>
	array( "1.0", "1.0" ),
"4184 哭王彭州掄"=>
	array( "1.0", "1.0" ),
"4194 偶題"=>
	array( "1.0", "1.0" ),
"4209 贈高式顔"=>
	array( "1.0", "1.0" ),
"4213 李潮八分小篆歌"=>
	array( "1.0", "1.0" ),
"4224 峽口二首"=>
	array( "1.0", "1.0" ),
"4231 南極"=>
	array( "1.0", "1.0" ),
"4235 送王十六判官"=>
	array( "1.0", "1.0" ),
"4239 瞿唐兩崖"=>
	array( "1.0", "1.0" ),
"4244 瞿唐懷古"=>
	array( "1.0", "1.0" ),
"4248 夜宿西閣，曉呈元二十一曹長"=>
	array( "1.0", "1.0" ),
"4253 西閣口號曉呈元二十一"=>
	array( "1.0", "1.0" ),
"4256 閣夜"=>
	array( "1.0", "1.0" ),
"4268 瀼西寒望"=>
	array( "1.0", "1.0" ),
"4272 白帝樓"=>
	array( "1.0", "1.0" ),
"4275 白帝城樓"=>
	array( "1.0", "1.0" ),
"4278 西閣曝日"=>
	array( "1.0", "1.0" ),
"4282 不離西閣二首"=>
	array( "1.0", "1.0" ),
"4291 覽柏中允兼子姪數人除官制詞，因述父子兄弟四美，載歌絲綸"=>
	array( "1.0", "1.0" ),
"4299 覽鏡呈柏中丞"=>
	array( "1.0", "1.0" ),
"4303 陪柏中丞觀宴將士二首"=>
	array( "1.0", "1.0" ),
"4310 奉送蜀州柏二別駕將中丞命，赴江陵起居衛尚書太夫人，因示從弟行軍司馬位"=>
	array( "1.0", "1.0" ),
"4318 荊南兵馬使太常卿趙公大食刀歌"=>
	array( "1.0", "1.0" ),
"4328 王兵馬使二角鷹"=>
	array( "1.0", "1.0" ),
"4337 見王監兵馬使說，近山有白黑二鷹，羅者久取，竟未能得。王以爲毛骨有異他鷹，恐臘後春生，鶱飛避暖，勁翮思秋之甚，眇不可見，請余賦詩二首"=>
	array( "1.0", "1.0" ),
"4350 縛雞行"=>
	array( "1.0", "1.0" ),
"4355 折檻行"=>
	array( "1.0", "1.0" ),
"4361 立春"=>
	array( "1.0", "1.0" ),
"4367 江梅"=>
	array( "1.0", "1.0" ),
"4371 庭草"=>
	array( "1.0", "1.0" ),
"4373 曉望白帝城鹽山"=>
	array( "1.0", "1.0" ),
"4377 王十五前閣會"=>
	array( "1.0", "1.0" ),
"4379 老病"=>
	array( "1.0", "1.0" ),
"4382 崔評事弟許相迎不到，應慮老夫見泥雨怯出，必愆佳期，走筆戲簡"=>
	array( "1.0", "1.0" ),
"4387 愁"=>
	array( "1.0", "1.0" ),
"4393 晝夢"=>
	array( "1.0", "1.0" ),
"4397 遣悶戲呈路十九曹長"=>
	array( "1.0", "1.0" ),
"4404 晴二首"=>
	array( "1.0", "1.0" ),
"4410 雨"=>
	array( "1.0", "1.0" ),
"4413 懷㶚上遊"=>
	array( "1.0", "1.0" ),
"4416 晨雨"=>
	array( "1.0", "1.0" ),
"4420 入宅三首"=>
	array( "1.0", "1.0" ),
"4428 赤甲"=>
	array( "1.0", "1.0" ),
"4433 暮春"=>
	array( "1.0", "1.0" ),
"4438 卽事"=>
	array( "1.0", "1.0" ),
"4442 卜居"=>
	array( "1.0", "1.0" ),
"4446 暮春題瀼西新賃草屋五首"=>
	array( "1.0", "1.0" ),
"4462 江雨有懷鄭典設"=>
	array( "1.0", "1.0" ),
"4466 熟食日示宗文宗武"=>
	array( "1.0", "1.0" ),
"4470 又示兩兒"=>
	array( "1.0", "1.0" ),
"4474 得舍弟觀書，自中都已達江陵。今茲暮春月末，行李合到夔州，悲喜相兼，團圓可待，賦詩卽事，情見乎詞"=>
	array( "1.0", "1.0" ),
"4477 喜觀卽到，復題短篇二首"=>
	array( "1.0", "1.0" ),
"4486 送惠二歸故居"=>
	array( "1.0", "1.0" ),
"4489 寄薛三郎中"=>
	array( "1.0", "1.0" ),
"4496 晚登瀼上堂"=>
	array( "1.0", "1.0" ),
"4501 醉爲馬墜，羣公攜酒相看"=>
	array( "1.0", "1.0" ),
"4507 承聞河北諸道節度入朝歡喜口號絕句十二首"=>
	array( "1.0", "1.0" ),
"4533 過客相尋"=>
	array( "1.0", "1.0" ),
"4536 竪子至"=>
	array( "1.0", "1.0" ),
"4540 園"=>
	array( "1.0", "1.0" ),
"4543 歸"=>
	array( "1.0", "1.0" ),
"4546 園官送菜"=>
	array( "1.0", "1.0" ),
"4551 園人送瓜"=>
	array( "1.0", "1.0" ),
"4556 課伐木"=>
	array( "1.225", "3.43" ),
"4566 柴門"=>
	array( "1.0", "1.0" ),
"4573 槐葉冷淘"=>
	array( "1.0", "1.0" ),
"4578 上後園山腳"=>
	array( "1.0", "1.0" ),
"4584 奉送王信州崟北歸"=>
	array( "1.0", "1.0" ),
"4593 月三首"=>
	array( "1.0", "1.0" ),
"4604 送十五弟侍御使蜀"=>
	array( "1.0", "1.0" ),
"4607 舍弟觀歸藍田迎新婦，送示兩篇"=>
	array( "1.0", "1.0" ),
"4614 季夏送鄉弟韶陪黃門從叔朝謁"=>
	array( "1.0", "1.0" ),
"4620 灩澦"=>
	array( "1.0", "1.0" ),
"4627 行官張望補稻畦水歸"=>
	array( "1.0", "1.0" ),
"4634 七月一日題終明府水樓二首"=>
	array( "1.0", "1.0" ),
"4644 秋行官張望督促東渚耗稻向畢，清晨遣女奴阿稽、豎子阿段往問"=>
	array( "1.0", "1.0" ),
"4653 阻雨不得歸瀼西甘林"=>
	array( "1.0", "1.0" ),
"4659 又上後園山腳"=>
	array( "1.0", "1.0" ),
"4667 甘林"=>
	array( "1.0", "1.0" ),
"4673 暇日小園散病，將種秋菜，督勒耕牛，兼書觸目"=>
	array( "1.0", "1.0" ),
"4679 雨"=>
	array( "1.0", "1.0" ),
"4686 秋風二首"=>
	array( "1.0", "1.0" ),
"4692 見螢火"=>
	array( "1.0", "1.0" ),
"4698 溪上"=>
	array( "1.0", "1.0" ),
"4702 樹間"=>
	array( "1.0", "1.0" ),
"4704 白露"=>
	array( "1.0", "1.0" ),
"4708 諸葛廟"=>
	array( "1.0", "1.0" ),
"4711 夜雨"=>
	array( "1.0", "1.0" ),
"4714 更題"=>
	array( "1.0", "1.0" ),
"4718 第五弟豐獨在江左，近三四載寂無消息，覓使寄此二首"=>
	array( "1.0", "1.0" ),
"4725 贈李八秘書別三十韻"=>
	array( "1.0", "1.0" ),
"4743 送李八秘書赴杜相公幕"=>
	array( "1.0", "1.0" ),
"4750 別李秘書始興寺所居"=>
	array( "1.0", "1.0" ),
"4754 君不見，簡蘇徯"=>
	array( "1.0", "1.0" ),
"4758 贈蘇四徯"=>
	array( "1.0", "1.0" ),
"4764 別蘇徯"=>
	array( "1.0", "1.0" ),
"4769 別崔潩因寄薛據、孟雲霧卿"=>
	array( "1.0", "1.0" ),
"4773 巫峽弊廬奉贈侍御四舅別之澧朗"=>
	array( "1.0", "1.0" ),
"4776 孟氏"=>
	array( "1.0", "1.0" ),
"4781 吾宗"=>
	array( "1.0", "1.0" ),
"4786 奉酬薛十二丈判官見贈"=>
	array( "1.0", "1.0" ),
"4803 寄狄明府"=>
	array( "1.0", "1.0" ),
"4813 同元使君舂陵行"=>
	array( "1.0", "1.0" ),
"4822 寄韓諫議"=>
	array( "1.0", "1.0" ),
"4834 秋日夔府詠懷奉寄鄭監李賓客一百韻"=>
	array( "1.0", "1.0" ),
"4892 寄劉峽州伯華使君四十韻"=>
	array( "1.0", "1.0" ),
"4915 天池"=>
	array( "1.0", "1.0" ),
"4921 秋野五首"=>
	array( "1.0", "1.0" ),
"4934 課小竪鉏斫舍北果林，枝蔓荒穢淨訖，移床三首"=>
	array( "1.0", "1.0" ),
"4940 解悶十二首"=>
	array( "1.0", "1.0" ),
"4965 洞房"=>
	array( "1.0", "1.0" ),
"4969 宿昔"=>
	array( "1.0", "1.0" ),
"4972 能畫"=>
	array( "1.0", "1.0" ),
"4976 鬬雞"=>
	array( "1.0", "1.0" ),
"4979 歷歷"=>
	array( "1.0", "1.0" ),
"4982 洛陽"=>
	array( "1.0", "1.0" ),
"4985 驪山"=>
	array( "1.0", "1.0" ),
"4988 提封"=>
	array( "1.0", "1.0" ),
"4995 鸚鵡"=>
	array( "1.0", "1.0" ),
"4997 孤雁"=>
	array( "1.0", "1.0" ),
"5001 社日兩篇"=>
	array( "1.0", "1.0" ),
"5005 八月十五夜月二首"=>
	array( "1.0", "1.0" ),
"5010 十六夜翫月"=>
	array( "1.0", "1.0" ),
"5013 十七夜對月"=>
	array( "1.0", "1.0" ),
"5015 日暮"=>
	array( "1.0", "1.0" ),
"5018 反照"=>
	array( "1.0", "1.0" ),
"5021 自瀼西荊扉且移居東屯茅屋四首"=>
	array( "1.0", "1.0" ),
"5030 曉望"=>
	array( "1.0", "1.0" ),
"5032 暝"=>
	array( "1.0", "1.0" ),
"5035 晚"=>
	array( "1.0", "1.0" ),
"5037 奉賀陽城郡王太夫人恩命加鄧國太夫人"=>
	array( "1.0", "1.0" ),
"5042 送田四弟將軍"=>
	array( "1.0", "1.0" ),
"5045 九月一日過孟十二倉曹十四主簿兄弟"=>
	array( "1.0", "1.0" ),
"5047 孟倉曹步趾領新酒醬二物滿器見遺老夫"=>
	array( "1.0", "1.0" ),
"5050 送孟十二倉曹赴東京選"=>
	array( "1.0", "1.0" ),
"5052 憑孟倉曹將書覓土婁舊莊"=>
	array( "1.0", "1.0" ),
"5054 簡吳郎司法"=>
	array( "1.0", "1.0" ),
"5056 又呈吳郎"=>
	array( "1.0", "1.0" ),
"5061 晚晴吳郎見過北舍"=>
	array( "1.0", "1.0" ),
"5063 復愁十二首"=>
	array( "1.0", "1.0" ),
"5081 九日五首"=>
	array( "1.0", "1.0" ),
"5092 登高"=>
	array( "1.0", "1.0" ),
"5098 覃山人隱居"=>
	array( "1.0", "1.0" ),
"5102 柏學士茅屋"=>
	array( "1.0", "1.0" ),
"5106 題柏大兄弟山居屋壁二首"=>
	array( "1.0", "1.0" ),
"5110 寄柏學士林居"=>
	array( "1.0", "1.0" ),
"5113 寄從孫崇簡"=>
	array( "1.0", "1.0" ),
"5116 季秋蘇五弟纓江樓夜宴崔十三評事韋少府姪三首"=>
	array( "1.0", "1.0" ),
"5122 戲寄崔評事表姪蘇五表弟韋大少府諸姪"=>
	array( "1.0", "1.0" ),
"5124 季秋江村"=>
	array( "1.0", "1.0" ),
"5126 小園"=>
	array( "1.0", "1.0" ),
"5128 寒雨朝行視園樹"=>
	array( "1.0", "1.0" ),
"5133 傷秋"=>
	array( "1.0", "1.0" ),
"5135 卽事"=>
	array( "1.0", "1.0" ),
"5138 夜"=>
	array( "1.0", "1.0" ),
"5140 耳聾"=>
	array( "1.0", "1.0" ),
"5143 獨坐二首"=>
	array( "1.0", "1.0" ),
"5148 月"=>
	array( "1.0", "1.0" ),
"5153 秋峽"=>
	array( "1.0", "1.0" ),
"5155 秋清"=>
	array( "1.0", "1.0" ),
"5156 雲"=>
	array( "1.0", "1.0" ),
"5158 夜二首"=>
	array( "1.0", "1.0" ),
"5164 雨四首"=>
	array( "1.0", "1.0" ),
"5171 戲作俳諧體遣悶二首"=>
	array( "1.0", "1.0" ),
"5180 昔遊"=>
	array( "1.161", "2.50" ),
"5188 大覺高僧蘭若"=>
	array( "1.0", "1.0" ),
"5191 東屯月夜"=>
	array( "1.0", "1.0" ),
"5194 東屯北崦"=>
	array( "1.0", "1.0" ),
"5196 從驛次草堂復至東屯茅屋二首"=>
	array( "1.0", "1.0" ),
"5199 暫往白帝復還東屯"=>
	array( "1.0", "1.0" ),
"5201 茅堂檢校收稻二首"=>
	array( "1.0", "1.0" ),
"5205 大曆二年九月三十日"=>
	array( "1.0", "1.0" ),
"5207 十月一日"=>
	array( "1.0", "1.0" ),
"5210 刈稻了詠懷"=>
	array( "1.0", "1.0" ),
"5212 孟冬"=>
	array( "1.0", "1.0" ),
"5214 鷗"=>
	array( "1.0", "1.0" ),
"5217 猿"=>
	array( "1.0", "1.0" ),
"5219 麂"=>
	array( "1.0", "1.0" ),
"5223 雞"=>
	array( "1.0", "1.0" ),
"5226 黃魚"=>
	array( "1.0", "1.0" ),
"5228 白小"=>
	array( "1.0", "1.0" ),
"5230 向夕"=>
	array( "1.0", "1.0" ),
"5232 雷"=>
	array( "1.", "3." ),
"5235 朝二首"=>
	array( "1.0", "1.0" ),
"5239 悶"=>
	array( "1.0", "1.0" ),
"5243 寄杜位"=>
	array( "1.0", "1.0" ),
"5244 玉腕騮"=>
	array( "1.0", "1.0" ),
"5247 上卿翁請修武侯廟遺像缺落，時崔卿權夔州"=>
	array( "1.0", "1.0" ),
"5250 奉送卿二翁統節度鎮軍還江陵"=>
	array( "1.0", "1.0" ),
"5253 久雨期王將軍不至"=>
	array( "1.0", "1.0" ),
"5257 謁真諦寺禪師"=>
	array( "1.0", "1.0" ),
"5261 虎牙行"=>
	array( "1.0", "1.0" ),
"5265 錦樹行"=>
	array( "1.0", "1.0" ),
"5269 自平"=>
	array( "1.0", "1.0" ),
"5275 寄裴施州"=>
	array( "1.0", "1.0" ),
"5281 鄭典設自施州歸"=>
	array( "1.0", "1.0" ),
"5288 寫懷二首"=>
	array( "1.0", "1.0" ),
"5297 可歎"=>
	array( "1.0", "1.0" ),
"5308 觀公孫大娘弟子舞劍器行"=>
	array( "1.0", "1.0" ),
"5325 冬至"=>
	array( "1.0", "1.0" ),
"5328 小至"=>
	array( "1.0", "1.0" ),
"5332 柳司馬至"=>
	array( "1.0", "1.0" ),
"5335 送高司直尋封閬州"=>
	array( "1.0", "1.0" ),
"5339 奉送韋中丞之晉赴湖南"=>
	array( "1.0", "1.0" ),
"5342 送鮮于萬州遷巴州"=>
	array( "1.0", "1.0" ),
"5345 奉送十七舅下邵桂"=>
	array( "1.0", "1.0" ),
"5347 舍弟觀赴藍田取妻子到江陵喜寄三首"=>
	array( "1.0", "1.0" ),
"5357 夜歸"=>
	array( "1.0", "1.0" ),
"5360 前苦寒行二首"=>
	array( "1.0", "1.0" ),
"5364 後苦寒行二首"=>
	array( "1.0", "1.0" ),
"5369 晚晴"=>
	array( "1.0", "1.0" ),
"5372 復陰"=>
	array( "1.0", "1.0" ),
"5374 有歎"=>
	array( "1.0", "1.0" ),
"5377 峽隘"=>
	array( "1.0", "1.0" ),
"5379 別李義"=>
	array( "1.0", "1.0" ),
"5385 元日示宗武"=>
	array( "1.0", "1.0" ),
"5388 又示宗武"=>
	array( "1.0", "1.0" ),
"5391 遠懷舍弟穎觀等"=>
	array( "1.0", "1.0" ),
"5393 續得觀書，迎就當陽居止，正月中旬定出三峽"=>
	array( "1.0", "1.0" ),
"5396 太歲日"=>
	array( "1.0", "1.0" ),
"5400 人日兩篇"=>
	array( "1.0", "1.0" ),
"5405 喜聞盜賊蕃寇總退口號五首"=>
	array( "1.0", "1.0" ),
"5413 送大理封主簿五郎親事不合，卻赴通州。主簿前閬州賢子，余與主簿平章鄭氏女子，垂欲納采，鄭氏伯父京書至，女子巳許他族，親事遂停"=>
	array( "1.0", "1.0" ),
"5418 將赴荊南寄別李劍州"=>
	array( "1.0", "1.0" ),
"5421 將別巫峽，贈南卿兄瀼西果園四十畝"=>
	array( "1.0", "1.0" ),
"5425 巫山縣汾州唐使君十八弟宴別，兼諸公携酒樂相送，率題小詩，留於屋壁"=>
	array( "1.0", "1.0" ),
"5427 敬寄族弟唐十八使君"=>
	array( "1.0", "1.0" ),
"5432 春夜峽州田侍御長史津亭留宴"=>
	array( "1.0", "1.0" ),
"5434 大曆三年春，白帝城放船出瞿塘峽，久居夔府，將適江陵，漂泊有詩，凡四十韻"=>
	array( "1.0", "1.0" ),
"5452 泊松滋江亭"=>
	array( "1.0", "1.0" ),
"5455 行次古城店汎江作，不揆鄙拙，奉呈江陵幕府諸公"=>
	array( "1.0", "1.0" ),
"5458 乘雨入行軍六弟宅"=>
	array( "1.0", "1.0" ),
"5460 上巳日徐司錄林園宴集"=>
	array( "1.0", "1.0" ),
"5462 宴胡侍御書堂"=>
	array( "1.0", "1.0" ),
"5464 書堂飲既夜復邀李尚書下馬月下賦絕句"=>
	array( "1.0", "1.0" ),
"5466 奉送蘇州李二十五長史丈之任"=>
	array( "1.0", "1.0" ),
"5469 暮春江陵送馬大卿公恩命追赴闕下"=>
	array( "1.0", "1.0" ),
"5473 和江陵宋大少府暮春雨後同諸公及舍弟宴書齋"=>
	array( "1.0", "1.0" ),
"5475 暮春陪李尚書李中丞過鄭監湖亭汎舟"=>
	array( "1.0", "1.0" ),
"5477 宇文晁崔彧重泛鄭監前湖"=>
	array( "1.0", "1.0" ),
"5480 歸雁"=>
	array( "1.0", "1.0" ),
"5483 短歌行"=>
	array( "1.0", "1.0" ),
"5489 憶昔行"=>
	array( "1.0", "1.0" ),
"5497 惜別行送向卿進奉端午御衣之上都"=>
	array( "1.0", "1.0" ),
"5500 夏日楊長寧宅送崔侍御常正字入京"=>
	array( "1.0", "1.0" ),
"5503 夏夜李尚書筵送宇文石首赴縣聯句"=>
	array( "1.0", "1.0" ),
"5507 多病執熱奉懷李尚書"=>
	array( "1.0", "1.0" ),
"5510 水宿遣興奉呈羣公"=>
	array( "1.0", "1.0" ),
"5517 寄李十四員外布十二韻"=>
	array( "1.0", "1.0" ),
"5522 遣悶"=>
	array( "1.0", "1.0" ),
"5526 舟月對驛近寺"=>
	array( "1.0", "1.0" ),
"5528 舟中"=>
	array( "1.0", "1.0" ),
"5530 江陵節度陽城郡王新樓成，王請嚴侍御判官賦七字句，同作"=>
	array( "1.0", "1.0" ),
"5534 又作此奉衛王"=>
	array( "1.0", "1.0" ),
"5538 江邊星月"=>
	array( "1.0", "1.0" ),
"5542 秋日荊南述懷"=>
	array( "1.0", "1.0" ),
"5557 秋日荊南送石首薛明府辭滿告別，奉寄薛尚書頌德敍懷斐然之作"=>
	array( "1.0", "1.0" ),
"5568 獨坐"=>
	array( "1.0", "1.0" ),
"5571 暮歸"=>
	array( "1.0", "1.0" ),
"5575 江漢"=>
	array( "1.0", "1.0" ),
"5579 哭李常侍嶧"=>
	array( "1.0", "1.0" ),
"5584 呀鶻行"=>
	array( "1.0", "1.0" ),
"5586 送覃二判官"=>
	array( "1.0", "1.0" ),
"5589 久客"=>
	array( "1.0", "1.0" ),
"5591 地隅"=>
	array( "1.0", "1.0" ),
"5593 舟中出江陵南浦，奉寄鄭少尹"=>
	array( "1.0", "1.0" ),
"5598 山館"=>
	array( "1.0", "1.0" ),
"5601 哭李尚書"=>
	array( "1.0", "1.0" ),
"5607 重題"=>
	array( "1.0", "1.0" ),
"5609 醉歌行"=>
	array( "1.0", "1.0" ),
"5612 送顧八分文學適洪吉州"=>
	array( "1.0", "1.0" ),
"5622 官亭夕坐戲簡顏十少府"=>
	array( "1.0", "1.0" ),
"5624 移居公安敬贈衛大郎"=>
	array( "1.0", "1.0" ),
"5628 公安送韋二少府匡贊"=>
	array( "1.0", "1.0" ),
"5631 公安縣懷古"=>
	array( "1.0", "1.0" ),
"5633 宴王使君宅題"=>
	array( "1.0", "1.0" ),
"5639 公安送李二十九弟晉肅入蜀余下沔鄂"=>
	array( "1.0", "1.0" ),
"5642 留別公安太易沙門"=>
	array( "1.0", "1.0" ),
"5646 冬深"=>
	array( "1.0", "1.0" ),
"5649 曉發公安數月憩息此縣"=>
	array( "1.0", "1.0" ),
"5653 發劉郎浦"=>
	array( "1.0", "1.0" ),
"5655 別董頲"=>
	array( "1.0", "1.0" ),
"5659 夜聞𥷑篥"=>
	array( "1.0", "1.0" ),
"5661 歲晏行"=>
	array( "1.0", "1.0" ),
"5667 泊岳陽城下"=>
	array( "1.0", "1.0" ),
"5670 纜船苦風，戲題四韻，奉簡鄭十三判官"=>
	array( "1.0", "1.0" ),
"5673 登岳陽樓"=>
	array( "1.0", "1.0" ),
"5680 陪裴使君登岳陽樓"=>
	array( "1.0", "1.0" ),
"5684 南征"=>
	array( "1.0", "1.0" ),
"5685 歸夢"=>
	array( "1.0", "1.0" ),
"5689 過南岳入洞庭湖"=>
	array( "1.0", "1.0" ),
"5694 宿青草湖"=>
	array( "1.0", "1.0" ),
"5696 宿白沙驛"=>
	array( "1.0", "1.0" ),
"5699 湘夫人祠"=>
	array( "1.0", "1.0" ),
"5703 祠南夕望"=>
	array( "1.0", "1.0" ),
"5705 登白馬潭"=>
	array( "1.0", "1.0" ),
"5708 上水遣懷"=>
	array( "1.0", "1.0" ),
"5715 遣遇"=>
	array( "1.0", "1.0" ),
"5718 解憂"=>
	array( "1.0", "1.0" ),
"5722 入喬口"=>
	array( "1.0", "1.0" ),
"5724 北風"=>
	array( "1.0", "1.0" ),
"5728 銅官渚守風"=>
	array( "1.0", "1.0" ),
"5730 雙楓浦"=>
	array( "1.0", "1.0" ),
"5732 岳麓山道林二寺行"=>
	array( "1.0", "1.0" ),
"5743 清明二首"=>
	array( "1.0", "1.0" ),
"5752 發潭州"=>
	array( "1.0", "1.0" ),
"5755 早行"=>
	array( "1.0", "1.0" ),
"5757 野望"=>
	array( "1.0", "1.0" ),
"5760 宿鑿石浦"=>
	array( "1.0", "1.0" ),
"5763 詠懷二首"=>
	array( "1.0", "1.0" ),
"5774 過津口"=>
	array( "1.0", "1.0" ),
"5777 次空靈岸"=>
	array( "1.0", "1.0" ),
"5780 宿花石戍"=>
	array( "1.0", "1.0" ),
"5784 早發"=>
	array( "1.0", "1.0" ),
"5788 次晩洲"=>
	array( "1.0", "1.0" ),
"5792 望岳"=>
	array( "1.0", "1.0" ),
"5799 酬郭十五判官"=>
	array( "1.0", "1.0" ),
"5803 衡州送李大夫赴廣州"=>
	array( "1.0", "1.0" ),
"5809 哭韋大夫之晉"=>
	array( "1.0", "1.0" ),
"5815 湘江宴餞裴二端公赴道州"=>
	array( "1.0", "1.0" ),
"5821 潭州送韋員外牧韶州"=>
	array( "1.0", "1.0" ),
"5824 酬韋韶州見寄"=>
	array( "1.0", "1.0" ),
"5826 樓上"=>
	array( "1.0", "1.0" ),
"5828 千秋節有感"=>
	array( "1.0", "1.0" ),
"5835 奉贈盧五丈參謀琚"=>
	array( "1.0", "1.0" ),
"5841 惜別行送劉僕射判官"=>
	array( "1.0", "1.0" ),
"5846 重送劉十弟判官"=>
	array( "1.0", "1.0" ),
"5849 登舟將適漢陽"=>
	array( "1.0", "1.0" ),
"5852 湖南送敬十使君適廣陵"=>
	array( "1.0", "1.0" ),
"5855 蘇大侍御渙，靜者也，旅于江側，凡是不交州府之客，人事都絕久矣。肩輿江浦，忽訪老夫舟檝，而已茶酒内，余請誦近詩，肯吟數首，才力素壯，詞句動人。接對明日，憶其湧思雷出，書篋几杖之外，殷殷劉金石聲，賦八韻記異，亦記老夫傾倒於蘇至矣"=>
	array( "1.0", "1.0" ),
"5862 暮秋枉裴道州手札，率爾遣興，寄近呈蘇渙侍御"=>
	array( "1.0", "1.0" ),
"5871 奉贈李八丈判官"=>
	array( "1.0", "1.0" ),
"5876 別張十三建封"=>
	array( "1.0", "1.0" ),
"5887 北風"=>
	array( "1.0", "1.0" ),
"5889 幽人"=>
	array( "1.0", "1.0" ),
"5898 晩秋長沙蔡五侍御飲筵送殷六參軍歸澧州覲省"=>
	array( "1.0", "1.0" ),
"5901 送盧十四弟侍御護韋尚書靈櫬歸上都"=>
	array( "1.0", "1.0" ),
"5908 奉送魏六丈佑少府之交廣"=>
	array( "1.0", "1.0" ),
"5916 舟中夜雪有懷盧十四侍御弟"=>
	array( "1.0", "1.0" ),
"5919 對雪"=>
	array( "1.0", "1.0" ),
"5923 冬晩送長孫漸舍人歸州"=>
	array( "1.0", "1.0" ),
"5926 暮冬送蘇四郎徯兵曹適桂州"=>
	array( "1.0", "1.0" ),
"5929 客從"=>
	array( "1.0", "1.0" ),
"5932 蠶穀行"=>
	array( "1.0", "1.0" ),
"5934 白鳧行"=>
	array( "1.0", "1.0" ),
"5938 朱鳳行"=>
	array( "1.0", "1.0" ),
"5941 追酬故高蜀州人日見寄"=>
	array( "1.0", "1.0" ),
"5948 送重表姪王砅評事使南海"=>
	array( "1.0", "1.0" ),
"5965 奉贈蕭十二使君"=>
	array( "1.0", "1.0" ),
"5973 奉送二十三舅録事之攝郴州"=>
	array( "1.0", "1.0" ),
"5976 送魏二十四司直充嶺南掌選崔郎中判官兼寄韋韶州"=>
	array( "1.0", "1.0" ),
"5979 送趙十七明府之縣"=>
	array( "1.0", "1.0" ),
"5982 同豆盧峯貽主客李員外賢子棐知字韻"=>
	array( "1.0", "1.0" ),
"5985 歸雁二首"=>
	array( "1.0", "1.0" ),
"5989 風雨看舟前落花，戲爲新句"=>
	array( "1.0", "1.0" ),
"5993 江南逢李龜年"=>
	array( "1.0", "1.0" ),
"5999 燕子來舟中作"=>
	array( "1.0", "1.0" ),
"6002 小寒食舟中作"=>
	array( "1.0", "1.0" ),
"6007 清明"=>
	array( "1.0", "1.0" ),
"6011 贈韋七贊善"=>
	array( "1.0", "1.0" ),
"6014 奉酬寇十侍御錫見寄四韻復寄寇"=>
	array( "1.0", "1.0" ),
"6018 入衡州"=>
	array( "1.0", "1.0" ),
"6033 逃難"=>
	array( "1.0", "1.0" ),
"6036 白馬"=>
	array( "1.0", "1.0" ),
"6039 舟中苦熱遣懷，奉呈陽中丞，通簡臺省諸公"=>
	array( "1.0", "1.0" ),
"6048 題衡山縣文宣王廟新學堂呈陸宰"=>
	array( "1.0", "1.0" ),
"6056 聶耒陽以僕阻水，書致酒肉，詩得代懷，至縣呈聶一首"=>
	array( "1.0", "1.0" ),
"6069 迴棹"=>
	array( "1.0", "1.0" ),
"6075 江閣臥病，走筆寄呈崔盧兩侍御"=>
	array( "1.0", "1.0" ),
"6079 江閣對雨，有懷行營裴二端公"=>
	array( "1.0", "1.0" ),
"6083 過洞庭湖"=>
	array( "1.0", "1.0" ),
"6087 暮秋將歸秦，留別湖南幕府親友"=>
	array( "1.0", "1.0" ),
"6090 長沙送李十一"=>
	array( "1.0", "1.0" ),
"6093 風疾舟，伏枕書懷三十六韻，奉呈湖南親友"=>
	array( "1.0", "1.0" )
);
?>