<?php
/*
*/
$疊字=array(
"丁丁","發發","呦呦","溶溶","悄悄","嗷嗷","靄靄","往往","悠悠","珊珊","蕭蕭","飄飄","萋萋","蕩蕩","年年","轔轔","啾啾","戚戚","迢迢","漠漠","怏怏","踆踆","紛紛","蒼蒼","慘慘","衮衮","沉沉","颼颼","活活","采采","颯颯","冉冉","泠泠","青青","纍纍","矯矯","時時","杲杲","冥冥","蠢蠢","兀兀","修修","殷殷","頭頭","泱泱","㹞㹞","肅肅","咄咄","草草","浩浩","茫茫","句句","處處","靡靡","桓桓","煌煌","家家","娟娟","霏霏","細細","陰陰","日日","深深","款款","昏昏","元元","藹藹","炯炯","拳拳","匆匆","城城","望望","惻惻","恢恢","赫赫","莽莽","涔涔","稍稍","樹樹","片片","去去","搰搰","連連","回回","亭亭","上上","杳杳","哀哀","忡忡","礧礧","漫漫","翳翳","水水","落落","森森","湛湛","枝枝","事事","瑟瑟","咽咽","練練","纖纖","淒淒","籍籍","穰穰","垂垂","微微","脈脈","荒荒","泯泯","涓涓","寂寂","欣欣","暉暉","恰恰","愁愁","嫋嫋","寥寥","凜凜","袞袞","童童","牀牀","裊裊","滔滔","箇箇","村村","揚揚","鱍鱍","戢戢","州州","鷹鷹","鬱鬱","雙雙","葉葉","重重","閃閃","淡淡","苒苒","頻頻","熒熒","擢擢","淅淅","團團","漂漂","慽慽","攘攘","眷眷","盈盈","豔豔","汩汩","脩脩","高高","區區","行行","飛飛","迴迴","熠熠","胡胡","今今","班班","怱怱","至至","岸岸","菲菲","洶洶","馬馬","魚魚","唧唧","戎戎","淰淰","朝朝","短短","輕輕","早早","眇眇","溫溫","明明","皇皇","一一","潺潺","渾渾","鏘鏘","泛泛","夜夜","輝輝","嗟嗟","營營","駪駪","浪浪","永永","依依","急急","皛皛","闇闇","欵欵","星星","役役","濟濟","喧喧","堂堂","小小","故故","芊芊","剡剡","栖栖","忽忽","君君","泥泥","粲粲","壘壘","怛怛","漣漣","窄窄","黯黯","歷歷","滾滾","頓頓","翩翩","碌碌","皚皚","已已","嶷嶷","濛濛","穆穆","皎皎","遲遲","渺渺","風風","晚晚","的的","人人","林林","步步","納納","皦皦","沄沄","峯峯","汎汎","侁侁","寸寸","倩倩","駸駸",
); // size: 242

?>