<?php
/*
生成：本文檔用人手生成、編輯。
說明：詩文件夾路徑。
*/
$詩文件夾路徑 = array(
"h:\\github\\DuFu\\01 卷一 3-270\\",
"h:\\github\\DuFu\\02 卷二 271-579\\",
"h:\\github\\DuFu\\03 卷三 581-898\\",
"h:\\github\\DuFu\\04 卷四 899-1127\\",
"h:\\github\\DuFu\\05 卷五 1129-1404\\",
"h:\\github\\DuFu\\06 卷六 1405-1698\\",
"h:\\github\\DuFu\\07 卷七 1699-2060\\",
"h:\\github\\DuFu\\08 卷八 2061-2499\\",
"h:\\github\\DuFu\\09 卷九 2501-2746\\",
"h:\\github\\DuFu\\10 卷十 2747-3020\\",
"h:\\github\\DuFu\\11 卷十一 3021-3335\\",
"h:\\github\\DuFu\\12 卷十二 3337-3590\\",
"h:\\github\\DuFu\\13 卷十三 3591-3883\\",
"h:\\github\\DuFu\\14 卷十四 3885-4144\\",
"h:\\github\\DuFu\\15 卷十五 4145-4532\\",
"h:\\github\\DuFu\\16 卷十六 4533-4919\\",
"h:\\github\\DuFu\\17 卷十七 4921-5259\\",
"h:\\github\\DuFu\\18 卷十八 5261-5496\\",
"h:\\github\\DuFu\\19 卷十九 5497-5807\\",
"h:\\github\\DuFu\\20 卷二十 5809-6108\\"
);
?>