<?php
/*
生成：本文檔用人手生成、人手編輯。
說明：同一頁碼包含一組詩、副題行碼。
*/
//global $詩組_詩題;
$詩組_詩題=array(
"0013"=>array( "題張氏隱居二首", 
	array( 3, 10 ), // 副題行碼
	array()
),
"0062"=>array( "李監宅二首", 
	array( 3, 10 ), // 副題行碼
	array()
),
"0152"=>array( "故武衞將軍挽歌三首", 
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"0241"=>array( "前出塞九首",
	array( 3, 10, 17, 24, 31, 38, 45, 52, 59 ), // 副題行碼
	array()
),
"0305"=>array( "曲江三章章五句",
	array( 3, 9, 15 ), // 副題行碼
	array()
),
"0356"=>array( "陪鄭廣文遊何將軍山林十首",
	array( 3, 10, 17, 24, 31, 38, 45, 52, 59, 66 ), // 副題行碼
	array()
),
"0419"=>array( "重過何氏五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"0438"=>array( "陪諸貴公子丈八溝攜妓納涼，晚際遇雨二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"0465"=>array( "秋雨歎三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"0636"=>array( "後出塞五首",
	array( 3, 13, 22, 31, 40 ), // 副題行碼
	array()
),
"0783"=>array( "得舍弟消息二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"0797"=>array( "大雲寺贊公房四首",
	array( 3, 14, 23, 32 ), // 副題行碼
	array()
),
"0824"=>array( "喜達行在所三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"0934"=>array( "羌村三首",
	array( 3, 12, 21 ), // 副題行碼
	array()
),
"0979"=>array( "收京三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"1045"=>array( "曲江二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"1064"=>array( "奉陪鄭駙馬韋曲二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"1156"=>array( "觀安西兵過赴關中待命二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"1197"=>array( "遣興三首",
	array( 3, 11, 19 ), // 副題行碼
	array()
),
"1204"=>array( "至日遣興奉寄北省舊閣老兩院故人二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"1233"=>array( "憶弟二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"1340"=>array( "遣興三首",
	array( 3, 12, 21 ), // 副題行碼
	array()
),
"1356"=>array( "夢李白二首",
	array( 3, 14 ), // 副題行碼
	array()
),
"1376"=>array( "遣興五首",
	array( 3, 11, 19, 26, 33 ), // 副題行碼
	array()
),
"1390"=>array( "遣興二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"1395"=>array( "遣興五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"1405"=>array( "秦州雜詩二十首",
	array( 3,10,17,24,31,38,45,52,59,66,73,80,87,94,101,108,115,122,129,136 ), // 副題行碼
	array()
),
"1488"=>array( "西枝村尋置草堂地，夜宿贊公土室二首",
	array( 3, 16 ), // 副題行碼
	array()
),
"1600"=>array( "佐還山後寄三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"1770"=>array( "乾元中寓居同谷縣作歌七首",
	array( 3, 10, 17, 24, 31, 38, 45 ), // 副題行碼
	array()
),
"2047"=>array( "散愁二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"2139"=>array( "遣意二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"2148"=>array( "漫成二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"2161"=>array( "春水生二絕",
	array( 3, 8 ), // 副題行碼
	array()
),
"2177"=>array( "水檻遣心二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"2219"=>array( "江畔獨步尋花七絕句",
	array( 3, 8, 13, 18, 23, 28, 33 ), // 副題行碼
	array()
),
"2232"=>array( "絕句漫興九首",
	array( 3, 8, 13, 18, 23, 28, 33, 38, 43 ), // 副題行碼
	array()
),
"2256"=>array( "少年行二首",
	array( 3, 8 ), // 副題行碼
	array()
),
"2445"=>array( "陪李七司馬皂江上觀造竹橋，卽日成，往來之人免冬寒入水，聊題短作，簡李公二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"2501"=>array( "戲爲六絕句",
	array( 3, 8, 13, 18, 23, 28 ), // 副題行碼
	array()
),
"2516"=>array( "江頭五詠",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"2530"=>array( "屏跡三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"2565"=>array( "中丞嚴公雨中垂寄見憶一絕，奉答二絕",
	array( 3, 8 ), // 副題行碼
	array()
),
"2570"=>array( "三絕句",
	array( 3, 8, 13 ), // 副題行碼
	array()
),
"2591"=>array( "戲贈友二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"2674"=>array( "戲題寄上漢中王三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"2755"=>array( "春日梓州登樓二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"2803"=>array( "數陪李梓州泛江，有女樂在諸舫，戲爲豔曲二首贈李",
	array( 3, 10 ), // 副題行碼
	array()
),
"2823"=>array( "巴西驛亭觀江漲呈竇使君二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"2840"=>array( "官池春雁二首",
	array( 3, 8 ), // 副題行碼
	array()
),
"2862"=>array( "述古三首",
	array( 3, 12, 21 ), // 副題行碼
	array()
),
"2899"=>array( "戲作寄上漢中王二首",
	array( 3, 8 ), // 副題行碼
	array()
),
"2969"=>array( "西山三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"3036"=>array( "傷春五首",
	array( 3, 12, 21, 30, 39 ), // 副題行碼
	array()
),
"3052"=>array( "巴西聞收京，送班司馬入京二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3059"=>array( "有感五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"3079"=>array( "陪王使君晦日泛江就黃家亭子二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3099"=>array( "滕王亭子二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3104"=>array( "玉臺觀二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3117"=>array( "自閬州領妻子卻赴蜀山行三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"3124"=>array( "將赴成都草堂，途中有作，先寄嚴鄭公五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"3177"=>array( "絕句二首",
	array( 3, 8 ), // 副題行碼
	array()
),
"3197"=>array( "黃河二首",
	array( 3, 8 ), // 副題行碼
	array()
),
"3218"=>array( "絕句六首",
	array( 3, 8, 13, 18, 23, 28 ), // 副題行碼
	array()
),
"3224"=>array( "絕句四首",
	array( 3, 8, 13, 18 ), // 副題行碼
	array()
),
"3236"=>array( "憶昔二首",
	array( 3, 15 ), // 副題行碼
	array()
),
"3245"=>array( "過故斛斯校書莊二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3299"=>array( "送舍弟穎赴齊州三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"3322"=>array( "觀李固請司馬弟山水圖三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"3346"=>array( "春日江村五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"3361"=>array( "絕句三首",
	array( 3, 8, 13 ), // 副題行碼
	array()
),
"3381"=>array( "三韻三篇",
	array( 3, 9, 15 ), // 副題行碼
	array()
),
"3442"=>array( "長江二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3447"=>array( "承聞故房相公靈櫬，自閬州啓殯歸葬東都，有作二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3454"=>array( "將曉二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3459"=>array( "懷錦水居止二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3466"=>array( "三絕句",
	array( 3, 8, 13 ), // 副題行碼
	array()
),
"3473"=>array( "十二月一日三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"3556"=>array( "上白帝城二首",
	array( 3, 12 ), // 副題行碼
	array()
),
"3607"=>array( "奉寄李十五秘書二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3626"=>array( "熱三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"3702"=>array( "雨二首",
	array( 3, 12 ), // 副題行碼
	array()
),
"3747"=>array( "夔州歌十絕句",
	array( 3, 8, 13, 18, 23, 28, 33, 38, 43, 48 ), // 副題行碼
	array()
),
"3763"=>array( "諸將五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"3789"=>array( "秋興八首",
	array( 3, 10, 17, 24, 31, 38, 45, 52 ), // 副題行碼
	array()
),
"3841"=>array( "詠懷古跡五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"3873"=>array( "西閣二首",
	array( 3, 12 ), // 副題行碼
	array()
),
"3885"=>array( "覆舟二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"3899"=>array( "存殁口號二首",
	array( 3, 8 ), // 副題行碼
	array()
),
"3947"=>array( "秋日寄題鄭監湖上亭三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"3955"=>array( "八哀詩",
	array( 5, 40, 63, 100, 129, 175, 210, 245 ), // 副題行碼
	array()
),
"4224"=>array( "峽口二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4282"=>array( "不離西閣二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4303"=>array( "陪柏中丞觀宴將士二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4337"=>array( "見王監兵馬使說，近山有白黑二鷹，羅者久取，竟未能得。王以爲毛骨有異他鷹，恐臘後春生，鶱飛避暖，勁翮思秋之甚，眇不可見，請余賦詩二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4404"=>array( "晴二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4420"=>array( "入宅三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"4446"=>array( "暮春題瀼西新賃草屋五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"4477"=>array( "喜觀卽到，復題短篇二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4507"=>array( "承聞河北諸道節度入朝歡喜口號絕句十二首",
	array( 3, 8, 13, 18, 23, 28, 33, 38, 43, 48, 53, 58 ), // 副題行碼
	array()
),
"4593"=>array( "月三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"4607"=>array( "舍弟觀歸藍田迎新婦，送示兩篇",
	array( 3, 10 ), // 副題行碼
	array()
),
"4634"=>array( "七月一日題終明府水樓二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4686"=>array( "秋風二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4718"=>array( "第五弟豐獨在江左，近三四載寂無消息，覓使寄此二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"4921"=>array( "秋野五首",
	array( 3, 10, 17, 24, 31 ), // 副題行碼
	array()
),
"4934"=>array( "課小竪鉏斫舍北果林，枝蔓荒穢淨訖，移床三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"4940"=>array( "解悶十二首",
	array( 3, 8, 13, 18, 23, 28, 33, 38, 43, 48, 53, 58 ), // 副題行碼
	array()
),
"5001"=>array( "社日兩篇",
	array( 3, 10 ), // 副題行碼
	array()
),
"5005"=>array( "八月十五夜月二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5021"=>array( "自瀼西荊扉且移居東屯茅屋四首",
	array( 3, 10, 17, 24 ), // 副題行碼
	array()
),
"5063"=>array( "復愁十二首",
	array( 3, 8, 13, 18, 23, 28, 33, 38, 43, 48, 53, 58 ), // 副題行碼
	array()
),
"5081"=>array( "九日五首",
	array( 3, 10, 17, 24 ), // 副題行碼
	array()
), // 闕一首
"5106"=>array( "題柏大兄弟山居屋壁二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5116"=>array( "季秋蘇五弟纓江樓夜宴崔十三評事韋少府姪三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"5143"=>array( "獨坐二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5158"=>array( "夜二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5164"=>array( "雨四首",
	array( 3, 10, 17, 24 ), // 副題行碼
	array()
),
"5171"=>array( "戲作俳諧體遣悶二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5196"=>array( "從驛次草堂復至東屯茅屋二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5201"=>array( "茅堂檢校收稻二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5235"=>array( "朝二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5288"=>array( "寫懷二首",
	array( 3, 18 ), // 副題行碼
	array()
),
"5347"=>array( "舍弟觀赴藍田取妻子到江陵喜寄三首",
	array( 3, 10, 17 ), // 副題行碼
	array()
),
"5360"=>array( "前苦寒行二首",
	array( 3, 10 ), // 副題行碼
	array()
),
"5364"=>array( "後苦寒行二首",
	array( 3, 10 ) // 副題行碼
),
"5400"=>array( "人日兩篇",
	array( 3, 10 ), // 副題行碼
	array()
),
"5405"=>array( "喜聞盜賊蕃寇總退口號五首",
	array( 3, 8, 13, 18, 23 ), // 副題行碼
	array()
),
"5538"=>array( "江邊星月",
	array( 3, 10 ), // 副題行碼
	array()
),
"5579"=>array( "哭李常侍嶧",
	array( 3, 10 ), // 副題行碼
	array()
),
"5633"=>array( "宴王使君宅題",
	array( 3, 10 ), // 副題行碼
	array()
),
"5743"=>array( "清明二首",
	array( 3, 12 ), // 副題行碼
	array()
),
"5763"=>array( "詠懷二首",
	array( 3, 22 ), // 副題行碼
	array()
),
"5828"=>array( "千秋節有感",
	array( 3, 12 ), // 副題行碼
	array()
),
"5985"=>array( "歸雁二首",
	array( 3, 10 ), // 副題行碼
	array()
)
);
?>