<?php
$regex_replace = array(
"/仇兆\\X/u"=>"仇兆鰲",
"/吳\\X泰/u"=>"吳瞻泰",
"/朱鶴\\X/u"=>"朱鶴齡",
"/梁\\X昌/u"=>"梁運昌",
"/梁\\X道/u"=>"梁權道",
"/津阪孝\\X/u"=>"津阪孝綽",
"/洪\\X範/u"=>"洪覺範",
"/浦起\\X/u"=>"浦起龍",
"/王嗣\\X/u"=>"王嗣奭",
"/申\\X光/u"=>"申涵光",
"/石\\X居士/u"=>"石閭居士",
"/紀容\\X/u"=>"紀容舒",
"/翁方\\X/u"=>"翁方綱",
"/蔡夢\\X/u"=>"蔡夢弼",
"/趙\\X公/u"=>"趙次公",
"/朱\\X尊/u"=>"朱彝尊",
"/隋\\X帝/u"=>"隋煬帝",
"/徐知\\X/u"=>"徐知道",
"/李因\\X/u"=>"李因篤",
"/閻若\\X/u"=>"閻若璩",
"/朝鮮李\\X/u"=>"朝鮮李植",
"/謝\\X運/u"=>"謝靈運",


// options
"/[束|東]坂/u"=>"東坡",
"/[汪|江|注][媛|暖|緩|瑳]/u"=>"汪瑗",
"/[汪|江|注|涯|在][瀕|卷|版|原|翻|無]/u"=>"汪灝",
"/[顧|謂|原][憲|東|窟|京|原]/u"=>"顧宸",
"/[迭|邊|遺][連|運|迎|遠|唯][寶|寅|麥|賣]/u"=>"邊連寶",
"/[邵|那|郡|部|郁][寶|賓|傳|寅|實|賣|有]/u"=>"邵寶",
"/[黄|黃][傷|後|得|謂|魯|馬|翻|拾|南]/u"=>"黃鶴",
"/〗[黄|黃]\\X/u"=>"〗黃鶴",
"/史[姻|所|版]/u"=>"史炳",
"/周[匈|旬]/u"=>"周甸",
"/李[謂|輔|版]平/u"=>"李黼平",
"/趙[坊|彷]/u"=>"趙汸",
"/張[惰|泪|漕|得|滑]/u"=>"張溍",
"/張[艇|誕|捷]/u"=>"張綖",

// "//u"=>"",
// "//u"=>"",
// "//u"=>"",
// 地名
"/崑\\X/u"=>"崑崙",
""=>"",
""=>"",
""=>"",
""=>"",
""=>"",
""=>"",

// 書名
"/[^《]杜詩\\X》/u"=>"《杜詩說》",
"/[^《]\\X杜心解/u"=>"《讀杜心解",
"/[^《]元和郡\\X\\X志/u"=>"《元和郡縣圖志",
"/[^《]\\X\\X堂杜詩注解/u"=>"《讀書堂杜詩注解",
"/[^《]杜詩鏡\\X/u"=>"《杜詩鏡銓",
"/[^《]杜詩會\\X/u"=>"《杜詩會稡",
"/[^《]魯通\\X\\X\\X記/u"=>"《魯通甫讀書記",
"/[^《]\\X選·/u"=>"《文選·",
"/[^《]朱竹\\X先生杜詩評本/u"=>"《朱竹垞先生杜詩評本",
"/\\X\\X律髓/u"=>"瀛奎律髓",
"/[^《]\\X林玉\\X/u"=>"《鶴林玉露",
"/[^《]杜詩七\\X\\X\\X意/u"=>"《杜詩七言律解意",



// 標點
"/「([^』]+)』/u"=>"「$1」", // 引號
"/「([^）]+)）/u"=>"「$1」",
"/（([^》]+)》/u"=>"《$1》", // 書名號
//"/《(\\X+?)）/u"=>"《$1》",
//"/「(\\X+?)》/u"=>"《$1》",

);
?>