<?php
const 杜甫資料庫   = "h:\\杜甫資料庫\\";
const 詩集文件夾   = "h:\\杜甫資料庫\\詩集\\";
const 平水韻文件夾  = 杜甫資料庫 . "平水韻\\";
const 中古聲母文件夾 = 杜甫資料庫 . "中古聲母\\";

const 杜甫分析文件夾  = "h:\\github\\Dufu-Analysis\\";
const 程式文件夾     = "h:\\github\\Dufu-Analysis\\analysis_programs\\";
const 杜甫文件夾     = "h:\\github\\Dufu\\";
const 杜甫全集       = 'h:\github\DuFu\杜甫全集.txt';
const 杜甫全集粵音注音 = 'h:\github\DuFu\杜甫全集粵音注音.txt';
const 目錄          = 'h:\github\DuFu\目錄.txt';

// 字符
const 分隔線 =
"\n=====================================================\n";
const 新行 = "\n";
const NL  = "\n";
const 等號 = '=';
const 坐標開括號 = '〚';
const 坐標關括號 = '〛';
const 坐標括號 = "〚〛";
const 冒號 = '：'; // UNICODE!!!
const 夾注regex = '/\[\X+?]/';
const 兩句regex = "/(\\X+?。\\X+?。)/";
const 四句regex = "/(\\X+?。\\X+?。\\X+?。\\X+?。)/";
const 第一組新行regex = "$1\n";
const ASCII = 'ASCII';
const 數字 = '[0123456789 ]';

// php data files
const 頁碼     = 杜甫資料庫 . '頁碼.php';
const 頁碼_路徑 = 杜甫資料庫 . '頁碼_路徑.php';
const 頁碼_詩題 = 杜甫資料庫 . '頁碼_詩題.php';
const 詩題_頁碼 = 杜甫資料庫 . '詩題_頁碼.php';
const 詩組_詩題 = 杜甫資料庫 . '詩組_詩題.php';
const 詩句_坐標 = 杜甫資料庫 . '詩句_坐標.php';
const 詩句_頁碼 = 杜甫資料庫 . '詩句_頁碼.php';
const 用字_頁碼 = 杜甫資料庫 . '用字_頁碼.php';
const 用字_詩句 = 杜甫資料庫 . '用字_詩句.php';
const 書目簡稱  = 杜甫資料庫 . '書目簡稱.php';
const 異體字    = 杜甫資料庫 . '異體字.php';
const 帶序文之詩歌 = 杜甫資料庫 . '帶序文之詩歌.php';
const 杜甫詩陣列 = 杜甫資料庫 . '杜甫詩陣列.php';
const 詩題_注音 = 杜甫資料庫 . '陳永明《杜甫全集粵音注音》\詩題_注音.php';
const 詩句_注音 = 杜甫資料庫 . '陳永明《杜甫全集粵音注音》\詩句_注音.php';
const 注音_詩句 = 杜甫資料庫 . '陳永明《杜甫全集粵音注音》\注音_詩句.php';
const 字音     = 杜甫資料庫 . '陳永明《杜甫全集粵音注音》\陳永明《杜甫全集粵音注音》字音.php';
const 字_韻部   = 平水韻文件夾 . '字_韻部.php';
const 字_聲母   = 中古聲母文件夾 . '字_聲母.php';

// 書名文件夾
const 全唐詩        = 杜甫資料庫 . "《全唐詩》\\";
const 杜詩詳註       = 杜甫資料庫 . "仇兆鰲《杜詩詳註》\\";
const 杜詩全集今注本  = 杜甫資料庫 . "張志烈主編《杜詩全集（今注本）》\\";
const 讀杜心解       = 杜甫資料庫 . "浦起龍《讀杜心解》\\";
const 杜臆          = 杜甫資料庫 . "王嗣奭《杜臆》\\";
const 杜甫全集校注    = 杜甫資料庫 . "蕭滌非主編《杜甫全集校注》\\";
const 杜甫全集粵音注音文件夾 = 杜甫資料庫 . "陳永明《杜甫全集粵音注音》\\";
const 杜甫詩全譯      = 杜甫資料庫 . "韓成武、張志民《杜甫詩全譯》\\";
const 新刊校定集注杜詩 = 杜甫資料庫 . "郭知達《新刊校定集注杜詩》\\";

// 書本部分
const 坐標 = '坐標';
const 内容 = "内容";
const 大意 = '大意';
const 行碼 = "行碼";
const 書名 = "書名";
const 版本 = "版本";
const 詩題 = "詩題";
const 題注 = '題注';
const 題解 = '題解';
const 【題解】 = '【題解】';
const 序言 = '序言';
const 詩文 = "詩文";
const 詩句 = "詩句";
const 參數 = '參數';
const 注釋 = '注釋';
const 坐標_句 = '坐標_句';
const 【注釋】 = '【注釋】';
const 注音 = '注音';
const 【注音】 = '【注音】';
const 韻部 = '韻部';
const 【韻部】 = '【韻部】';
const 譯文 = '譯文';
const 【譯文】 = '【譯文】';
const 評論 = '評論';
const 【評論】 = '【評論】';
const 校記 = '校記';
const 【校記】 = '【校記】';
const 體裁 = '體裁';
//const 行音 = '行音';
//const 平仄 = '平仄';

const 副題 = '副題';
const 異文、夾注 = '異文、夾注';
const 補充説明 = '補充説明';
const 詩文注音 = '詩文注音';
const 版本頁碼 = '版本頁碼';
const 坐標版本異文、夾注 = '坐標版本異文、夾注';

// programs
// php h:\github\Dufu-Analysis\analysis_programs\搜索程式\search.php
const 選項指令 = "要搜索甚麼？請輸入選項數字；用 exit 來結束。\n";
const 搜索程式文件夾 = "h:\\github\\Dufu-Analysis\\analysis_programs\\搜索程式\\";
const 搜索程式 = array(
// php h:\github\Dufu-Analysis\analysis_programs\搜索程式\search.php

	// 輸入漢字用
	'輸入漢字' => "", // 0
/*
	// 一般參考
	'目錄' => '',
	'全集' => '',
*/
/*	
	// 用頁碼搜索
	'頁碼→詩題'        => "請輸入頁碼:\n",
	'頁碼→詩文'        => "請輸入頁碼:\n",
	'頁碼→注音'        => "請輸入頁碼:\n", // 粵音注音
	'頁碼→譯文'        => "請輸入頁碼:\n", // 韓成武、張志民《杜甫詩全譯》
	'頁碼→〚行碼〛、詩文' => "請輸入頁碼:\n",
*/
	// 搜索頁碼
	//'詩題用字→頁碼' => "請輸入詩題用字:\n",
	//'詩文用字→頁碼' => "請輸入詩文用字:\n",
	//'詩題注音→頁碼' => "請輸入\"si1 tai4 zyu3 jam1\":\n",
	//'詩文注音→頁碼' => "請輸入\"si1 man4 zyu3 jam1\":\n",
/**/
	// 搜索注音
	//'單字→注音' => "請輸入詩文單字:\n",
	//'詩句→注音' => "請輸入詩句:\n",
	
	// 搜索詩句、坐標
	'詩文用字→詩句、〚坐標〛' => "請輸入詩文用字:\n",
	

	//'頁碼、詩文單字→〚坐標〛' => "請輸入頁碼、詩文單字:\n",
	//'生成行碼'            => "請輸入最後一個行碼:\n",
	'頁碼→〖詩句〗'        => "請輸入頁碼:\n",

	// 版本書籍用
	//'頁碼、版本簡稱→版本頁碼' => "請輸入頁碼 版本簡稱:\n",
	// 一頁可以有多首，只顯示第一首頁碼!!!
	//'版本簡稱、版本頁碼→頁碼' => "請輸入版本簡稱、版本頁碼:\n",
	// 全 地 仇 疊 今 名 朱 楊 浦 奭 蕭 默 郭 錢 粵 約 筆 譯 榷
	//'顯示版本簡稱'         => '',
	//'顯示簡稱、書名'        => '',
	//'頁碼、簡稱→詩文、注碼、注釋' => "請輸入頁碼 版本簡稱:\n",
	//'頁碼、簡稱→版本詩題' => "請輸入頁碼 版本簡稱:\n",

/*
	// 粵音注音用
	'頁碼→〚坐標〛、韻字'    => "請輸入頁碼、韻字:\n",
	'頁碼→〖詩句〗'        => "請輸入頁碼:\n",
	'頁碼→平仄'           => "請輸入頁碼:\n",
	'字→平水韻韻部'        => "請輸入單字:\n",
	'字→中古聲母'          => "請輸入單字:\n",
	'字→粵音'             => "請輸入單字:\n",
	'頁碼、簡稱→評論'        => "請輸入頁碼、版本簡稱:\n",
*/
	//'頁碼、簡稱、詞組→句注釋' => "請輸入頁碼、版本簡稱、詞組:\n",
/*
*/

	// 從詩題開始（不限字數）
/*	'以詩題用字搜索詩題'    => "請輸入詩題用字:\n", // 包含頁碼
	'以詩題用字搜索詩文'    => "請輸入詩題用字:\n",
	'以詩題用字搜索版本頁碼' => "請輸入詩題用字 版本簡稱:\n",
	'以詩題用字注音搜索詩題' => "請輸入\"si1 tai4 jung6 zi6 zyu3 jam1\":\n",
	'以詩題用字注音搜索版本頁碼' => "請輸入\"si1 tai4 jung6 zi6 zyu3 jam1\" 版本簡稱:\n",

	// 從詩文用字開始（不限字數，一句爲限）
	'以詩文用字搜索頁碼'    => "請輸入詩文用字:\n",
	'以詩文用字搜索詩題'    => "請輸入詩文用字:\n",
	'以詩文用字搜索詩句'    => "請輸入詩文用字:\n",
	'以詩文用字搜索坐標'    => "請輸入詩文用字:\n",
	'以詩文用字注音搜索詩句' => "請輸入\"si1 man4 jung6 zi6 zyu3 jam1\":\n",
	'以詩文用字注音搜索詩句，再搜索版本注釋' => "請輸入\"si1 man4 jung6 zi6 zyu3 jam1\" 版本簡稱:\n",
	// 單字!!
	'以詩文單字提取注音'    => "請輸入詩文單字:\n",
	// 完整詩句->注音
	'以詩句提取注音'       => "請輸入完整詩句:\n",
	// 顯示
	'以夾注形式顯示詩文、注釋' => "請輸入頁碼、版本簡稱:\n",
	'以注碼顯示詩文、注釋'   => "請輸入頁碼、版本簡稱:\n",
*/
	//'以坐標提取詩文' => "請輸入完整坐標:\n",               // 改成 function
	//'以頁碼版本簡稱顯示版本原文' => "請輸入頁碼、版本簡稱:\n", // 改成 function
);

const 程式後綴 = '.php';

// error msg
const 提供頁碼 = '必須提供頁碼。';
const 提供頁、簡 = '必須提供頁碼、版本簡稱。';
const 提供頁、簡、詞 = '必須提供頁碼、版本簡稱、詞組。';
const 提供題音 = '必須提供詩題用字注音。';
const 提供題、簡 = '必須提供詩題用字、版本簡稱。';
const 提供題音、簡 = '必須提供詩題用字注音、版本簡稱。';
const 提供詩題 = '必須提供詩題用字。';
const 提供詩句 = '必須提供詩句。';
const 提供詩文 = '必須提供詩文用字。';
const 提供詩題注音 = '必須提供詩題用字注音。';
const 提供詩文注音 = '必須提供詩文用字注音。';
const 提供單字 = '必須提供詩文單字。';
const 提供頁、字 = '必須提供頁碼、詩文單字。';
const 提供音、簡 = '必須提供詩文注音、版本簡稱。';
const 提供坐標 = '必須提供完整坐標。';
const 提供簡稱 = '必須提供版本簡稱。';
const 提供簡稱、頁碼 = '必須提供版本簡稱、版本頁碼。';
const 提供行碼     = '必須最後一個行碼。';

const 無結果   = '沒有結果。';
const 無頁碼   = '無此頁碼。';
const 無簡稱   = '無此簡稱。';
// 坐標
const 坐標頁碼 = '頁碼';
const 坐標首碼 = '首碼';
const 坐標行碼 = '行碼';
const 坐標句碼 = '句碼';
const 坐標字碼 = '字碼';
const 無首碼   = '無此首碼。';
const 無行碼   = '無此行碼。';
const 無句碼   = '無此句碼。';
const 無字碼   = '無此字碼。';

?>