<?php
const 杜甫資料庫 = "h:\\杜甫資料庫\\";
const 詩集文件夾 = "h:\\杜甫資料庫\\詩集\\";

const 杜甫分析文件夾  = "h:\\github\\Dufu-Analysis\\";
const 程式文件夾     = "h:\\github\\Dufu-Analysis\\analysis_programs\\";
const 杜甫文件夾     = "h:\\github\\Dufu\\";
const 杜甫全集       = 'h:\github\DuFu\杜甫全集.txt';
const 杜甫全集粵音注音 = 'h:\github\DuFu\杜甫全集粵音注音.txt';
const 目錄          = 'h:\github\DuFu\目錄.txt';

// 字符
const 分隔線 =
"\n=====================================================\n";
const 新行 = "\n";
const NL  = "\n";
const 等號 = '=';
const 坐標開括號 = '〚';
const 坐標關括號 = '〛';
const 坐標括號 = "〚〛";
const 分號 = '：'; // UNICODE!!!
const 夾注regex = '/\[\X+?]/';

// php data files
const 頁碼     = 杜甫資料庫 . '頁碼.php';
const 頁碼_路徑 = 杜甫資料庫 . '頁碼_路徑.php';
const 頁碼_詩題 = 杜甫資料庫 . '頁碼_詩題.php';
const 詩題_頁碼 = 杜甫資料庫 . '詩題_頁碼.php';
const 詩組_詩題 = 杜甫資料庫 . '詩組_詩題.php';
const 詩句_坐標 = 杜甫資料庫 . '詩句_坐標.php';
const 詩句_頁碼 = 杜甫資料庫 . '詩句_頁碼.php';
const 用字_頁碼 = 杜甫資料庫 . '用字_頁碼.php';
const 書目簡稱  = 杜甫資料庫 . '書目簡稱.php';
const 異體字    = 杜甫資料庫 . '異體字.php';
const 詩題_注音 = 杜甫資料庫 . '陳永明《杜甫全集粵音注音》\詩題_注音.php';
const 詩句_注音 = 杜甫資料庫 . '陳永明《杜甫全集粵音注音》\詩句_注音.php';
const 注音_詩句 = 杜甫資料庫 . '陳永明《杜甫全集粵音注音》\注音_詩句.php';


// 書名文件夾
const 全唐詩       = 杜甫資料庫 . "《全唐詩》\\";
const 杜詩詳註      = 杜甫資料庫 . "仇兆鰲《杜詩詳註》\\";
const 杜詩全集今注本 = 杜甫資料庫 . "張志烈主編《杜詩全集（今注本）》\\";
const 讀杜心解      = 杜甫資料庫 . "浦起龍《讀杜心解》\\";
const 杜臆         = 杜甫資料庫 . "王嗣奭《杜臆》\\";
const 杜甫全集校注   = 杜甫資料庫 . "蕭滌非主編《杜甫全集校注》\\";
const 杜甫全集粵音注音文件夾 = 杜甫資料庫 . "陳永明《杜甫全集粵音注音》\\";
const 杜甫詩全譯    = 杜甫資料庫 . "韓成武、張志民《杜甫詩全譯》\\";

// 書本部分
const 坐標 = '坐標';
const 内容 = "内容";
const 大意 = '大意';
const 行碼 = "行碼";
const 書名 = "書名";
const 版本 = "版本";
const 詩題 = "詩題";
const 詩文 = "詩文";
const 詩句 = "詩句";
const 參數 = '參數';
const 注釋 = '注釋';
const 【注釋】 = '【注釋】';
const 注音 = '注音';
const 譯文 = '譯文';
const 評論 = '評論';
const 校記 = '校記';
const 異文夾注 = '異文、夾注';
const 詩文注音 = '詩文注音';
const 版本頁碼 = '版本頁碼';

// programs
// php h:\github\Dufu-Analysis\analysis_programs\搜索程式\search.php
const 選項指令 = "要搜索甚麽？請輸入選項數字；用 exit 來結束。\n";
const 搜索程式文件夾 = "h:\\github\\Dufu-Analysis\\analysis_programs\\搜索程式\\";
const 搜索程式 = array(
	// 從頁碼開始
	'以頁碼提取詩題'       => "請輸入頁碼:\n",
	'以頁碼提取詩文'       => "請輸入頁碼:\n",
	'以頁碼提取詩文注音'    => "請輸入頁碼:\n",
	'以頁碼版本簡稱提取版本頁碼' => "請輸入頁碼 版本簡稱:\n",
	'以頁碼詩文單字提取坐標' => "請輸入頁碼 詩文單字:\n",
	// 從詩題開始（不限字數）
	'以詩題用字搜索頁碼'    => "請輸入詩題用字:\n",
	'以詩題用字搜索詩題'    => "請輸入詩題用字:\n", // 包含頁碼
	'以詩題用字搜索詩文'    => "請輸入詩題用字:\n",
	'以詩題用字搜索版本頁碼' => "請輸入詩題用字 版本簡稱:\n",
	'以詩題用字注音搜索詩題' => "請輸入\"si1 tai4 jung6 zi6 zyu3 jam1\":\n",
	'以詩題用字注音搜索版本頁碼' => "請輸入\"si1 tai4 jung6 zi6 zyu3 jam1\" 版本簡稱:\n",
	// 從詩文用字開始（不限字數，一句爲限）
	'以詩文用字搜索頁碼'    => "請輸入詩文用字:\n",
	'以詩文用字搜索詩題'    => "請輸入詩文用字:\n",
	'以詩文用字搜索詩句'    => "請輸入詩文用字:\n",
	'以詩文用字搜索坐標'    => "請輸入詩文用字:\n",
	'以詩文用字注音搜索詩句' => "請輸入\"si1 man4 jung6 zi6 zyu3 jam1\":\n",
	'以詩文用字注音搜索詩句，再搜索版本注釋' => "請輸入\"si1 man4 jung6 zi6 zyu3 jam1\" 版本簡稱:\n",
	// 單字!!
	'以詩文單字提取注音'    => "請輸入詩文單字:\n",
	// 完整詩句->注音
	'以詩句提取注音'       => "請輸入完整詩句:\n",
	// 顯示
	'以夾注形式顯示詩文、注釋' => "請輸入頁碼、版本簡稱:\n",
	'以注碼顯示詩文、注釋'   => "請輸入頁碼、版本簡稱:\n",
);
const 程式後綴 = '.php';

// error msg
const 提供頁、簡 = '必須提供頁碼、版本簡稱。';
const 提供題、簡 = '必須提供詩題用字、版本簡稱。';
const 提供題音、簡 = '必須提供詩題注音、版本簡稱。';
const 提供詩題 = '必須提供詩題用字。';
const 提供詩句 = '必須提供詩句。';
const 提供詩文 = '必須提供詩文用字。';
const 提供詩文注音 = '必須提供詩文用字注音。';
const 提供單字 = '必須提供詩文單字。';
const 提供音、簡 = '必須提供詩文注音、版本簡稱。';
const 無結果   = '沒有結果。';
const 無頁碼   = '無此頁碼。';
const 無簡稱   = '無此簡稱。';

?>