<?php
/*
php  H:\github\Dufu-Analysis\analysis_programs\生成近體詩出對句平仄頻率.php

Array
(
    [仄仄平平仄，平平仄仄平] => 1062
    [平仄平平仄，平平仄仄平] => 651
    [仄平平仄仄，平仄仄平平] => 476
    [仄平平仄仄，仄仄仄平平] => 407
    [平平平仄仄，仄仄仄平平] => 367
    [平平平仄仄，平仄仄平平] => 232
    [平平仄平仄，仄仄仄平平] => 144
    [平平仄仄仄，仄仄仄平平] => 138
    [平平仄平仄，平仄仄平平] => 100
	
    [仄仄仄平仄，平平平仄平] => 80
    [平平仄仄仄，平仄仄平平] => 62
    [平仄仄平仄，平平平仄平] => 37
    [仄仄平平仄，平平平仄平] => 28
    [平仄平平仄，平平平仄平] => 22
    [平仄仄仄仄，平平平仄平] => 14
    [仄仄仄平仄，仄平平仄平] => 14
    [仄仄平仄仄，平平平仄平] => 14
	
    [仄仄仄平平，平平仄仄平] => 13
    [仄平仄平仄，平仄仄平平] => 12
    [仄平仄仄仄，仄仄仄平平] => 12
    [平仄仄平平，平平仄仄平] => 11
    [仄平仄平仄，仄仄仄平平] => 11
    [平仄仄平仄，仄平平仄平] => 10
    [仄平仄仄仄，平仄仄平平] => 10
    [平仄仄平仄，平平仄仄平] => 8
    [仄仄平平仄，仄平平仄平] => 6
    [仄仄仄仄仄，平平平仄平] => 6
    [平平仄仄平，仄仄仄平平] => 6
    [仄仄仄平平，平平平仄平] => 5
    [仄平仄平仄，仄仄平平平] => 4
    [平平仄仄平，平仄仄平平] => 4
    [仄仄仄平仄，平平仄仄平] => 4
    [平仄仄仄仄，仄平平仄平] => 4
    [仄仄平仄仄，仄仄仄平平] => 4
    [仄仄平仄仄，仄平平仄平] => 4
    [平平仄仄仄，仄仄平平平] => 3
    [平仄平仄仄，仄平平仄平] => 3
    [仄平平仄仄，平仄平平平] => 3
    [平平平仄仄，仄仄平平平] => 3
    [平仄平仄仄，平平平仄平] => 3
    [平平仄平仄，仄仄平平平] => 2
    [平仄平平仄，仄平平仄平] => 2
    [仄仄平平仄，平平仄平平] => 2
    [仄仄仄仄仄，仄平平仄平] => 2
    [仄仄平平仄，平仄仄仄平] => 2
    [仄平平仄仄，仄仄平平平] => 2
    [仄平平平仄，仄仄仄平平] => 2
    [仄平仄仄仄，仄仄平平平] => 2
    [平平仄仄仄，平仄平平平] => 1
    [平平仄仄平，平仄平平平] => 1
    [仄仄平平仄，仄仄仄平平] => 1
    [仄平平仄仄，平仄仄仄平] => 1
    [仄平仄仄平，平仄仄平平] => 1
    [平平平仄仄，平仄平平平] => 1
    [仄仄平平仄，平仄仄平平] => 1
    [平仄仄平平，平仄平仄平] => 1
    [平平仄仄平，仄仄仄仄平] => 1
    [平仄平平仄，仄仄仄平平] => 1
    [平仄平平仄，平仄平仄平] => 1
    [仄平平平仄，平仄仄平平] => 1
    [平平仄仄仄，仄平仄平平] => 1
    [平仄平平仄，平平仄平平] => 1
    [仄仄平平仄，平平仄仄仄] => 1
    [仄平平平仄，平平仄仄平] => 1
    [平仄仄平仄，仄仄仄平平] => 1
    [仄平仄仄仄，平仄平平平] => 1
    [平仄平仄仄，平平仄仄平] => 1
    [仄仄平平仄，仄平仄仄平] => 1
    [仄仄仄平平，仄平平仄平] => 1
)
Array
(
    [平平仄仄平平仄，仄仄平平仄仄平] => 87
    [仄平仄仄平平仄，仄仄平平仄仄平] => 39
    [平平仄仄平平仄，平仄平平仄仄平] => 38
    [仄仄平平平仄仄，平平仄仄仄平平] => 36
    [仄平仄仄平平仄，平仄平平仄仄平] => 36
    [仄仄平平平仄仄，仄平平仄仄平平] => 27
    [仄仄仄平平仄仄，平平仄仄仄平平] => 25
    [平仄仄平平仄仄，仄平平仄仄平平] => 22
    [仄平平仄平平仄，仄仄平平仄仄平] => 22
    [仄仄仄平平仄仄，仄平平仄仄平平] => 19
    [仄仄平平仄仄平，平平仄仄仄平平] => 18
    [平平仄仄仄平平，仄仄平平仄仄平] => 18
    [平仄仄平平仄仄，平平仄仄仄平平] => 14
    [仄仄平平仄仄平，仄平平仄仄平平] => 13
    [仄仄仄平平仄仄，平平平仄仄平平] => 12
    [平仄平平平仄仄，平平仄仄仄平平] => 11
    [平仄平平平仄仄，仄平平仄仄平平] => 11
    [平平平仄平平仄，仄仄平平仄仄平] => 11
    [仄平平仄平平仄，平仄平平仄仄平] => 11
    [仄仄平平仄平仄，仄平平仄仄平平] => 10
    [平平仄仄仄平平，平仄平平仄仄平] => 10
    [仄仄平平平仄平，平平仄仄仄平平] => 9
    [平仄仄平平仄仄，平平平仄仄平平] => 9
    [平仄平平仄平仄，平平仄仄仄平平] => 9
    [仄仄平平平仄仄，平平平仄仄平平] => 9
    [仄平仄仄平平仄，仄仄平平平仄平] => 8
    [平平平仄仄平平，仄仄平平仄仄平] => 8
    [仄平平仄仄平平，仄仄平平仄仄平] => 8
    [平仄平平仄仄平，平平仄仄仄平平] => 7
    [仄仄平平平仄平，平平平仄仄平平] => 6
    [仄平平仄仄平仄，仄仄平平平仄平] => 6
    [仄平平仄仄平平，平仄平平仄仄平] => 6
    [平平仄仄平平仄，仄仄平平平仄平] => 6
    [仄平仄仄仄平仄，仄仄平平平仄平] => 5
    [仄仄平平仄仄仄，平平仄仄仄平平] => 5
    [平仄平平仄仄平，仄平平仄仄平平] => 5
    [平平仄仄平平仄，平仄平平平仄平] => 5
    [仄平仄仄仄平平，仄仄平平仄仄平] => 5
    [仄仄平平平仄平，仄平平仄仄平平] => 4
    [平仄平平平仄平，仄平平仄仄平平] => 4
    [平仄平平平仄仄，仄平仄仄仄平平] => 4
    [平仄仄平平仄仄，仄平仄仄仄平平] => 4
    [平仄平平仄仄平，平平平仄仄平平] => 4
    [仄仄平平仄平仄，平平平仄仄平平] => 4
    [仄平仄仄仄平仄，平仄平平平仄平] => 4
    [平仄平平仄仄平，仄平仄仄仄平平] => 4
    [平仄平平仄平仄，仄平平仄仄平平] => 3
    [平仄平平仄平仄，平平平仄仄平平] => 3
    [仄仄平平仄仄平，仄平仄仄仄平平] => 3
    [平平平仄平平仄，仄仄平平平仄平] => 3
    [仄仄平平仄平仄，平平仄仄仄平平] => 3
    [平平平仄平平仄，平仄平平仄仄平] => 3
    [仄仄平平平仄仄，仄平仄仄仄平平] => 3
    [仄平平仄平平仄，仄仄平平平仄平] => 3
    [平平仄仄仄平仄，平仄平平平仄平] => 3
    [平仄平平平仄平，平平仄仄仄平平] => 3
    [仄仄仄平平仄仄，仄平仄仄仄平平] => 3
	
    [平仄平平平仄仄，平平平仄仄平平] => 2
    [平仄平平仄仄仄，平仄仄仄仄平平] => 2
    [仄仄仄仄仄平仄，仄平平平平仄平] => 2
    [平平仄仄仄平平，平仄平平平仄平] => 2
    [平仄仄平仄仄仄，平平仄仄仄平平] => 2
    [平仄平平仄仄仄，仄平平仄仄平平] => 2
    [平仄平平平仄平，平平平仄仄平平] => 2
    [平平平仄仄平平，平仄平平平仄平] => 2
    [平平仄仄仄平仄，仄仄平平平仄平] => 2
    [仄仄仄平仄仄仄，仄平仄仄仄平平] => 2
    [平平平仄仄平平，仄仄平平平仄平] => 1
    [仄平平仄仄平仄，平仄仄仄平平平] => 1
    [平仄平平仄仄仄，平平仄仄仄仄平] => 1
    [仄平平平仄平仄，仄仄平仄平平平] => 1
    [仄仄平平仄仄仄，平平仄仄平平平] => 1
    [平平仄仄仄平平，平仄仄平平仄平] => 1
    [仄仄平平平仄仄，仄平平仄平平平] => 1
    [仄平仄平平仄平，仄平仄仄平平平] => 1
    [仄平平平仄仄仄，平平仄仄平平平] => 1
    [仄仄平平仄仄仄，仄平仄仄平平平] => 1
    [仄仄平仄仄平平，仄仄平平仄仄平] => 1
    [平仄平平仄仄平，平平平仄平平平] => 1
    [平仄平平仄仄仄，仄仄仄仄仄平平] => 1
    [仄仄仄仄仄平平，仄仄仄平平仄平] => 1
    [仄平仄平仄仄仄，仄仄平仄仄平平] => 1
    [仄仄仄平仄仄仄，仄平平仄平平平] => 1
    [仄仄仄平仄平仄，平平仄仄平平平] => 1
    [仄平仄仄平仄仄，仄仄仄仄平平平] => 1
    [平仄仄平仄仄仄，仄仄平平平仄平] => 1
    [平平平平平仄仄，平平平仄仄平平] => 1
    [仄平平仄仄平平，仄平仄仄平平平] => 1
    [仄平仄平平仄平，平仄平仄仄平平] => 1
    [平平仄仄仄平仄，仄仄平平仄仄平] => 1
    [仄平仄平平仄平，仄仄仄仄仄平平] => 1
    [平仄平平仄仄仄，仄平仄仄仄平平] => 1
    [仄平仄仄仄平仄，平仄平平仄仄平] => 1
    [仄仄仄仄平仄平，平平仄平平仄平] => 1
    [平平平仄仄仄仄，平仄仄平平仄平] => 1
    [仄仄仄平仄仄平，仄仄仄仄仄平平] => 1
    [平仄仄平平仄平，仄平平平仄仄平] => 1
    [平平仄平平仄平，平平仄仄仄平平] => 1
    [平仄平平平仄平，平仄仄仄仄平平] => 1
    [仄仄仄平仄仄仄，仄仄平仄仄平平] => 1
    [仄仄仄平平仄平，平仄平仄仄平平] => 1
    [仄仄平平平仄仄，仄仄平仄仄平平] => 1
    [仄仄平仄平平仄，仄仄平平平仄平] => 1
    [仄仄平平平平仄，仄平平仄仄平平] => 1
    [仄平平平仄平仄，平仄仄仄仄平平] => 1
    [平平仄平平平仄，仄仄平平仄仄平] => 1
    [仄仄仄仄平仄平，仄仄平平平仄平] => 1
    [仄平平平仄仄平，平仄仄仄仄平平] => 1
    [平平仄平平仄仄，仄仄平平平仄平] => 1
    [仄仄平仄仄仄仄，仄仄仄仄仄平平] => 1
    [平仄平平仄仄仄，平平仄仄仄平平] => 1
    [仄平仄仄平平仄，仄仄仄平平仄平] => 1
    [仄仄平平仄仄仄，仄平平仄仄平平] => 1
    [平平平仄仄平仄，仄仄平平仄仄平] => 1
    [平仄仄平平仄平，仄平平仄仄平平] => 1
    [平仄平仄仄平平，平平仄仄仄平平] => 1
    [平平平仄平仄平，仄平平仄仄平平] => 1
    [平仄平平平仄平，仄平仄仄仄平平] => 1
    [仄平平平仄仄平，平平平仄仄平平] => 1
    [平仄仄平平仄平，仄平仄仄平平平] => 1
    [仄平仄仄平仄仄，平仄仄平平仄平] => 1
    [仄平平平平仄仄，平仄平仄平平平] => 1
    [平仄平平平仄仄，仄平平仄仄仄平] => 1
    [仄平平平平仄平，平平仄仄平平平] => 1
    [仄仄平平仄平仄，平平仄仄平平平] => 1
    [仄平平仄仄平仄，平仄平平平仄平] => 1
    [平平平仄平仄仄，仄仄平平仄仄平] => 1
    [平平平仄仄平仄，仄平平仄平平仄] => 1
    [仄平仄仄仄平平，仄仄平平仄平仄] => 1
    [平仄仄仄仄平平，仄仄仄平平仄平] => 1
    [平平仄平仄仄仄，仄仄仄仄仄平平] => 1
    [平平仄仄平仄仄，平平仄平平仄平] => 1
    [仄平平仄仄平仄，仄仄平平仄仄平] => 1
    [平平仄仄平仄仄，仄仄仄平平仄平] => 1
    [仄平仄仄仄平仄，仄仄仄平平仄平] => 1
    [平平仄仄平仄仄，仄平仄平平仄平] => 1
    [平平仄平仄仄仄，仄仄平平仄平平] => 1
    [平仄仄平仄仄平，仄平平仄仄平平] => 1
    [平平仄仄平仄仄，仄仄平平平仄平] => 1
    [仄仄平平平仄平，仄仄平仄仄平平] => 1
    [平仄仄平平仄平，仄仄平仄平平平] => 1
    [平平平平平平平，平仄平仄平平平] => 1
    [平平仄仄仄平平，平仄平仄仄平平] => 1
    [仄仄仄平平仄平，平平平仄仄平平] => 1
    [仄平仄平仄仄平，平仄平平平平平] => 1
    [平平仄平仄仄仄，仄仄仄仄平平平] => 1
    [仄平平平仄仄平，仄仄平平平仄平] => 1
    [仄仄平平平仄仄，平仄平平平仄平] => 1
    [仄平平仄仄平平，平仄平平平仄平] => 1
    [仄平平平仄仄平，平仄平仄平平平] => 1
    [平平仄仄仄平仄，平仄平仄平平平] => 1
    [平平平仄平平仄，平仄平平平仄平] => 1
    [仄仄平平仄平仄，仄平仄仄仄平平] => 1
    [平仄平平仄平仄，仄仄仄平平仄平] => 1
    [仄平仄平平仄仄，平平仄仄仄平平] => 1
    [仄平仄仄平平平，仄仄平平仄仄平] => 1
    [仄仄仄仄仄仄平，平平仄平平仄平] => 1
    [平仄仄仄仄平仄，平平仄平平仄平] => 1
    [仄平平仄平仄平，仄仄平平平仄平] => 1
    [平仄平平仄仄平，仄仄平仄仄平平] => 1
    [仄平平平仄仄仄，仄平平仄仄平平] => 1
    [平平仄仄平平平，平仄平平仄仄平] => 1
    [仄仄平平仄仄平，平平平仄仄平平] => 1
    [平平平仄仄平仄，平仄平平仄仄平] => 1
    [平平仄仄平平平，仄平仄仄平平平] => 1
    [仄平仄仄平平仄，平仄平平平仄平] => 1
    [仄仄仄仄平平平，平平仄平平仄平] => 1
    [仄仄平平仄仄仄，平平仄平平仄平] => 1
    [平平仄仄平仄仄，平仄平平平仄平] => 1
    [仄平平仄仄平仄，平仄仄平平仄平] => 1
    [仄平平仄仄平仄，平仄平平仄仄平] => 1
    [平平平仄平仄平，平平仄仄仄平平] => 1
    [平平仄仄仄平仄，平仄仄平平仄平] => 1
    [仄平仄仄平仄仄，仄平平平平仄平] => 1
    [仄平仄仄仄平仄，仄仄平平仄仄平] => 1
    [仄仄平仄仄平平，仄仄平仄仄平平] => 1
    [平平仄仄平平仄，仄仄仄平平仄平] => 1
    [平仄仄平仄仄平，仄平平平平仄平] => 1
    [仄平仄仄平平平，仄仄仄仄平平平] => 1
    [平平仄仄平平仄，仄仄平平仄平平] => 1
    [仄平仄平仄仄仄，平仄平平平仄平] => 1
    [仄仄平平仄仄仄，平平平仄仄平平] => 1
    [平平平仄仄平平，平仄平平仄仄平] => 1
    [平平仄平仄仄平，平仄仄仄仄平平] => 1
    [仄仄仄平仄仄仄，平平仄仄平平平] => 1
    [平仄仄仄仄平仄，仄平平平平仄平] => 1
    [仄平仄仄仄仄仄，平平平平仄仄平] => 1
    [平平仄仄平仄仄，仄仄平仄平仄平] => 1
    [平仄仄平仄仄仄，平平仄仄平平平] => 1
    [平平仄仄仄平平，仄仄平平平仄平] => 1
    [仄仄仄仄平平平，仄平平平仄仄平] => 1
)
*/
require_once( '常數.php' );
require_once( '函式.php' );
require_once( 杜甫資料庫 . '頁碼.php' );

$五言result = array();
$七言result = array();

foreach( $頁碼 as $頁 )
{
	if( file_exists( 杜甫全集粵音注音文件夾 . $頁 . 程式後綴 ) )
	{
		require_once( 杜甫全集粵音注音文件夾 . $頁 . 程式後綴 );
		
		foreach( $粵内容[ 注音 ] as $詩文 => $v )
		{
			if( is_array( $v ) )
			{
				foreach( $v as $音平仄 )
				{
					if( mb_strpos( $音平仄, '平' ) !== false )
					{
						$parts = explode( '（', $音平仄 );
						// 五言
						if( mb_strlen( $parts[ 0 ] ) == 11 )
						{
							if( !array_key_exists( $parts[ 0 ], $五言result ) )
							{
								$五言result[ $parts[ 0 ] ] = 1;
							}
							else
							{
								$五言result[ $parts[ 0 ] ] += 1;
							}
						}
						elseif( mb_strlen( $parts[ 0 ] ) == 15 )
						{
							if( !array_key_exists( $parts[ 0 ], $七言result ) )
							{
								$七言result[ $parts[ 0 ] ] = 1;
							}
							else
							{
								$七言result[ $parts[ 0 ] ] += 1;
							}
						}
					}
				}
			}
		}
	}
}
arsort( $五言result );
arsort( $七言result );
print_r( $五言result );
print_r( $七言result );

?>
