<?php
/*
php H:\github\Dufu-Analysis\analysis_programs\生成疊韻二字組合.php
Array
(
    [104] => 碁
    [105] => 剁
    [106] => 蔥
    [107] => 碪
    [108] => 豎
    [109] => 谿
    [110] => 倂
    [111] => 粧
    [112] => 牋
    [113] => 闢
    [114] => 泝
    [115] => 嵸
    [116] => 慼
    [117] => 櫃
    [118] => 榆
    [119] => 篠
    [120] => 廼
    [121] => 漵
    [122] => 鼈
    [123] => 柟
    [124] => 遶
    [125] => 蒂
    [126] => 灩
    [127] => 椶
    [128] => 醞
    [129] => 豔
    [130] => 妬
    [131] => 壠
    [132] => 鎌
    [133] => 蠟
    [134] => 溫
    [135] => 䮍
    [136] => 慽
    [137] => 𡾋
    [138] => 鸜
    [139] => 㯶
    [140] => 痺
    [141] => 瓮
    [142] => 蕚
    [143] => 韈
    [144] => 齏
    [145] => 飰
    [146] => 抛
    [147] => 尫
    [148] => 餠
    [149] => 樣
    [150] => 棊
    [151] => 塚
    [152] => 冊
    [153] => 搤
    [154] => 橜
    [155] => 篲
    [156] => 癢
    [157] => 獎
    [158] => 隻
    [159] => 𪃩
    [160] => 噉
    [161] => 𩦺
    [162] => 峩
    [163] => 犁
    [164] => 躭
    [165] => 甖
    [166] => 韁
    [167] => 謠
    [168] => 樝
    [169] => 鎁
    [170] => 愍
    [171] => 𤞣
    [172] => 岩
    [173] => 吊
    [174] => 侷
    [175] => 曁
    [176] => 韀
    [177] => 騈
    [178] => 秔
    [179] => 虱
    [180] => 㸌
    [181] => 蝟
    [182] => 麼
    [183] => 磵
    [184] => 齎
    [185] => 坏
    [186] => 櫐
    [187] => 燿
    [188] => 𥷑
    [189] => 餬
    [190] => 踘
    [191] => 楠
    [192] => 儛
)
*/
require_once( '常數.php' );
require_once( '函式.php' );
require_once( 字_韻部 );
require_once( 杜甫資料庫 . '二字組合_坐標.php' );
require_once( 杜甫資料庫 . '用字_頻率.php' );

$result = array();
$用字s = array_keys( $用字_頻率 );

//print_r( $用字s );


foreach( $用字s as $字 )
{
	if( !array_key_exists( $字, $字_韻部 ) )
	{
		array_push( $result, $字 );
	}
}
print_r( $result );

/*
foreach( $二字組合_坐標 as $二字組合 => $坐標 )
{
	$一 = mb_substr( $二字組合, 0, 1 );
	$二 = mb_substr( $二字組合, 1, 1 );
	$一韻部 = $字_韻部[ $一 ];
	$二韻部 = $字_韻部[ $二 ];
	$同韻   = array_intersect( $一韻部, $二韻部 );
	
	if( sizeof( $同韻 ) > 0 )
	{
		$result[ $二字組合 ] = $坐標;
	}
}
print_r( $result );
*/
$code = '';
$code = "<?php
/*
生成：本文檔用 PHP 生成。
程式：生成疊韻二字組合.php
說明：疊韻二字組合。
*/
\$疊韻二字組合=array(\n" . $code . ");\n?>";
//file_put_contents( 杜甫資料庫 . '三字組合排序頻率.php', $code );
?>
