<?php
/*
php h:\github\Dufu-Analysis\analysis_programs\體裁數字.php

997
    [五絕] => 8
    [七絕] => 22
    [五律] => 424
    [七律] => 104
    [五排] => 99
    [七排] => 3
    [五古] => 211
    [七古] => 126
458
    [五絕] => 23
    [七絕] => 81
    [五律] => 204
    [七律] => 43
    [五排] => 3
    [七排] => 0
    [五古] => 77
    [七古] => 27
1455
    [五絕] => 31
    [七絕] => 103
    [五律] => 628
    [七律] => 147
    [五排] => 102
    [七排] => 3
    [五古] => 288
    [七古] => 153 (-1)
*/
require_once( "常數.php" );
require_once( "函式.php" );
require_once( 頁碼 );

$result = array(
	'五絕' => 0,
	'七絕' => 0,
	'五律' => 0,
	'七律' => 0,
	'五排' => 0,
	'七排' => 0,
	'五古' => 0,
	'七古' => 0
);

foreach( $頁碼 as $頁 )
{
	require_once( 杜甫全集粵音注音文件夾 . $頁 . 程式後綴 );
	echo $頁, NL;
	if( !is_array( $粵内容[ 體裁 ] ) )
	{
		$result[ $粵内容[ 體裁 ] ] += 1;
	}
	else
	{
		foreach( $粵内容[ 體裁 ] as $坐 => $體 )
		{
			$result[ $體 ] += 1;
		}
	}
}

print_r( $result );
?>