<?php
/*
php h:\github\Dufu-Analysis\analysis_programs\搜索程式\以注碼顯示詩文、注釋.php 0003 仇
=>
望嶽[1]

岱宗[2]夫如何。齊魯[3]青未了[4]。
造化[5]鍾[6]神秀。陰陽割昏曉[7]。
盪胸生曾雲[8]。決眥[9]入歸鳥[10]。
會當凌絕頂[11]。一覽[12]眾山小[13]。

【注釋】
[1]鶴注。公壯遊詩云忤下考功第。放蕩齊趙間。乃在開元二十四年後。當是其時作。元和郡縣志。㤗山一曰岱宗。在兗州乾封縣西北三十里。
[2]岱宗：虞書。東巡狩。至於岱宗。前漢郊祀志。岱宗。泰山也。鄭昻曰。王者升中告代必於此山。又是山為五嶽之長。故曰岱宗。
[3]齊魯：史記貨殖傳。泰山之陽則魯。其陰則齊。
[4]青未了：子夜歌。寒衣尙未了。
[5]造化：莊子。造化之所始。陰陽之所變。
[6]鍾：左傳。天鍾美於是。鍾。聚也。
[7]陰陽割昏曉：老子。大制不割。割。分也。孫綽天台賦序。天台者。山嶽之神秀。曹輔佐對。大人達觀。任化昏曉。徐增云。山後為陰。日光不到故易昏。山前為陽。日光先臨故易曉。朱注。封禪記。泰山東隅有日觀峰。雞鳴時見日出 。長三丈。即割昏曉之義。
[8]盪胸生曾雲：張衡南都賦。淯水盪其胸。馬融廣成頌。動盪胸臆。公羊傳。觸石而出。膚寸而合。不崇朝而徧天下者。泰山之雲也。雲氣瀰漫飄蕩。如疊浪層波。對之心胸若揺。庾肩吾詩。層雲霾峻嶺。
[9]決眥：曹植冬獵篇。張目决眥。决。開也。眥。目眶也。
[10]歸鳥：曹植詩。歸鳥赴喬林。
[11]絕頂：周王褒詩。絶頂日猶晴。沈約詩。絶頂復孤圓。
[12]一覽：世說。王珣曰。若使阡陌條暢。則一覽而盡。
[13]眾山小：楊子法言。登東嶽者。然後知衆山之峛崺也。

php h:\github\Dufu-Analysis\analysis_programs\搜索程式\以注碼顯示詩文、注釋.php 0003 今
=>
望嶽

岱宗[1]夫[2]如何。齊[3]魯[4]青[5]未了[6]。
造化[7]鍾[8]神秀[9]。陰陽[10]割[11]昏曉。
盪胸生曾[12]雲。決眥[13]入歸鳥。
會當[14]凌[15]絕頂[16]。一覽眾山小[17]。

【注釋】
[1]岱宗：泰山。宗，長。泰山爲五嶽之長。
[2]夫：指代詞。
[3]齊：春秋國名。在泰山之北。
[4]魯：春秋國名。在泰山之南。
[5]青：青鬱的山色。
[6]未了：沒完，未盡。
[7]造化：天地，大自然。
[8]鍾：集聚，專注。
[9]神秀：指山勢景色的奇異超絕。
[10]陰陽：山之南北二面。
[11]割：分割，劃分，區別。
[12]曾：同層。
[13]決眥：眥，眼眶。形容張目極視的樣子。
[14]會當：一定要。
[15]凌：登臨。
[16]絕頂：山的頂峯。
[17]眾山小：此化用《孟子·盡心上》「孔子登東山而小魯，登泰山而小天下」之意。
*/
require_once( "h:\\github\\Dufu-Analysis\\analysis_programs\\常數.php" );
require_once( "h:\\github\\Dufu-Analysis\\analysis_programs\\函式.php" );
require_once( 杜甫資料庫 . "書目簡稱.php" );
require_once( 杜甫資料庫 . "頁碼.php" );
require_once( 杜甫資料庫 . "頁碼_詩題.php" );

if( sizeof( $argv ) != 3 )
{
	echo "必須提供頁碼、版本簡稱。", "\n";
	exit;
}
$result = array();
$頁 = trim( $argv[ 1 ] );

if( !in_array( $頁, $頁碼 ) )
{
	echo "頁碼不存在。\n";
	exit;
}

$簡稱 = trim( $argv[ 2 ] );
$書名 = $書目簡稱[ '=' . $簡稱 ];
$默認路徑 = 詩集文件夾 . $頁 . 程式後綴;
$版本路徑 = 杜甫資料庫 . $書名 . "\\" . $頁 . 程式後綴;
$陣列名 = "${簡稱}内容";
require_once( $默認路徑 );
require_once( $版本路徑 );

$詩題 = $内容[ 詩題 ];
$詩文 = str_replace( $頁, '', implode( "\n", array_values( $内容[ 行碼 ] ) ) );
$注釋s = $$陣列名[ 注釋 ];
$注s = array();
$count = 1;

foreach( $$陣列名[ 注釋 ] as $坐 => $注 )
{
	if( $坐 == "〚${頁}:1〛" )
	{
		$詩文 = str_replace( $詩題, $詩題 . "[1]", $詩文 );
		$注s[ $count ] = "[$count]" . $注;
		$count = 2;
		continue;
	}
	$注s[ $count ] = "[$count]" . $注;
	$note = explode( "：", $注 );
	$term = $note[ 0 ];
	$詩文 = str_replace( $term, $term . "[${count}]", $詩文 );
	$count++;
	
}
print_r( $詩文 );
echo "\n\n【注釋】\n";
foreach( array_values( $注s ) as $注 )
{
	echo $注, "\n";
}
?>