<?php
/*
php h:\github\Dufu-Analysis\analysis_programs\搜索程式\以詩題用字搜索詩文.php 岳
=> 
Array
(
    [1144 望岳] => 西岳崚嶒竦處尊。諸峯羅立如兒孫。安得仙人九節杖。拄到玉女洗頭盆。車箱入谷無歸路。箭栝通天有一門。稍待秋風涼冷後。高尋白帝問眞源。
    [5792 望岳] => 南岳配朱鳥。秩禮自百王。欻吸領地靈。鴻洞半炎方。邦家用祀典。在德非馨香。巡守何寂寥。有虞今則亡。洎吾隘世網。行邁越瀟湘。渴日絕壁出。漾舟清光旁。祝融五峯尊。峯峯次低昂。紫蓋獨不朝。爭長嶪相望 。恭聞魏夫人。羣仙夾翱翔。有時五峯氣。散風如飛霜。牽迫限修途。未暇杖崇岡。歸來覬命駕。沐浴休玉堂。三歎問 府主。曷以贊我皇。牲璧忍衰俗。神其思降祥。
    [1642 寄岳州賈司馬六丈、巴州嚴八使君兩閣老五十韻] => 衡岳啼猿裏。巴州鳥道邊。故人俱不利。謫宦兩悠然。開闢乾坤正。榮枯雨露偏。長沙才子遠。釣瀨客星懸。憶昨趨行殿。殷憂捧御筵。討胡愁李廣。奉使待張騫。無復雲臺 仗。虛修水戰船。蒼茫城七十。流落劍三千。畫角吹秦晉。旄頭俯澗瀍。小儒輕董卓。有識笑苻堅。浪作禽塡海。那將 血射天。萬方思助順。一鼓氣無前。陰散陳倉北。晴熏太白巓。亂麻屍積衞。破竹勢臨燕。法駕還雙闕。王師下八川。 此時霑奉引。佳氣拂周旋。貔虎開金甲。麒麟受玉鞭。侍臣諳入仗。廏馬解登仙。花動朱樓雪。城凝碧樹煙。衣冠心慘 愴。故老淚潺湲。哭廟悲風急。朝正霽景鮮。月分梁漢米。春得水衡錢。內蕊繁於纈。宮莎軟勝綿。恩榮同拜手。出入 最隨肩。晚著華堂醉。寒重繡被眠。轡齊兼秉燭。書枉滿懷牋。每覺昇元輔。深期列大賢。秉鈞方咫尺。鎩翮再聯翩。 禁掖朋從改。微班性命全。青蒲甘受戮。白髮竟誰憐。弟子貧原憲。諸生老伏虔。師資謙未達。鄕黨敬何先。舊好腸堪 斷。新愁眼欲穿。翠乾危棧竹。紅膩小湖蓮。賈筆論孤憤。嚴詩賦幾篇。定知深意苦。莫使眾人傳。貝錦無停織。朱絲 有斷絃。浦鷗防碎首。霜鶻不空拳。地僻昏炎瘴。山稠隘石泉。且將棋度日。應用酒爲年。典郡終微眇。治中實棄捐。 安排求傲吏。比興展歸田。去去才難得。蒼蒼理又玄。古人稱逝矣。吾道卜終焉。隴外翻投迹。漁陽復控弦。笑爲妻子 累。甘與歲時遷。親故行稀少。兵戈動接聯。他鄕饒夢寐。失侶自迍邅。多病加淹泊。長吟阻靜便。如公盡雄俊。志在 必騰騫。
    [5667 泊岳陽城下] => 江國踰千里。山城僅百層。岸風翻夕浪。舟雪灑寒燈。留滯才雖盡。艱危氣益增。圖南未可料。變化有鯤鵬。
    [5673 登岳陽樓] => 昔聞洞庭水。今上岳陽樓。吳楚東南坼。乾坤日夜浮。親朋無一字。老病有孤舟。戎馬關山北。憑軒涕泗流。
    [5680 陪裴使君登岳陽樓] => 湖闊兼雲霧。樓孤屬晚晴。禮加徐孺子。詩接謝宣城。雪岸叢梅發。春泥百草生。敢違漁父問。從此更南征。
    [5689 過南岳入洞庭湖] => 洪波忽爭道。岸轉異江湖。鄂渚分雲樹。衡山引舳艫。翠芽穿裛蔣。碧節吐寒蒲。病渴身何去。春生力更無。壤童犂雨雪。漁屋架泥塗。攲側風帆滿。微冥水驛孤。悠悠迴赤壁。浩浩略蒼梧。帝子留遺恨。 曹公屈壯圖。聖朝光御極。殘孽駐艱虞。才淑隨廝養。名賢隱鍛爐。邵平元入漢。張翰後歸吳。莫怪啼痕數。危檣逐夜 烏。
    [5732 岳麓山道林二寺行] => 玉泉之南麓山殊。道林林壑爭盤紆。寺門高開洞庭野。殿腳插入赤沙湖。五月寒風冷佛骨。六時天樂朝香爐。地靈步步雪山草。僧寶人人滄海珠。塔劫宮牆壯麗敵。香廚松道清涼俱。蓮花交響共命鳥。金 牓雙迴三足烏。方丈涉海費時節。玄圃尋河知有無。暮年且喜經行近。春日兼蒙暄暖扶。飄然斑白身奚適。旁此煙霞茅 可誅。桃源人家易制度。橘洲田土仍膏腴。潭府邑中甚淳古。太守庭內不喧呼。昔遭衰世皆晦迹。今幸樂國養微軀。依 止老宿亦未晚。富貴功名焉足圖。久爲謝客尋幽慣。細學何顒免興孤。一重一掩吾肺腑。山鳥山花吾友于。宋公放逐曾 題壁。物色分留與老夫。
)
*/
require_once( "h:\\github\\Dufu-Analysis\\analysis_programs\\常數.php" );
require_once( "h:\\github\\Dufu-Analysis\\analysis_programs\\函式.php" );
require_once( 詩題_頁碼 );

checkARGV( $argv, 2, 提供詩題 );
$題 = trim( $argv[ 1 ] );
$result = array();
$詩題s = array_keys( $詩題_頁碼 );

foreach( $詩題s as $詩題 )
{
	if( mb_strpos( $詩題, $題 ) !== false )
	{
		$頁碼 = $詩題_頁碼[ $詩題 ];
		if( is_string( $頁碼 ) )
		{
			require_once( 詩集文件夾 . $頁碼 . 程式後綴 );
			$result[ $頁碼 . ' ' . $詩題 ] = $内容[ 詩文 ];
		}
		elseif( is_array( $頁碼 ) )
		{
			foreach( $頁碼 as $頁 )
			{
				require_once( 詩集文件夾 . $頁 . 程式後綴 );
				$result[ $頁 . ' ' . $詩題 ] = $内容[ 詩文 ];
			}
		}
	}
}
if( sizeof( $result ) == 0 )
{
	array_push( 無結果 );
}
print_r( $result );
?>