<?php
/*
此程式只使用於像郭知達《新刊校定集注杜詩》一類的版本；這些版本的注釋都是完整詩句的注釋！！！
此程式的主要目的是回復一個版本原來的面貌。

php h:\github\Dufu-Analysis\analysis_programs\搜索程式\以頁碼版本簡稱顯示版本原文.php 0276 郭
=>
奉贈韋左丞丈二十二韻【注。鮑文虎云。韋濟。韋嗣立子。天寶中。授尚書左丞。史有傳附嗣立後。】

紈袴不餓死【前漢班氏叙傳曰。王鳯薦班伯冝勸學。召見宴昵殿。上方鄉學。鄭寛中、張禹朝夕入說尚書、論語於金華 殿中。詔伯受焉。數年。金華之業絶。出與王、許子弟爲羣。在於綺𥜗紈袴之間。非其好也。晉灼曰。白綺之𥜗。氷紈 之袴也。師古曰。紈。素也。綺。今之細綾也。並貴戚子弟之服。朱買臣妻曰。如公等終餓死於溝中耳◯趙云。梁任昉 奏彈劉整云。以前代外戚。仕因紈袴。晉束皙云。丹墀歩紈袴之童。東野遺白㒹之叟。莊子云。伯夷、叔齊。餓死首陽 之山。史記云。伯夷、叔齊。積仁㓗行。如此而餓死。前漢周亞夫傳。許負相之。曰。君後九年而餓死。鄧通傳。上使 善相人者相通。曰當貧餓死】。儒冠多誤身【莊子曰。儒者冠圜冠者。知天時。儒行曰。冠章甫之冠。前漢麗食其傳。 沛公不喜儒。諸客冠儒冠來者。沛公輒解其冠溺其中。趙云。此篇雖古詩二十二韻。而第二字平側相次。又多對偶。紈 袴不餓死。言貴冨者之享福禄。儒冠多誤身。言爲士者之易貧賤。公詩又曰。有儒愁餓死。則不餓死之反矣。又曰。儒 術豈謀身。亦此之謂也】。丈人試靜聽。賤子請具陳【易。師。貞丈人吉。注。丈人。嚴荘之稱。應璩詩。避席跪自陳 。賤子實空虚。鮑照東武吟。主人且勿喧。賤子歌一言◯趙云。呉越春秋載伍子胥謂漁父曰。性命屬天。今屬丈人。此 呼人爲丈人矣。劉伯倫酒德頌。有熟視不見太山之形。靜聽不聞雷霆之聲。蜀志許靖與曺公書云。豈可具陳。古詩。歡 樂難具陳。𠀍有託名東坡事實。輙云。毛遂有言。賤子一一具陳之。以爲渾語。却不引出何書。其全秩引類皆如此。非 特浼吾杜公。又浼蘇公而罔無識。眞大雅之厄。學者之不幸也】。甫昔少年日【賈誼。洛陽年少◯趙云。沈休文別范安 成云。平生少年日】。早充觀國賔【易。觀國之光。利用賔于王◯趙云。充字。晁錯傳。以臣充賦】。讀書破萬卷。下 筆如有神【三輔決録。蔡邕傳。不妄下筆。魏文帝論云。傳武仲下筆。不能自休。孔文舉表。性與道合。思若有神◯趙 云。梁孝元帝之敗。焚圖書十四萬巻。曰。讀書萬巻。猶有今日。故焚之。中著一破字。則字著力而新竒矣】。賦料揚 雄敵【揚雄有長楊、甘泉等賦◯趙云。雄傳云。顧常好辭賦。每擬相如。故公於賦則言敵揚雄】。詩看子建親【增添。 曹植。字子建。封陳思王。善屬文。著洛神賦。責躬公讌等詩。後人謂天下才共一石。子建獨得八斗◯趙云。鍾嶸爲詩 品。其品子建詩云。植詩原出於國風。氣骨髙竒。辭彩華茂。超越今古。卓爾不羣。故公於詩言親子建也。親字。親近 之親。言與之近也】。李邕求識面【李邕。廣陵江都人。父善。嘗注文選。邕少知名長安。李嶠等薦邕詞髙行直。堪爲 諫官。由是召拜左拾遺。玄宗東封。獻賦稱旨。後進不識。京洛阡陌聚觀。以爲古人。或傳眉目有異。衣冠望風尋訪。 門巷填隘。齊神武自太原來朝。見宋遊道曰。常聞其名。今日始識其面◯師云。按新唐史杜本傳言。公少貧不自振。客 齊趙呉楚間。李邕竒其才。先徃見之◯趙云。新書誤矣。蓋惑於後篇。有陪李北海宴歴下亭而言之耳。殊不知公在洛陽 時。李邕先與相見。其後邕爲北海太守。遇公於齊州。又相見。至青州又相見。何以明之。陪李北海宴歴下亭。則相見 於齊州。蓋歴下亭在齊州也。八哀詩。於李邕篇云。伊昔臨淄亭。酒酣託末契。則相見於青州。蓋臨淄亭在青州也。又 云重叙東都別。朝隂改軒砌。則追言之陽相見事。蓋洛陽則東都也。豈不先識面於洛陽。而在齊地再相見乎。則新唐書 之誤。以再見爲始識面矣】。王翰願卜隣【唐王翰。并州𣈆陽人。日聚英豪。恣爲歡賞。文士祖詠、杜華嘗在座◯師云 。左傳。非宅是卜。惟隣是卜】。自謂頗挺出。立登要路津【古詩。何不采高足。先據要路津◯趙云。曹子建云。人人 自謂握靈虵之珠。吕凱與雍闓檄云。諸葛丞相。英材挺出】。致君堯舜上。再使風俗淳【魏杜恕舉明主於唐虞之上◯増 添。孟子。伊尹曰。豈若使是君爲堯舜之君。魏應璩與弟君胄書。思致君於有虞矣◯趙云。嵇康傳。鍾㑹欲害康。曰。 冝因釁除之。以淳風俗】。此意竟蕭條。行歌非隱淪【前漢。朱買臣。家貧。好讀書。不治産業。艾薪樵。賣給食。擔 束薪。行且誦書。其妻亦負戴相隨。數止買臣毋歌謳道中。買臣益疾歌。妻羞之。求去。恚怒曰。如公等餓死溝中耳。 何能冨貴。買臣不能留。即聽去。其後買臣獨行歌道中。負薪墓間。宋顔延年詠嵇中散詩曰。立俗遷流議。尋山結隱淪 。謝朓敬亭詩。隱淪旣己託。鮑照詩。孤賤長隱淪。謝靈運。旣枉隱淪客◯趙云。鮑照荅客篇。此意更堅滋。鮑照發後 渚詩有蕭條背鄉心。列子載林類年且百嵗。拾穗行歌。張湛注云。古之隱者也。舊注却引朱買臣行歌道中負薪。此乃窮 困悲歌耳。與非隱淪之義不相接。桓譚新論曰。天下神人五。一曰神仙。一曰隱淪。郭璞江賦。有納隱淪之列眞。舊注 引顔延年、謝朓、鮑照、謝靈運詩、皆在新論、江賦之後。此不知本始。是謂無祖者也。𠀍說。周覬何如庾亮。覬曰。 蕭條方外。亮不如臣】。騎驢三十載。旅食京華春【任昉詩。結歡三十載。生死一交情。陶潜。閑居三十載◯趙云。後 漢李尤騎驢馳村。狐兎驚走。魏文帝與呉質書。旅食南館。郭景純遊仙詩曰。京華遊俠窟。謝靈運齋中讀書詩曰。昔余 遊京華。京華繁冨之地。而當春時。尤為繁冨。於此旅食。亦不能爲樂矣】。朝扣富兒門。暮隨肥馬塵【鮑照詩。結交 多貴門。出入冨兒鄰◯趙云。論語。乗肥馬】。殘杯與冷炙。到處潛悲辛【顔氏家訓。處之下座。以取殘杯冷炙◯趙云 。鮑照野鵝賦云。對鐘鼓之悲辛】。主上頃見徵。歘然欲求伸【六韜曰。歘然而徃。易曰。尺蠖之屈。以求伸◯趙云。 官韻。歘字注云。有所吹起皃。神仙傳。王母降。大茅君歌曰。駕我八景輿。歘然入玉清。又荘子。庚桑楚篇。出無本 。入無竅。注云。歘然自生。非有本。歘然自死。非有根。又法華經有歘然火起之語】。青冥却垂翅。蹭蹬無縱鱗【後 漢馮異傳。始雖垂翅回谿。終能奮翼澠池。王褒頌曰。沛乎若巨魚縱大壑。海賦。蹭蹬窮波。失勢貌◯趙云。屈原悲回 風云。據青冥而攄虹。玉逸九思曰。玄鸖兮高飛。增逝兮青冥。注。青冥。雲也。此兩句以魚鳥爲喻。一反一正。可以 爲句法。宋玉九辯。悲蹭蹬而無歸】。甚愧丈人厚。甚知丈人眞【范元寶詩眼曰。必言所以見韋者。於是有厚媿眞知之 句。所以眞知者。爲傳誦其詩也◯趙云。厚言其相待之厚。蓋如後漢云。所以慰藉之甚厚。眞言其懷抱之眞。蓋如莊子 云。其爲人也眞。厚則相親愛。眞則不藏善。乃所以爲每每誦杜公佳句也。此厚與眞之義甚明。詩眼所謂。却成杜公厚 自慙媿於韋。杜公眞實能知韋之賢耳。非是。蓋不省厚眞字。是詩字之足。只單著一字爲句。且用押韻。而字自有力。 其義煥然也】。每於百寮上。猥誦佳句新【趙云。左傳。同官爲寮。書。百寮師師。誦佳句於同寮。是時公已召試賜官 也。𠀍説載孫興公作天台賦，成以示范榮期。每至佳句。輙云。應是我軰語。而誦佳句三字。則隋煬帝善屬文。不欲人 出其右。王胄死。帝誦其佳句云。庭草無人隨意緑。復能作此語耶】。竊効貢公喜【前漢貢禹與王陽爲友。𠀍稱王陽在 位。貢禹彈冠。言其取舍同也◯杜補遺。劉孝摽廣絶交論曰。王陽登而貢公喜。子美贈沈八丈東美除膳部員外郎又云。 徒懐貢公喜。哭韋大夫之晉詩亦云。貢喜音容間】。難甘原憲貧【仲尼弟子傳。原憲在草澤中。子貢相衛而結駟連騎。 排藜藿。入窮閻。過謝原憲。憲攝敝衣冠見之。子貢曰。夫子豈病乎。原憲曰。吾聞之。無財謂之貧。學道而不能行謂 之病。若憲。貧也。非病也。子貢慙而去◯趙云。沈佺期傷王學士詩云。原憲貧無怨。顔回樂自持】。焉能心怏怏【趙 云。呉越春秋。呉王僚之母謂王曰。公子光心氣怏怏。常有媿恨之色。舊注却引韓信周亞夫傳。乃鞅鞅字。又不連心字 。非公本意所引用耳】。秖是走踆踆【踆踆。行走皃。張平子西京賦言𠆸戲曰。大雀踆踆】。今欲東入海。即將西去秦 。尙憐終南山。回首清渭濵。常擬報一飯。况懷辭大臣。白鷗没[一作波]浩蕩。萬里誰能馴。
*/
require_once( "h:\\github\\Dufu-Analysis\\analysis_programs\\常數.php" );
require_once( "h:\\github\\Dufu-Analysis\\analysis_programs\\函式.php" );
//require_once( 書目簡稱 );

function 以頁碼版本簡稱顯示版本原文(
	string $頁碼, array $默認陣列, array $版本陣列 ) : string
{
	$詩句s = array();
	$坐標版本異文、夾注 = $版本陣列[ 版本 ][ 坐標版本異文、夾注 ];
	$異夾s = array();
	$注釋s = array();
	
	//print_r( $版本陣列 );
	
	foreach( $坐標版本異文、夾注 as $坐標 => $版本異文、夾注 )
	{
		$parts = explode( '〗', $版本異文、夾注 );
		
		//$異夾s[ trim( $parts[ 0 ], '〖' ) ] = $parts[ 1 ];
		$異夾s[ str_replace( '〖', '', $parts[ 0 ] ) ] = $parts[ 1 ];
	}
	//print_r( $異夾s );
	$版本詩文 = '';
	
	if( array_key_exists( 詩題, $版本陣列 ) )
	{
		$版本詩文 = $版本陣列[ 詩題 ];
	}
	else
	{
		$版本詩文 = $默認陣列[ 詩題 ];
	}
	
	foreach( $版本陣列[ 注釋 ] as $坐標 => $注釋 )
	{
		if( $頁碼 == '0076' )
		{
			echo $坐標, NL;
			echo $注釋, NL;
		}
		$parts = explode( 冒號, $注釋 );
		
		if( sizeof( $parts ) == 1 ) // 題注
		{
			$版本詩文 .= '【' . $parts[ 0 ] . '】';
		}
		elseif( sizeof( $parts ) == 2 )
		{
			if( $頁碼 == '0076' )
			{
				echo $parts[ 0 ], NL;
				echo $parts[ 1 ], NL;
				
			}
			
			$注釋s[ $parts[ 0 ] ] = $parts[ 1 ];
		}
	}
	
	//print_r( $注釋s );
	$版本詩文 = $版本詩文 . NL . NL;

	
	//print_r( $注釋s );

	foreach( $默認陣列[ 詩句 ] as $句 )
	{
		if( array_key_exists( $句, $異夾s ) )
		{
			$版本詩文 .= $異夾s[ $句 ];
		}
		else
		{
			$版本詩文 .= $句;
		}
		
		if( array_key_exists( $句, $注釋s ) )
		{
			//$版本詩文 .= '【' . trim( $注釋s[ $句 ], '。' ) . '】';
			$content = $注釋s[ $句 ];
			
			if( str_ends_with( $注釋s[ $句 ], '。' ) )
			{
				$content = mb_substr( $注釋s[ $句 ], 0, mb_strlen( $注釋s[ $句 ] ) - 1 );
			}
			$版本詩文 .= '【' .  $content . '】';
		}
		$版本詩文 .= '。';
	}
	
	$版本詩文 = $版本詩文 . NL . NL;
	return $版本詩文;

}
?>