<?php

/*
生成：本文檔用 PHP 生成。
程式：生成書本注釋.php
說明：把校記集中在一個文檔裏。
*/
$仇兆鰲《杜詩詳註》校記=array(
"〚0229:〛"=>"1. 四庫本缺所有錢箋。
2. 「邊庭流血成海水」引《杜臆》，「董延光自請」，四庫本誤作「董延光白請」。",

"〚0241:〛"=>"1. 「我始爲奴僕」注，「封常清始爲高仙芝傔」，四庫本作「封常清始爲高仙芝僕」。
2. 「幾時樹功勳」注，「錢引《通鑑》」，四庫本作「有引《通鑑》」。
3. 「列國自有疆」注，「所謂列國有疆也」，四庫本作「所謂列國有彊也」。
4. 「繫頸授轅門」注，「《史·高帝紀》：秦王子嬰，繫頸以組」，四庫本「組」作「紐」。",

"〚0262:〛"=>"大意中「疏懶任性」，中華書局版作「疏懶在性」，不從。「傷己而幷憂世矣」，天津圖書館藏本、芸生堂本同；四庫本作「望諸子之推解也」。",

"〚0266:〛"=>"大意中「言會同者騎從之盛」，天津圖書館藏本、芸生堂本同；四庫本作「言同會者騎從之盛」。",

"〚0288:〛"=>"1. 「春官驗討論」注，「隋煬帝《賜劉炫書》」四庫本「書」作「詩」。
2. 「倚風遺鶂路」注，中華書局版作「《左傳》：六鷁退飛過宋都，風也」，多一「風」字，不從。芸生堂本、四庫本、天津圖書館藏本均無「風」字。
3. 「家聲庶已存」注，「曾祖依藝始知洛之鞏縣」，四庫本「知」作「如」。",

"〚0305:〛"=>"「杜曲幸有桑麻田」注「俗云：南城韋杜，去天尺五。」芸生堂本、四庫本、天津圖書館藏本同。中華書局版「南城」作「城南」，不從。",

"〚0311:〛"=>"「多病休儒服」注：「庾信詩：茂陵忽多病」，四庫本作「庾信傳：茂陵忽多病」。",

"〚0319:〛"=>"仇兆鰲之按語「便是沾汙之漸」，芸生堂本、天津圖書館藏本同。四庫本作「便是汗汚之漸」。",

"〚0328:〛"=>"1. 「異才應間出」注「孔融表：近日路粹嚴象」，《薦禰衡表》原文同，芸生堂本、四庫本、天津圖書館藏本並缺「象」字，從中華書局版保留。
2. 郄詵，芸生堂本、四庫本、天津圖書館藏本同。中華書局版作「郤詵」。",

"〚0342:〛"=>"1. 「肌理細膩骨肉勻」注引《楚辭》：「《楚辭·招魂》：靡顏膩理。又：豐肉微骨。」，眾本同。然「豐肉微骨」，語出《大招》，非自《招魂》。從中華書局版補《大招》。
2. 「蹙金孔雀銀麒麟」注引盧肇《柘枝舞賦》：「袍蹙金而雁攲」，此爲賦之原文，中華書局版從之。眾本作「袍蹙生而雁攲」，不從。
2. 「賜名大國虢與秦」注末謂「度上巳修禊」，眾本「禊」作「褉」（從衣）。又四庫本「度」作「及」。
3. 「紫駝之峯出翠釜」注云「今俗呼爲犎」，芸生堂本、天津圖書館藏本、中華書局版「犎」並作「幇」，四庫本作「犎」。幇同幫，與動物無關。從四庫本改。
4. 「御廚絡繹送八珍」注引《周禮·膳夫》鄭玄注，鄭注引《內則》，謂八物爲：淳熬、淳母、炮豚、炮牂、擣珍、漬、熬、肝膋。（見《十三經注疏》）。中華書局版標點符號不正確，最後三物標爲「漬熬、肝、膋」。「擣珍」四庫本作「㹗珍」。",

"〚0356:〛"=>"1. 「千章夏木清」注「《漢書·貨殖傳》」，眾善本均作「《史記·貨殖傳》」；從中華書局版改。
2. 「栜樹」，四庫本作「梀樹」。
3. 「陰益食單涼」注「鄭望《善夫錄》」，各本同；中華書局版「善」作「膳」，不從。
4. 蕭滌非主編《杜甫全集校注》謂「剌船」當作「刺船」，（頁三八七）。「刺船而去」，見《莊子·雜篇·漁夫》。
5. 盧元昌評第十首：「還鄕整旆」，四庫本作「還鄕之旆」。",

"〚0409:〛"=>"1. 「甲第紛紛厭粱肉」注引《孟嘗君傳》：「今君僕妾餘粱肉」，諸本「餘」字上衍一「厭」字，原文無。中華書局版削「厭」字，從之。
2. 「日糴太倉五升米」注引《舊唐書》：「天寶十二載八月」，四庫本誤作「天寶十八載八月」。
3. 「時赴鄭老同襟期」注引高澄《與侯景書》，諸本作「梁高澄」，中華書局版改作「北齊高澄」。按《與侯景書》錄於《全北齊文》，從中華書局版作「北齊」。",

"〚0419:〛"=>"1. 「天清皇子陂」注引《十道志》：「隋改永安」，諸本同。中華書局版誤作「隋改承安」。
2. 「雨拋金鎖甲」注引《唐六典》，四庫本作「唐六書」。",

"〚0438:〛"=>"1. 「風急打船頭」注引《風俗通》：「船頭謂之舳」，諸本同。中華書局版「舳」誤作「舢」。簡體本同誤。
2. 「纜侵隄柳繫」注「庾信詩：幰拂緣堤柳」，四庫本缺「信」字。
3. 「幔卷浪花浮」注引柳䛒詩，「䛒」諸本不一，且統一碼均缺，無法標示。天津圖書館藏本上此下言；四庫本上巩下言，中華書局版同。",

"〚0443:〛"=>"1. 「沉竿續蔓深莫測」注引王粲《遊海賦》：「其深不測」，諸本並作「王粲海賦」。從中華書局版補「遊」字。
2. 「菱葉荷花靜如拭」注中有「拭淨也」，芸生堂本、天津圖書館藏本於「拭」前有「註」字，卽此爲仇註。四庫本無「註」字，只留一空格。
3. 「船舷暝戛[古怛切]雲際寺」，「戛」、「怛」俱爲入聲字；四庫本「古怛切」誤作「古恒切」。
4. 「水面月出藍田關」，詩旨云：「藍田月出，光照水中」，四庫本作：「藍田月出，光照水出」。
5. 「動影裊窕沖融間」注引木華《海賦》（見《文選》），原文作「浺瀜沆瀁」。",

"〚0456:〛"=>"1. 王粲《遊海賦》：天與水際。木華《海賦》：仿像其色。兩處諸本，包括中華書局版，均逕稱《海賦》。
2. 末段詩旨云：「末句清景，包括上段所云。」「清景」四庫本作「情景」。
3. 「知歸俗可忽」、「身退豈待官」二句之注，諸本次序顚倒。從中華書局版復原。
4. 朱鶴齡評引謝靈運詩《登江中孤嶼》「懷新道轉迥」，中華書局版誤「迥」作「迴」，簡體本誤作「回」。謝詩《入華子崗是麻源第三谷》「恆充俄頃用」，四庫本「充」作「𠑽」（「充」之異體字)；天津圖書館藏本誤作「克」。中華書局版同誤。",

"〚0557:〛"=>"「獨能無意向漁樵」注引何遜《贈范雲》，中華書局版「何遜」誤作「何孫」，簡體本同誤。",

"〚1064:〛"=>"1. 陸時雍之評引《宴戎州楊使君東樓》「勝絕驚身老」，中華書局版誤作「勝絕警身老」。簡體本同誤。
2. 「春畦亂水間」注引鮑照詩，「又詩：懸裝亂水區」，四庫本作「又云：懸裝亂水區」。",

"〚3789:〛"=>"朱注：公至夔州已經二秋，四庫本無已字。
仍堕他日之淚
見御寒者有備
《水經注》：江水歷峽，東徑新崩灘
陳澤州注杜詩白帝在東夔府在西
八句、蘆荻，點還秋景。
十餘年至一處
騫乘槎經月而至一處
公常論救房琯忤旨
而歷曆堪思也
自丹鳳門北，則有舍无殿
《子虛賦》：照燿龍鱗。
曲江池，塘開元中疏鑿爲勝境
漢蘇子卿詩故鄕夢中近邊愁酒上寬
正自古束歌舞地
象之以習水戰，在長安西南，週迴四十里。《長安志》：昆明池，在長安縣西二十里。虞茂詩：昆明池水秋色明。
每至雷雨常鳴吼，首尾皆動
回跳牽牛渚激賞鏤鯨川
唼喋其問
范季隨《陵陽先生室中語》：
水面月出闌田關
鳳集東囿，栖碧梧樹終身不去
不能爲喁喁細聲，
又曰：八首，聲韻雅暢
子獨謂不然",

);
?>