<?php
/*
require_once( dirname( __DIR__, 2 ) . DS . BIN_DIR .
	'載入坐標數據結構.php' );
*/
$行碼_副題 = 提取數據結構( 行碼_副題 );
$行碼_詩文 = 提取數據結構( 行碼_詩文 );
$句碼_詩句 = 提取數據結構( 句碼_詩句 );
$默認詩文檔碼_碼_字 = 提取數據結構( 默認詩文檔碼_碼_字 );
$一字組合_坐標 = 提取數據結構( 一字組合_坐標 );
$二字組合_坐標 = 提取數據結構( 二字組合_坐標 );
$三字組合_坐標 = 提取數據結構( 三字組合_坐標 );
$四字組合_坐標 = 提取數據結構( 四字組合_坐標 );
$五字組合_坐標 = 提取數據結構( 五字組合_坐標 );
$六字組合_坐標 = 提取數據結構( 六字組合_坐標 );
$七字組合_坐標 = 提取數據結構( 七字組合_坐標 );
$八字組合_坐標 = 提取數據結構( 八字組合_坐標 );
$九字組合_坐標 = 提取數據結構( 九字組合_坐標 );
$十字組合_坐標 = 提取數據結構( 十字組合_坐標 );
$十一字組合_坐標 = 提取數據結構( 十一字組合_坐標 );
?>