<?php

/*
生成：本文檔用 PHP 生成。
程式：生成書本注釋.php
說明：把注釋集中在一個文檔裏。
*/
$林繼中輯校《杜詩趙次公先後解輯校》注釋=array(
"〚0042:5.2.1-5〛"=>"雲臥衣裳冷：趙云：惟蔡伯世云：古作天闚，極是。惜乎知引《莊子》以管闚天而已，所以又起或者之疑。《莊子》曰：至人者上窺青天，下潛黃淵。《後漢·郅惲傳》曰：非闚天者不可與圖遠。若引此不亦明乎？◯孟浩然：雲臥晝不起。◯《百家注》引趙曰：《後漢·郅惲傳》：惲明天文曆數，仰占玄象。其說逯並（目）[曰]：非闚天者，不可與圖遠。鮑昭《升天行》有雲臥恣行天。",
"〚3789:1:5.2〛"=>"巫山巫峽氣蕭森：趙云：阮籍詩：湛湛長江水，上有楓樹林。◯巫山，以言山；巫峽，以言水。",
"〚3789:1:6.2〛"=>"塞上風雲接地陰：趙云：夔以白帝城爲塞，故云塞上。",
"〚3789:1:7.2〛"=>"孤舟一繫故園心：趙云：叢菊兩開他日淚，此句涵蓄。蓋公於夔州見菊花者二年矣。方叢菊之兩開，皆是他日感傷之淚也。",
"〚3789:2:12.2〛"=>"每依北斗望京華：趙云：南斗，師民瞻作北斗。◯《百家注》引趙曰：蓋長安上直北斗，號北斗城也。舊本南斗，非。",
"〚3789:2:13.2〛"=>"奉使虛隨八月槎：趙云：《宜都山川記》：峽中猿鳴至清，諸山谷傳其響。行者歌曰：巴中三峽猿鳴悲，猿鳴三聲淚霑衣。」◯八月楂事，載《博物志》。世亦傳爲張騫奉使尋河事而不見傳記。公屢使爲張騫，蓋承用之熟也。庾肩吾《奉使江州船中七夕》詩：漢使俱爲客，星槎共逐流。今公雖有理州之役若奉使然，而不到天上爲虛隨矣。",
"〚3789:2:14.2〛"=>"山樓粉堞隱悲笳：趙云：省署以粉畫之，謂之畫省，亦稱粉署。《初學記》載應劭《漢官儀》：尙書郎入直臺廨中，給女侍史二人，皆選端正指使從直。女侍史執香爐燒薫以從入臺中，給使護衣服，奏事明光殿。省中違伏枕，則違去畫省香爐者，以伏枕之故也。◯山樓粉堞，指白帝城。",
"〚3789:2:15.2〛"=>"已映洲前蘆荻花：趙云：末句想像扁舟之往如此。《北山移文》：秋桂遺風，春蘿罷月。",
);
?>