<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《望嶽》的資料。
*/
$内容=array(
"書名"=>"浦起龍《讀杜心解》1.1、早稻田2.3",
"版本"=>
array(
"詩文"=>"岱宗夫如何。齊魯青未了。造化鍾神秀。陰陽割昏曉。盪胸生曾雲。決眥[音恣]入歸鳥。會當凌絕頂。一覽衆山小。",),
"注釋"=>
array(
"〚0003:1〛"=>"按履歷，公遊齊魯，在開元二十五六年間。公集當以是爲首。",
"〚0003:3.1.1-2〛"=>"《前漢·郊祀志》：岱宗，泰山也。",
"〚0003:5.2.2〛"=>"《廣韻》：眥，目睫也。")
,
"評論"=>
"公望嶽詩凡三首，此望東嶽也。越境連綿，蒼峯不斷，寫嶽勢只「青未了」三字，勝人千
百矣。「鍾神秀」，在嶽勢前推出；「割昏曉」，就嶽勢上顯出。「盪胸」、「決眥」，
明逗「望」字。末聯則以將來之凌眺，剔現在之遙觀，是透過一層收也。仇氏詳註以遠望、
近望、細望、極望，分配四聯，未見清楚。
◯杜子心胸氣魄，於斯可觀。取爲壓卷，屹然作鎮。豈惟鐫剋年月云爾。",
"按語"=>
"永明按：
「鐫剋年月」，指爲杜詩編年排序。",

);
?>