<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《登兗州城樓》的資料。
*/
$浦内容=array(
"書名"=>"浦起龍《讀杜心解》2.333",
"版本"=>
array(
"詩文"=>"東郡趨庭日。南樓縱目初。浮雲連海岱[一作嶽]。平野入青徐。孤嶂秦碑在。荒城魯殿餘。從來多古意。臨眺獨躊躇。",
"坐標版本異文、夾注"=>array(
"〚0008:4.1.4-5〛"=>"〖海岱〗海岱[一作嶽]",
),
),
"注釋"=>
array(
"〚0008:1〛"=>"邵寳注：兗州，魯所都。",
"〚0008:3.1.1-2〛"=>"東郡：《前漢·志》：東郡，秦置，屬兗州。弼注：公父閑爲兗州司馬，公時省侍。",
"〚0008:5.1〛"=>"孤嶂秦碑在：《秦本紀》：始皇東行郡縣，上鄒嶧山，刻石頌秦德。",
"〚0008:5.2〛"=>"荒城魯殿餘：《魯靈光殿賦》：殿本景帝子魯共王所立。《後漢書注》：在兗州曲阜城中。")
,
"評論"=>
"首、二，點事。三、四，橫說，緊承「縱目」。五、六，竪說，轉出「古意」。末句仍繳
還「登」字，與「縱目」應。局勢開拓，結構謹嚴。",

);
?>