<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《遊龍門奉先寺》的資料。
*/
$content=array(
"書名"=>"浦起龍《讀杜心解》1.2、早稻田2.3",
"注釋"=>
array(
"〚0042:1〛"=>"朱鶴齡註：龍門，即伊闕。《元和郡縣志》：伊闕山在河南府伊闕縣。按：此在東
都，非禹貢之龍門。",
"〚0042:3.1.3-4〛"=>"《僧輝記》：招提者，梵言拓鬬提奢，唐言四方僧物，傳筆者訛拓爲招，去鬬
奢字。卽今十方住持寺院耳。")
,
"評論"=>
"各本多以此詩爲首，但按公遊東都，在開元二十九年後，則不應編在《望嶽》詩前也。
◯題曰遊寺，實則宿寺詩也。「遊」字只首句了之，次句便點清「宿」字。以下皆承次句
說。中四，寫夜宿所得之景，虛白高寒，塵府已爲之一洗。結到「聞晨鐘」「發省」，知
一宵清境，爲靈明之助者多矣。「欲覺」正與「更宿」呼應。
◯「天闕」「雲臥」，諸說紛紛。王安石改爲「天閲」，蔡興宗正義作「天闚」，是欲以
虛對虛也。文翔鳳云：「伊陽之北山，如雲臥然。」將「雲臥」與「天闕」俱作地名解，
是又欲以實對實也。其說俱不穩。朱注則曰：「古體詩何必拘拘偶對。」似属超解矣。然
此詩中四，卻非散體。按「天闕」字出韋述《東都記》，其爲地名無疑。若「雲臥」，正
形容宿處之高迥，定屬虛用。而「雲」自與「天」對，「臥」自與「闕」對，正以不執死
法爲文家妙用。彼聚訟者，皆方隅之見耳。",

);
?>