<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《送高三十五書記》的資料。
*/
$内容=array(
"書名"=>"浦起龍《讀杜心解》1.10",
"版本"=>

"詩題"=>"送高三十五書記十五韻",
"詩文"=>"崆峒小麥熟。且願休王師。請公問主將。安用窮荒爲。饑鷹未飽肉。側翅隨人飛。高生跨鞍馬。有似幽幷兒。脫身簿尉中。始與箠楚辭。借問今何官。觸熱向武威。答云一書記。所愧國士知。人實不易知。更須慎其儀。十年出幕府。自可持旌麾。此行旣特達。足以慰所思[一云亦足慰遠思]。男兒功名遂。亦在老大時。常恨結驩淺。各在天一涯。又如參與商。慘慘中腸悲。驚風吹[一作飄]鴻鵠。不得相追隨。黃塵翳沙漠。念子何當歸。邊城有餘力。早寄從軍詩。",),
"注釋"=>
array(
"〚0388:1〛"=>"《舊書》：高適，字達夫，渤海人。解褐封丘尉。去遊河右，河西節度使哥舒翰表
爲左驍衞兵曹，充翰府掌書記。按：公時在京師，高或當受辟之時，正值解職來京耶？",
"〚0388:3.1.1-2〛"=>"黄希云：山名崆峒者三，一在臨洮，一在安定，一在汝州。此指臨洮。",
"〚0388:4.1.4-5〛"=>"指哥舒。",
"〚0388:6.2.3-5〛"=>"梁簡文帝詩：家本幽幷兒。師氏曰：其俗習騎射也。",
"〚0388:7.1.4〛"=>"尉有刑人之責，今去封丘也。",
"〚0388:8.2.4-5〛"=>"《舊書》：涼州屬河西道，天寶元年，改武威郡。",
"〚0388:15.1.3-5〛"=>"《左傳》：辰爲商星、參爲晉星。")
,
"評論"=>
"送高入哥舒幕也。送幕客而帶及主將，入手得體。且設爲商榷之詞，以諷窮兵之失，其味
油然而長。「饑鷹」以下，入高書記。哀其志，敍其行，戒其慎周旋，祝其大建樹，凡四
層。末段十句，見送之之情。結云「餘力」「寄書」，旣欲得其遠耗，又欲悉其職業也。
通首看來，時事憂危之情，朋友規切之誼，臨岐頌禱、贈處執別之忱，藹然具見於此詩。",

);
?>