<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《苦雨奉寄隴西公兼呈王徵士》的資料。
*/
$内容=array(
"書名"=>"浦起龍《讀杜心解》1.12",
"版本"=>
array(
"詩文"=>"今秋乃淫雨。仲月來寒風。羣木水光下。萬家雲氣中。所思礙行潦。九里信不通。悄悄素滻路。迢迢天漢東。願騰六尺馬[一作駒]。背若孤征鴻。劃見公[一作君]子面。超然懽笑同。奮飛旣胡越。局促傷樊籠。一飯四五起。憑軒心力窮。嘉蔬沒溷濁。時菊碎榛叢。鷹隼亦屈猛。烏鳶何所蒙。式瞻北鄰居。取適南巷翁。挂席釣川漲。焉知清興終。",),
"注釋"=>
array(
"〚0476:1〛"=>"原注：隴西公卽漢中王瑀。徵士，琅琊王徹。
◯《舊書》：瑀，讓皇帝子。十五載從幸蜀，因封漢中王。",
"〚0476:6.1.4〛"=>"《長安志》：滻水在萬年縣，流入渭。",
"〚0476:6.2.3-4〛"=>"《三輔黃圖》：渭水貫都，以象天漢。")
,
"評論"=>
"四句起，四句結，中間一大段。寄岑則寓諷時局，寄隴西則起處微露，以其爲親王也，有
觸忌之恐乎！中段，詳相憶阻雨之意。末及王徵士。徵士必與隴西爲南北近鄰。北居卽指
隴西，南翁當指徵士。遙想兩人不時還往，以形己之岑寂也。注家混甚。",

);
?>