<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《九日寄岑參》的資料。
*/
$内容=array(
"書名"=>"浦起龍《讀杜心解》1.11",
"版本"=>
array(
"詩文"=>"出門復入門。雨脚但如舊。所向泥活活。思君令人瘦。沉吟坐西[一作秋]軒。飲食錯昏晝。寸步曲江頭。難爲一相就。吁嗟乎[舊作呼]蒼生。稼穡不可救。安得誅雲師。疇能補天漏。大明韜日月。曠野號禽獸。君子強逶迤。小人困馳驟。維南有崇山。恐[一作漭]與川浸溜。是節[一作時]東籬菊。紛披爲誰秀。岑生多新詩。性亦嗜醇酎[直又反]。采采黃金花。何由滿衣袖。",),
"注釋"=>
array(
"〚0484:1〛"=>"與《秋雨歎》参看，見二之一。",
"〚0484:6.1.3-4〛"=>"曲江在杜陵西北。",
"〚0484:8.1.4-5〛"=>"《廣雅》：雲師謂之豐隆。",
"〚0484:8.2.4-5〛"=>"《梁益記》：雅州有大小漏天。")
,
"評論"=>
"《通鑑》：天寶十三載秋八月，淫雨傷稼。國忠取禾之善者獻之。高力士侍側。上曰：
「淫雨不已，卿可盡言。」對曰：「自陛下以權假宰相，陰陽失度，臣何敢言？」詩正其
時作。寄岑非祗寄懷，實寄憂也。以兩頭之憶岑，隱中間之含諷。大臣蒙蔽，上掩聰明，
而悍帥將恣横焉。皆寓於「安得誅雲師」數語中。意本仇氏。",

);
?>