<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《夜聽許十誦詩愛而有作》的資料。
*/
$内容=array(
"書名"=>"浦起龍《讀杜心解》1.13",
"版本"=>

"詩題"=>"夜聽許十一誦詩愛而有作",
"詩文"=>"許生五臺賓。業白出石壁。余亦師粲可。身猶縳禪寂。何階子方便。謬引爲匹敵。離索晚相逢。包蒙欣有擊。誦詩渾遊衍。四座皆辟易。應手看捶鈎。清心聽鳴鏑。精微穿溟涬。飛動摧霹靂。陶謝不枝梧。風騷共推激。紫鷰[舊作鸞]自超詣。翠駮[同駁]誰剪剔。君意人莫知。人間夜寥闃。",),
"注釋"=>
array(
"〚0592:3.1.3-4〛"=>"《水經注》：五臺山，五巒巍然，其北臺卽文殊師利常鎮毒龍之所。",
"〚0592:3.2.1-2〛"=>"《翻譯名義集》：五戒、十善、四禪、四定，此屬於善，名爲白業。",
"〚0592:4.1.4-5〛"=>"《唐書》：達摩傳慧可，慧可嘗斷臂求法。慧可傳粲。",
"〚0592:4.2.4-5〛"=>"《維摩經》：一心禪寂，攝諸亂意。",
"〚0592:6.2.1-2〛"=>"《蒙》：九三包蒙，上九擊蒙。",
"〚0592:8.1.4-5〛"=>"《莊子》：大馬之捶鈎者，年八十矣，而不失豪芒。",
"〚0592:8.2.4-5〛"=>"《史記注》：髐箭也。按：今俗名響箭。",
"〚0592:9.1.4-5〛"=>"《帝系譜》：天地初起，溟涬濛鴻。",
"〚0592:10.1.1-2〛"=>"淵明、靈運。",
"〚0592:11.1.2〛"=>"《昭陵六馬贊》：紫鷰超躍。",
"〚0592:11.2.2〛"=>"《子虛賦》：楚王乃駕馴駁之駟。")
,
"評論"=>
"鶴云：許十一，當是居五臺學佛者。愚按公亦妙解禪理，故前段因以發端。而「何階」四
句，卽借邂逅談禪，陪起中幅「誦詩」，要非正文也。中段正寫聽詩而末以知音自許作結。
◯「應手」二句，誦者聽者身段神情俱見。「精微」四句，詩之超詣處也。「紫鷰」二句，
語氣轉側。言許詩自妙，而抉剔其妙者少也。結用反跌法。「夜寥闃」句，意境廓然，恰
好借點「夜」字。",

);
?>