<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《晦日尋崔戢李封》的資料。
*/
$内容=array(
"書名"=>"浦起龍《讀杜心解》1.24",
"版本"=>
array(
"詩文"=>"朝光入甕牖。尸[一作晏]寢驚敝裘。起行視天宇。春氣漸和柔。興來[一作乘興]不暇懶。今晨梳我頭。出門無所待。徒步覺自由。杖藜復恣意。免値公與侯。晚定崔李交。會心眞罕儔。每過得酒傾。二宅可淹留。喜結仁里懽。況因令節求。李生園欲荒。舊竹頗修修。引客看掃除。隨時成獻酬。崔侯初筵色。已畏空樽愁。未知天下士。至[一作志]性有此不。草牙旣青出。蜂聲亦暖遊。思見農器陳。何當甲兵休。上古葛天民。不貽黃屋[一作綺]憂。至今阮籍等。熟醉爲身謀。威鳳自高[一作高其]翔。長鯨吞九州。地軸爲之翻。百川皆亂流。當歌欲一放。淚下恐莫收。濁醪有妙理。庶用慰沈浮。",),
"注釋"=>
array(
"〚0703:1〛"=>"鶴注：唐以正月晦日爲令節。
◯依《杜詩闡》編十五載。是年正月，祿山遣其將寇潼關。",
"〚0703:18〛"=>"《阮籍傳》：魏晉之際，天下多故，名士少有全者。籍由是不與世事，遂酣飲爲常。")
,
"評論"=>
"來時甚閒適，入後多煩憂。公欲以酒慰，轉以酒觸矣。
◯層次敍起，到點落「崔李」「會心」處一頓，接下合提「得酒」，復分表兩君，作一段。「草芽」以下，撫時感事，假「濁醪」以爲任運之助。而紆迴繾綣。憂正長也。「威鳳高翔」，喻言治運旣遠，亦隱寓己與崔、李輩不得事權意。",

);
?>