<?php
/*
生成：本文檔用 PHP 生成。
說明：浦起龍《讀杜心解》中關於《白水縣崔少府十九翁高齋三十韻》的資料。
*/
$内容=array(
"書名"=>"浦起龍《讀杜心解》1.25",
"版本"=>

"詩題"=>"白水崔少府十九翁高齋三十韻",
"詩文"=>"客從南縣來。浩蕩無與適。旅食白日長。況當朱炎赫。高齋坐林杪。信宿游衍闃。清晨陪躋攀。傲睨俯峭壁。崇岡相枕帶。曠野迴[一作迥]咫尺。始知賢主人。贈此遣愁寂。危階根青㝠。曾冰生淅瀝。上有無心雲。下有欲落石。泉聲聞復息。動靜隨所激。鳥呼藏其身。有似懼彈射。吏隱道情性。茲焉其窟宅。白水見舅氏。諸翁乃仙伯。杖藜長松下。作尉窮谷僻。爲我炊雕胡。逍遙展良覿。坐久風頗怒[一作愁]。晚來山更碧。相對十丈蛟。歘翻盤渦坼。何得空裏雷。殷殷尋地脈。煙氛藹𡺚崒。魍魎森慘戚。崑崙崆峒巓。回首如不隔。前軒頹[一作摧]反照。巉絕華嶽赤。兵氣漲林巒。川光雜鋒鏑。知是相公軍。鐵馬雲[一作煙]霧積。玉觴淡無味。胡羯豈強敵。長歌激屋梁。淚下流袵席。人生半哀樂。天地有順逆。慨彼萬國夫。休明備征狄[一作敵]。猛將紛填委。廟謀蓄長策。東郊何時開。帶甲且未釋。欲告清宴罷。難拒幽明迫。三歎酒食傍。何由似平昔。",),
"注釋"=>
array(
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"",
"〚0715:〛"=>"")
,
"評論】 後詩爲諷詳敍"=>
"「」",

);
?>