<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《同李太守登歷下古城員外新亭》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2253",
"版本"=>
array(
"詩題"=>"同李太守登歷下古城員外新亭亭對鵲湖[原注。時李之芳自尚書郎出齊州，置此亭。]",
"詩文"=>"新亭結構罷。隱見清湖陰。跡籍臺觀舊。氣溟[一作冥]海嶽深。圓荷想自昔。遺堞感至今。芳宴此時具[一作俱]。哀絲[一作絃]千古心。主稱壽尊客。筵秩宴北[一作密]林。不阻蓬蓽興。得兼[一作兼得]梁甫吟。",
"坐標版本異文、夾注"=>array(
"〚0084:1〛"=>"〖1〗同李太守登歷下古城員外新亭亭對鵲湖[原注。時李之芳自尚書郎出齊州，置此亭。]",
"〚0084:4.1.1-2〛"=>"〖迹藉〗跡籍",
"〚0084:4.2.1-5〛"=>"〖氣冥海岳深〗氣溟[一作冥]海嶽深",
"〚0084:6.1.5〛"=>"〖具〗具[一作俱]",
"〚0084:6.2.2〛"=>"〖絲〗絲[一作絃]",
"〚0084:7.2.4〛"=>"〖北〗北[一作密]",
"〚0084:8.2.2〛"=>"〖兼〗兼[一作兼得]",
),
),

);
?>