<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《高都護驄馬行》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2255",
"版本"=>
array(
"詩題"=>"高都護驄馬行[高仙芝。開元末爲安西副都護。]",
"詩文"=>"安西都護胡青驄。聲價歘然來向東。此馬臨陣久無敵。與人一心成大功。功成惠養[赭白馬賦。願終惠養。]隨所致。飄飄[一作颻]遠自流沙至。雄姿未受伏櫪恩。猛氣猶思戰場利。腕[一作踠]促蹄高如踣鐵。交河幾蹴曾冰裂。五花[翦鬃為辮。或三花。或五花。或云印以三花飛風之字。]散作雲滿身。萬里方看汗流血。長安壯兒不敢騎。走過掣電傾城知。青絲絡頭爲君老。何由卻出橫門道。[長安城北出西頭第一門曰橫門，其外爲橫橋。]",
"坐標版本異文、夾注"=>array(
"〚0167:1〛"=>"〖1〗高都護驄馬行[高仙芝。開元末爲安西副都護。]",
"〚0167:3.2.3〛"=>"〖欻〗歘",
"〚0167:5.1.3-4〛"=>"〖惠養〗惠養[赭白馬賦。願終惠養。]",
"〚0167:5.2.1-2〛"=>"〖飄飄〗飄飄[一作颻]",
"〚0167:7.1.1-2〛"=>"〖腕促〗腕[一作踠]促",
"〚0167:8.1.1-2〛"=>"〖五花〗五花[翦鬃為辮。或三花。或五花。或云印以三花飛風之字。]",
"〚0167:10.2.5-7〛"=>"〖橫門道〗橫門道。[長安城北出西頭第一門曰橫門，其外爲橫橋。]",
),
),

);
?>