<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《兵車行》的資料。
*/
$内容=array(
"書名"=>"《全唐詩》7.2254",
"版本"=>
array(
"詩文"=>"車轔轔。馬蕭蕭。行人弓箭各在腰。耶孃妻子走相送。塵埃不見咸陽橋。牽衣頓足闌[一作橋]道哭。哭聲直上干雲霄。道傍過者問行人。行人但云點行頻。或從十五北防河[開元十五年。以吐蕃爲邊害。詔隴右、河西兵集臨洮。朔方兵集會州。防秋。至冬初無寇而罷。]。便至四十西營田。去時里正[唐制。百戶爲一里。里置正一人。]與裹頭。歸來頭白還[一作猶]戍邊。邊亭[一作庭]流血成海水。武[一作我]皇[唐人稱太宗爲文皇。明皇爲武皇。]開邊意未已。君不聞漢家山東[太行之東。唐都長安。凡河北諸道。皆爲山東。]二百州。千村萬落生荊杞。縱有健婦把鋤犂。禾生隴畝無東西。況復秦兵耐苦戰。被驅不異犬與雞。長者雖有問。役夫敢申恨。且如今年冬。未休關[一作隴]西卒[一作役夫心益憤。如今縱得休。還爲隴西卒。通鑑。天寶九載十二月。關西遊奕使王難得擊吐蕃。克五橋。拔樹敦城。]。縣官急索租[一作縣官云急索。]。租稅從何出。信知生男惡。反是生女好。生女猶是[一作得]嫁比鄰。生男[一作兒]埋沒隨百草。君不見青海頭。古來白骨無人收。新鬼煩寃舊鬼哭。天陰雨溼聲[一作悲]啾啾[錢謙益曰。天寶十載。鮮于仲通討南詔蠻。士卒死者六萬。制大募兩京及河南北兵以擊南詔。人莫肯應。楊國忠遣御史分道捕人。枷送軍所。此詩序南征之苦。設爲役夫問答之詞。君不聞以下。言征戍之苦。海内驛騷。不獨南征一役爲然也。]。",),

);
?>