<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《玄都壇歌寄元逸人》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2253",
"版本"=>
array(
"詩文"=>"故人昔隱東蒙峯。已佩含景[公孫端劍銘。含景吐商。]蒼精龍[劍之在左。蒼龍象也。]。故人今居子午谷。獨在[一作並]陰崖結[一作白]茅屋。屋前太古玄都壇。青石漠漠常[一作松]風寒。子規夜啼山竹裂。王母晝下雲旗翻[一作蟠]。知君此計成[一作誠]長往。芝草琅玕日應長。鐵鎖[終南大秦嶺。有采蜜人山行。尋鐘聲而入。至一寺。旁有大竹林一二頃。截竹盛蜜。歸以告戍卒。卒復往取竹。見崖垂鐵鎖長三丈。掣鎖欲上。二虎踞崖大呼。驚佈而返。]高垂不可攀。致身福地何蕭爽。",
"坐標版本異文、夾注"=>array(
"〚0271:3.2.3-7〛"=>"〖含景蒼精龍〗含景[公孫端劍銘。含景吐商。]蒼精龍[劍之在左。蒼龍象也。]",
"〚0271:4.2.1-7〛"=>"〖獨在陰崖結茅屋〗獨在[一作並]陰崖結[一作白]茅屋",
"〚0271:5.2.5-7〛"=>"〖常風寒〗常[一作松]風寒",
"〚0271:6.2.5-7〛"=>"〖雲旗翻〗雲旗翻[一作蟠]",
"〚0271:7.1.5-7〛"=>"〖誠長往〗成[一作誠]長往",
"〚0271:8.1.1-2〛"=>"〖鐵鎖〗鐵鎖[終南大秦嶺。有采蜜人山行。尋鐘聲而入。至一寺。旁有大竹林一二頃。截竹盛蜜。歸以告戍卒。卒復往取竹。見崖垂鐵鎖長三丈。掣鎖欲上。二虎踞崖大呼。驚佈而返。]",
),
),

);
?>