<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《同諸公登慈恩寺塔》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2258",
"版本"=>
array(
"詩題"=>"同諸公登慈恩寺塔[原注。時高適、薛據先有此作。按寺乃高宗在東宮時為文德皇后所立。故名慈恩。]",
"詩文"=>"高標跨蒼天[一作穹]。烈風無時休。自非曠[一作壯]士懷。登茲翻百憂。方知象教力。足[一作立]可追冥搜。仰穿龍蛇窟。始出[一作驚]枝撐幽。七星在北戶[一作戶北]。河漢聲西流。羲和鞭白日。少昊行清秋。秦[一作泰]山忽破碎。涇渭不可求。俯視但一氣。焉能辨皇州。回首叫虞舜。蒼梧雲正愁。惜哉瑤池飲[一作燕]。日晏崑崙丘。黃鵠去不息。哀鳴何所投。君看隨陽雁。各有稻粱謀。",
"坐標版本異文、夾注"=>array(
"〚0295:1〛"=>"〖1〗同諸公登慈恩寺塔[原注。時高適、薛據先有此作。按寺乃高宗在東宮時為文德皇后所立。故名慈恩。]",
"〚0295:3.1.4-5〛"=>"〖蒼穹〗蒼天[一作穹]",
"〚0295:4.1.3-4〛"=>"〖曠士〗曠[一作壯]士",
"〚0295:5.2.1-2〛"=>"〖足可〗足[一作立]可",
"〚0295:6.2.1-2〛"=>"〖始出〗始出[一作驚]",
"〚0295:7.1.4-5〛"=>"〖北戶〗北戶[一作戶北]",
"〚0295:9.1.1-2〛"=>"〖秦山〗秦[一作泰]山",
"〚0295:12.1.3-5〛"=>"〖瑤池飲〗瑤池飲[一作燕]",
),
),

);
?>