<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《白絲行》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2255",
"版本"=>
array(
"詩文"=>"繅絲須長不須白。越羅蜀錦金粟尺。象[一作牙]牀玉手亂殷紅。萬草千花動凝碧。已悲素質隨時染[一作改]。裂下鳴機色相射。美人細意熨帖平。裁縫滅盡針線迹。春天衣著爲君舞。蛺蝶飛來黃鸝語。落絮游絲亦有情。隨風照日宜[一作疑]輕舉。香汗輕[一作清]塵污顏色[一作似微污。一作污不著。一作似顏色]。開新合故置何[一作相]許。君不見才[一作志]士汲引難。恐懼棄捐忍羈旅。",
"坐標版本異文、夾注"=>array(
"〚0319:3.1.1-2〛"=>"〖繰絲〗繅絲",
"〚0319:4.1.1-2〛"=>"〖象牀〗象[一作牙]牀",
"〚0319:5.1.5-7〛"=>"〖隨時染〗隨時染[一作改]",
"〚0319:8.1.3-4〛"=>"〖遊絲〗游絲",
"〚0319:8.2.5-7〛"=>"〖宜輕舉〗宜[一作疑]輕舉",
"〚0319:9.1.3-7〛"=>"〖清塵污顏色〗輕[一作清]塵污顏色[一作似微污。一作污不著。一作似顏色]",
"〚0319:9.2.5-7〛"=>"〖置何許〗置何[一作相]許",
"〚0319:10.1.4-5〛"=>"〖才士〗才[一作志]士",
),
),

);
?>