<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《送高三十五書記》的資料。
*/
$内容=array(
"書名"=>"《全唐詩》7.2252",
"版本"=>

"詩題"=>"送高三十五書記[高適。渤海人。解褐爲封丘尉。不就。客遊河西。哥舒翰奇之。表爲書記。]",
"詩文"=>"崆峒小麥熟。且[一作吾]願休王師。請公問主將。焉用窮荒爲[積石軍每歲麥熟。吐蕃穫之。邊人呼爲吐蕃麥莊。天寶六年。哥舒翰掩擊大破之。後不敢復至。八載。又克其石堡城。然自此用兵河西不已。故追言戒之。欲適告翰也。]。飢鷹未飽肉。側翅隨人飛。高生跨鞍馬。有似幽幷[一作幷州]兒。脫身簿尉中。始與捶楚[唐簿尉有罪。輒受鞭撻。]辭。借問今何官。觸熱向武威。答云[一作言]一書記。所愧國士知。人實不易知。更[一作尤]須慎其儀[一作宜]。十年出幕府。自可持旌麾[一作旗]。此行旣特達。足以慰所思[一作亦足慰遠思]。男兒功名遂。亦在老大時。常恨結歡淺。各在天一涯。又如參與商。慘慘中腸[一作中腸安不]悲。驚風吹[一作飄]鴻鵠。不得相追隨。黃塵翳沙漠。念子何當[一作時]歸。邊城有餘力。早寄從軍詩。",),

);
?>