<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《醉時歌》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.",
"版本"=>
array(
"詩文"=>"諸公衮衮登臺[一作華]省。廣文先生官獨冷。甲第紛紛厭粱肉。廣文先生飯不足。先生有道出羲皇。先生有才[一作文。一作所談。一作所該。一作所抱。]過屈宋。德尊一代常轗軻[一作壈]。名垂萬古知何用。杜陵野客人更[一作見]嗤。被褐短窄[一作穴]鬢如絲。日糴太[一作泰]倉五升米。時赴鄭老同襟[一作衾]期。得錢卽相覓。沽酒不復疑。忘形到爾汝。痛飲眞[一作直]吾師。清夜沈沈動春酌。燈[一作檐]前細雨檐[一作燈]花落。但覺高歌有[一作感]鬼神。焉知餓死填溝壑。相如逸才親滌器。子雲識字終投閣。先生早賦歸去來。石田茅屋荒蒼苔。儒術於我何有哉。孔丘盜跖俱塵埃。不須聞此意慘愴。生前相遇且銜杯。",
"坐標版本異文、夾注"=>array(
"〚0409:3.1.5-7〛"=>"〖登臺省〗登臺[一作華]省",
"〚0409:5.2.3-4〛"=>"〖有才〗有才[一作文。一作所談。一作所該。一作所抱。]",
"〚0409:6.1.6-7〛"=>"〖轗軻〗轗軻[一作壈]",
"〚0409:7.1.6-7〛"=>"〖更嗤〗更[一作見]嗤",
"〚0409:7.2.3-4〛"=>"〖短窄〗短窄[一作穴]",
"〚0409:8.1.3-4〛"=>"〖太倉〗太[一作泰]倉",
"〚0409:8.2.5-7〛"=>"〖同襟期〗同襟[一作衾]期",
"〚0409:10.2.3-5〛"=>"〖眞吾師〗眞[一作直]吾師",
"〚0409:11.1.3-4〛"=>"〖沉沉〗沈沈",
"〚0409:11.2.1-7〛"=>"〖燈前細雨簷花落〗燈[一作檐]前細雨檐[一作燈]花落",
"〚0409:12.1.5-7〛"=>"〖有鬼神〗有[一作感]鬼神",
),
),

);
?>