<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《秋雨歎三首》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2256",
"版本"=>
array(
"詩文"=>array("雨中百草秋爛死。階下決明顏色鮮。著葉滿枝翠羽蓋。開花無數黃金錢。涼風蕭蕭吹汝急。恐汝後時難獨立。堂上書生空白頭。臨風三嗅馨香泣。","闌[一作蘭]風長[去聲。一作伏。一作仗]雨[一作東風細雨]秋紛紛。四海[一作萬里]八荒同一雲。去馬來牛不復辨。濁涇清渭何當分。禾[一作木]頭生耳黍穗黑。農夫田婦[一作父]無消息。城中斗米換[一作抱]衾裯。相許寧論兩相直。","長安布衣誰比數。反鎖衡門守環堵。老夫不出長蓬蒿。穉子無憂走[音奏]風雨。雨聲颼颼催早寒。胡雁翅溼高飛難。秋來未曾[一作省]見白日。埿污后土何時乾。",),

"坐標版本異文、夾注"=>array(
"〚0465:2:12.1.1-4〛"=>"〖闌風長雨〗闌[一作蘭]風長[去聲。一作伏。一作仗]雨[一作東風細雨]",
"〚0465:2:12.2.1-2〛"=>"〖四海〗四海[一作萬里]",
"〚0465:2:14.1.1-2〛"=>"〖禾頭〗禾[一作木]頭",
"〚0465:2:14.2.3-4〛"=>"〖田父〗田婦[一作父]",
"〚0465:2:15.1.5-7〛"=>"〖換衾裯〗換[一作抱]衾裯",
"〚0465:3:20.2.1-2〛"=>"〖稚子〗穉子",
"〚0465:3:20.2.5-7〛"=>"〖走風雨〗走[音奏]風雨",
"〚0465:3:21.2.3-4〛"=>"〖翅濕〗翅溼",
"〚0465:3:22.1.3-4〛"=>"〖未曾〗未曾[一作省]",
"〚0465:3:22.2.1-2〛"=>"〖泥污〗埿污",
),
),

);
?>