<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《苦雨奉寄隴西公兼呈王徵士》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2258",
"版本"=>
array(
"詩題"=>"苦雨奉寄隴西公兼呈王徵士[原注。隴西公卽漢中王瑀。徵士。琅邪王澈。]",
"詩文"=>"今秋乃淫雨。仲月來寒風。羣木水光下。萬象[一作家]雲氣中。所思礙行潦。九里信不通。悄悄素滻路。迢迢天漢東。願騰六尺馬[一作駒]。背若孤征鴻。劃見公[一作君]子面。超然歡笑同。奮飛旣胡越。局促傷樊籠。一飯四五起。憑軒心力窮。嘉蔬沒混濁。時菊碎榛叢。鷹隼亦屈猛。烏鳶何所蒙。式瞻北鄰居。取適南巷翁。掛席釣川漲。焉知清興終。",
"坐標版本異文、夾注"=>array(
"〚0476:1〛"=>"〖1〗苦雨奉寄隴西公兼呈王徵士[原注。隴西公卽漢中王瑀。徵士。琅邪王澈。]",
"〚0476:4.2.1-2〛"=>"〖萬家〗萬象[一作家]",
"〚0476:7.1.3-5〛"=>"〖六尺馬〗六尺馬[一作駒]",
"〚0476:8.1.3-5〛"=>"〖公子面〗公[一作君]子面",
"〚0476:11.1.3-5〛"=>"〖沒溷濁〗沒混濁",
"〚0476:14.1.1-2〛"=>"〖挂席〗掛席",
),
),

);
?>