<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《天育驃騎歌》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2255",
"版本"=>
array(
"詩題"=>"天育驃騎[一本有圖字]歌[天育。馬廐名。未詳所出。]",
"詩文"=>"吾聞天子之馬走千里。今之畫圖無乃是。是何意態雄且傑。駿[一作騣]尾蕭梢朔風起。毛爲綠縹[一作驃]兩耳黃。眼有紫燄雙瞳方。矯矯[一作然]龍性[一作矯龍性逸]合[東坡書作含]變化。卓立天骨森開張。伊昔太僕張景順。監牧攻駒[一作考牧攻駒。一作考牧神駒。]閱清峻。遂令大奴字天育。別養驥子憐神俊[一作駿]。當時四十萬匹馬。張公歎其材盡下。故獨寫眞傳世人。見之座右久更新。年多物化空形影。嗚呼健步無由騁。如今豈無騕褭與驊騮。時無王良伯樂死卽休。",
"坐標版本異文、夾注"=>array(
"〚0549:1〛"=>"〖1〗天育驃騎[一本有圖字]歌[天育。馬廐名。未詳所出。]",
"〚0549:4.2.1-2〛"=>"〖駿尾〗駿[一作騣]尾",
"〚0549:5.1.3-4〛"=>"〖綠縹〗綠縹[一作驃]",
"〚0549:5.2.3-4〛"=>"〖紫焰〗紫燄",
"〚0549:6.1.1-5〛"=>"〖矯矯龍性合〗矯矯[一作然]龍性[一作矯龍性逸]合[東坡書作含]",
"〚0549:7.2.3-4〛"=>"〖攻駒〗攻駒[一作考牧攻駒。一作考牧神駒。]",
""=>"〖大奴守天育〗大奴[漢昌邑王使大奴以衣車載女子。注。奴之尤長大者。此言景順之牧馬奴耳。]守[一作字]天育",
"〚0549:8.2.6-7〛"=>"〖神俊〗神俊[一作駿]",
),
),

);
?>