<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《醉歌行》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2257",
"版本"=>
array(
"詩題"=>"醉歌行[原注。別從姪勤落第歸。勤一作勸。]",
"詩文"=>"陸機二十作文賦。汝更小年能綴文。總角草書又神速。世上兒子徒紛紛。驊騮作駒已汗血。鷙鳥舉翮連青雲。詞源[一作賦]倒流[一作傾]三峽水。筆陣獨掃千人軍。只今年[一作生]纔十六七。射策君門期第一。舊穿楊葉眞自知。暫蹶霜蹄未爲失。偶然擢秀非難取。會是排風有毛質。汝身已[一作卽]見唾成珠。汝伯何由髮如漆。春光澹[一作潭]沱秦東亭。渚蒲牙白水荇青。風吹客衣日杲杲。樹攪離思花冥冥。酒盡沙頭雙玉甁。衆賓皆[一作已]醉皆醉我獨醒。乃知貧賤別更苦。吞聲躑躅涕淚零。",
"坐標版本異文、夾注"=>array(
"〚0598:1〛"=>"〖1〗醉歌行[原注。別從姪勤落第歸。勤一作勸。]",
"〚0598:6.1.1-4〛"=>"〖詞源倒流〗詞源[一作賦]倒流[一作傾]",
"〚0598:7.1.3-4〛"=>"〖年纔〗年[一作生]纔",
"〚0598:10.1.3-4〛"=>"〖已見〗已[一作卽]見",
"〚0598:11.1.3-4〛"=>"〖淡沱〗澹[一作潭]沱",
"〚0598:13.2.1-2〛"=>"〖眾賓〗衆賓皆[一作已]醉",
),
),

);
?>