<?php
/*
生成：本文檔用 PHP 生成。
說明：《全唐詩》中關於《贈衞八處士》的資料。
*/
$全内容=array(
"書名"=>"《全唐詩》7.2257",
"版本"=>
array(
"詩文"=>"人生不相見。動如參與商。今夕[一作此]復何夕。共此燈燭[一作宿此燈]光。少壯能幾時。鬢髮各已蒼。訪舊[一作問]半爲鬼。驚[一作嗚]呼熱中腸。焉知二十載。重上君子堂。昔別君未婚。兒女[一作驅兒]忽成行。怡然敬父執。問我來何方。問答乃未已[一作未及已]。兒女[一作驅兒]羅酒漿。夜雨翦春韭。新[一作晨]炊間[一作聞]黃粱。主稱會面難。一舉累[一作蒙]十觴。十[一作百]觴亦不醉[一作辭]。感子故意長。明日隔山岳。世事兩茫茫。",
"坐標版本異文、夾注"=>array(
"〚1324:4.1.1-2〛"=>"〖今夕〗今夕[一作此]",
"〚1324:4.2.1-4〛"=>"〖共此燈燭〗共此燈燭[一作宿此燈]",
"〚1324:6.1.1-2〛"=>"〖訪舊〗訪舊[一作問]",
"〚1324:6.2.1-2〛"=>"〖驚呼〗驚[一作嗚]呼",
"〚1324:10.1.3-5〛"=>"〖乃未已〗乃未已[一作未及已]",
"〚1324:8.2.1-2〛"=>"〖兒女〗兒女[一作驅兒]",
"〚1324:11.1.3-5〛"=>"〖剪春韭〗翦春韭",
"〚1324:11.2.1-3〛"=>"〖新炊間〗新[一作晨]炊間[一作聞]",
"〚1324:12.2.3-5〛"=>"〖累十觴〗累[一作蒙]十觴",
"〚1324:13.1.1-5〛"=>"〖十觴亦不醉〗十[一作百]觴亦不醉[一作辭]",
),
),

);
?>