<?php
/*
生成：本文檔用 PHP 生成。
說明：仇兆鰲《杜詩詳注》中關於《奉贈韋左丞丈二十二韻》的資料。
*/
$内容=array(
"書名"=>"仇兆鰲《杜詩詳注》1.73",
"版本"=>

"詩題"=>"奉贈[《杜臆》作呈]韋左丞丈二十二韻",
"詩文"=>"紈袴不餓死。儒冠多誤身。丈人試静聽。賤子請具陳。少[去聲。一作妙]昔少年日。早充觀國賓。讀書破萬卷。下[去聲]筆如有神。賦料[義從平聲，讀用去聲]揚雄敵。詩看[平聲。《摭言》作將]子建親。李邕求識面。王翰願爲[陳作爲，一作卜]隣。自謂頗挺出[一作生]。立登要路津。致君堯舜上。再使風俗[《摭言》作化]淳。此意竟蕭條[《摭言》作索]。行歌非隱淪。騎驢三十載[上聲。諸本作三十載，盧注作十三載，載作年]。旅食京華春。朝扣富兒門。暮隨肥馬塵。殘杯與冷炙。到處潛悲辛。主上頃見徵。歘[許勿切]然欲求伸。青冥却垂翅。蹭蹬無縱鱗。甚愧丈人厚。甚知丈人眞。每於百僚上。猥誦佳句新。竊效貢公喜。難甘原憲貧。焉[於虔切]能心怏怏。祇是走踆踆。今欲東入海[《摭言》作洛]。卽將西去秦。尚憐終南山。回首[一作望]清渭濱。常擬報一飯[一作餐]。況懷辭大臣。白鷗没[一作波]浩蕩。萬里誰能馴。",),
"評論"=>
array(
"〚0276:3-4〛"=>"首用議論總提。《杜臆》：儒冠誤身，乃通篇之主，紈袴句特伴語耳。",
"〚0276:5-10〛"=>"此敍少年自負，申言儒冠之事。甫昔八句，言學優才敏，足以馳騁古今。自謂四句，欲正君善俗，不但文辭見長也。此乃備陳學問本領，言大而非夸。《杜臆》：公以韋丞爲知己，故通篇作衷語，如「讀書破萬卷」等句，大膽說出，絕無謙遜也。",
"〚0276:11-16〛"=>"此慨歷年不遇，申明誤身之故。蕭條八句，前因貢舉不第。見徵四句，後以應詔退下。黃生曰：騎驢六句，極言困厄之狀，略不自諱，隱然見抱負如彼，而阨窮乃如此，俗眼無一知己矣。",
"〚0276:17-24〛"=>"末段感懷韋丈，而致臨別縫綣之情。甚愧四句，藉韋公爲知己。竊效四句，不得志而思去矣。今欲四句，欲去而不忍徑去。常擬四句，欲留而不能復留也。詩到尾梢，他人幾於力竭，公獨滔滔滾滾，意思不窮，正所謂「篇終接混茫」也。然須玩其轉折層次，不可增減，非汗漫敷陳者比。此章首段四句，中二段各十二句，末段十六句收。")
,

);
?>