<?php

/*
生成：本文檔用 PHP 生成。
程式：生成書本注釋.php
說明：把注釋集中在一個文檔裏。
*/
$錢謙益《錢注杜詩》注釋=array(
"〚0013:1〛"=>"張氏：鶴曰。雜述云。魯之張叔卿、孔巢父二才士者。面目黧黑。常不得飽飯喫。張氏隱居。豈非其人與。舊史李白傳云。少與魯中諸生張叔明、孔巢父六人。隱於徂徠山。叔明、叔卿。殆是一人也。或曰張氏以爲山人彪亦可。正不必求其人以實之。",
"〚0013:1:7.1.5-7〛"=>"金銀氣：天官書。大水處。敗軍場。破國之墟。下有積錢。金寶之上。皆有氣。不可不察。寓簡曰。齊梁間。山陰隱者孔祐。至行通神。嘗於四明山谷中。見積錢數百斛。視之如瓦石。樵人競取之。入手卽成沙礫。不貪夜識金銀氣。祐之謂耶。",
"〚0042:〛"=>"龍門：太平寰宇記。闕塞山。左傳。晉趙鞅納王使女寬。守闕塞。服虔謂南山伊闕是也。杜預云。洛陽西南伊闕口也。俗名龍門。元和郡國志。伊闕山。在伊闕縣北四十五里。兩山相對。望之若闕。伊水流其間。故名。又煬帝登北邙山。覩伊闕曰。此非龍門耶。河南總志。闕塞山。在雒陽縣西南三十里。又名伊闕。俗名龍門。又名闕口。傅毅反都賦。因龍門以畼化。開伊闕以達聰也。舊注妄引禹貢河東之龍門。今削之。",
"〚0042:3.1.3-4〛"=>"招提：增輝記云。招提者。梵言拓鬬提奢。唐言四方僧物。後人傳寫。以拓爲招。又省鬬奢二字。止稱招提。卽今十方住持寺院是也。翻譯名義集。後魏太武始光元年。造伽藍。創立招提之名。唐書。武宗拆寺四千六百餘所。蘭若招提四萬餘所。",
"〚0042:5.1.1-2〛"=>"天闕：蔡絛西清詩話。黃魯直校本云。王荆公改天闕作天閱，對雲臥爲親切。余讀韋述東都記。龍門號雙闕，以與大內對峙。若天闕焉。此宿龍門詩也。用闕字何疑。程大昌演繁露。王介甫改闕爲閱。非也。水經注穀水曰。漢官典職曰。偃師去洛西四十五里。望朱雀闕其上。鬱然與天連。是明峻極矣。白虎通曰。今閶闔門外。夾建雙闕。以應天宿。箋曰。韋應物龍門遊眺詩云。鑿山導伊流。中斷若天闕。又云。南山鬱相對。此杜詩注脚也。宋人妄改。削之何疑。楊用修又據章表臣詩話。定爲天闚。引據支離。悉所不取。",
"〚0276:1〛"=>"韋濟。天寶七載。爲河南尹。遷尙書左丞。",
"〚0276:3.1.1-2〛"=>"紈袴。前書敍傳。班白與王許子弟爲羣。在於綺襦紈袴之間。非其好也。師古曰。紈。素也。綺。今之細綾也。並貴戚子弟之服。任昉奏彈劉整。以前代外戚。仕因紈袴。",
"〚0276:5.2.3-5〛"=>"觀國賓。",
"〚0276:〛"=>"",
);
?>