<?php

/*
生成：本文檔用 PHP 生成。
程式：生成書本注釋.php
說明：把注釋集中在一個文檔裏。
*/
$朱鶴齡《杜工部詩集輯注》注釋=array(
"〚0013:1:7.1.5-7〛"=>"金銀氣：《史·天官書》：敗軍場、亡國之墟，下有積錢，金寶之上，皆有氣，不可不察。按：《南史》載，梁隱士孔祐至行通神，嘗見四明山谷中有錢數百斛，視之如瓦石。樵人競取，入手卽成沙礫。「不貪夜識金銀氣」殆是類耶？東坡謂深山大澤有天地之寶，惟無意於寶者能識之。卽此句義。",
"〚0013:1:8.2.6-7〛"=>"虛舟：《莊子》：方舟而濟於河，有虛船來觸舟，雖𥚹心之人不怒。",
"〚0042:1〛"=>"龍門，卽伊闕。《元和郡縣志》：伊闕山在河南府伊闕縣北四十五里。《兩京新記》：煬帝登北邙，觀伊闕，曰：「此龍門耶？自古何不建都於此？」《一統志》：闕塞山在河南府城西南三十里。《左傳》：趙鞅使女寬守闕塞，卽此。一名伊闕，俗名龍門山，又名闕口。",
"〚0042:3.1.3-4〛"=>"招提：《僧史》：魏太武始光元年，創造伽藍，立招提之名。《僧輝記》：招提者，梵言拓鬬提奢，唐言四方僧物，但傳筆者訛拓為招，去鬬奢，留提字，卽今十方住持寺院耳。《唐會要》：官賜額爲寺，私造者爲招提蘭若。",
"〚0042:5.1.1-2〛"=>"天闕：《庚溪詩話》：按韋述《東都記》：龍門號雙闕，以與大內對峙，若天闕然。此詩天闕指龍門也。王荆公謂對屬不切，改爲天閱。蔡興宗《正異》謂世傳古本作天闚，引《莊子》「以管闚天」爲證。皆臆說。楊愼曰：古字窺作闚。天闚、雲臥，乃倒字法耳。闚天則星辰垂地，臥雲則空翠濕衣，見山寺高寒，殊於人境也。按：用修之說，蓋主興宗。然《丹陽記》載王茂弘指牛頭山兩峯爲天闕，見《文選注》，禹疏伊水北流，兩山相對，望之若闕，又見《水經注》，皆確據也。況此本古體詩，何必拘拘偶對耶？",
"〚0042:5.2.1-2〛"=>"雲臥：鮑照詩：雲臥恣天行。",
);
?>