<?php
/*
 * 
 */
function 替換詩陣列文字( 
	array &$詩陣列, string $坐標, string $文字 ) : bool
{
	//echo "Inside 替換詩陣列文字", NL;
	$默詩碼 = mb_substr( $坐標, 1, 4 );
	//echo "默詩碼: ", $默詩碼, NL;
	
	//if( 是組詩( $默詩碼 ) )
	//{
		
		
		/*
		//替換路徑文字
		$首碼 = 提取首碼( $坐標 );
		$詩碼 = $默詩碼 . '-' . $首碼;
		$坐標 = str_replace( "${默詩碼}:", "${默詩碼}-", $坐標 );
		
		$路徑s = 完整坐標轉換成列陣路徑( $坐標 );
		print_r( $坐標 );
		print_r( $路徑s );
		$新路徑s = array();
		*/
		/*
		foreach( $路徑s as $路徑 )
		{
			//$路徑[ 0 ] = $詩碼;
			//unset( $路徑[ 1 ] );
			print_r( $路徑 );
			//替換路徑文字( $詩陣列, $路徑, $文字 );
		}
		*/
		
		
		//$路徑 = array( $默詩碼 );
		//echo $默詩碼, NL;
	//}
	//else
	//{
		替換首陣列文字( $詩陣列, $坐標, $文字 );
	//}
	
	
	//print_r( $路徑陣列s );
	
	/*
	if( 是組詩( $默詩碼 ) )
	{
		
	echo "默詩碼: ", $默詩碼, NL;
	echo "路徑: ", $路徑陣列s[ $size - 2 ], NL;
	替換路徑文字(
		$詩陣列, $路徑陣列s, $文字 );
	}
	*/
	
	return true;
}

function 替換首陣列文字( array &$詩陣列, string $坐標, string $文字 ) : bool
{
	if( 是含範圍字碼完整坐標( $坐標 ) )
	{
		$路徑陣列s = 含範圍字碼完整坐標轉換成列陣路徑( $坐標 );
	}
	else
	{
		$路徑陣列s = array( 完整坐標轉換成列陣路徑( $坐標 ) );
	}
	
	$size = sizeof( $路徑陣列s );
	
	for( $i = 0; $i < $size - 2; $i++ )
	{
		替換路徑文字( $詩陣列, $路徑陣列s[ $i ], 空語鏈 );
	}
	
	替換路徑文字( $詩陣列, $路徑陣列s[ $size - 1 ], $文字 );
	
	return true;
}
?>