<?php
/*
生成：本文檔用 PHP 生成。
說明：韓成武、張志民《杜甫詩全譯》中關於《題張氏隱居二首》的資料。
*/
$内容=array(
"書名"=>"韓成武、張志民《杜甫詩全譯》3",
"注釋"=>
array(
"〚0013:8.1.6-7〛"=>"出處：出仕與隱居。")
,
"譯文"=>
array(
"〚0013:1：5〛"=>"漫遊春山卻無伴侶，因而特意把您訪求，丁丁的伐木聲，更顯出山谷的清幽。",
"〚0013:1：6〛"=>"走過澗道上殘留的冰雪，穿過斜陽輝映的石門，終於來到您的林中茅屋。",
"〚0013:1：7〛"=>"您不貪戀財物，夜間不去觀察金銀之氣；只願躲避災禍，每天欣賞麋鹿間遊。",
"〚0013:1：8〛"=>"我乘興而來，被您的淡泊情懷所感，以致迷失了出處。同您在一起漫遊，彷彿
是坐上一隻隨意飄浮的小舟。",
"〚0013:2：12〛"=>"這位張先生經常與我相見，眼下天色已晚，卻仍然邀我留下，以盡晚間之興。",
"〚0013:2：13〛"=>"晴明的潭水上，鱣魚游躍，弄出「發發」的聲響。春天的草野間，傳來「呦
呦」的鹿鳴。",
"〚0013:2：14〛"=>"這酒啊，說來本是我們杜家釀造的，現在卻要勞您相勸；晉代的張公之梨當
是美味，恰好您也姓張，所以也就不必到大谷求購。",
"〚0013:2：15〛"=>"前村的山路雖然艱險，卻已在醉中走熟；讓我們盡情地喝吧，來個一醉方休。")
,

);
?>