0003望嶽

岱宗夫如何。齊魯青未了。
泰山的高大究竟如何？走遍齊魯大地都能看到它的青色。

造化鍾神秀。陰陽割昏曉。
天地把神奇和秀美聚集在它身上，那高大的山峯陰面是黃昏，陽面卻是清曉。

盪胸生曾雲。決眥入歸鳥。
山間雲氣生騰，層層疊疊，令我心胸激蕩；我極盡目力，追羨那飛入山間的歸鳥。

會當凌絕頂。一覽眾山小。
啊，定會有一天登上絕頂，俯看腳下羣山的渺小！

0008登兗州城樓

東郡趨庭日。南樓縱目初。
來兗州探望父親的日子裏，我初次登上城南樓。

浮雲連海岱。平野入青徐。
縱目遠望，浮雲連綿於大海、泰山的上空，平野一直伸展到青徐二州。

孤嶂秦碑在。荒城魯殿餘。
孤高的嶧山上依舊矗立著秦皇的石碑，荒涼的曲阜城內還存留著魯共王的宮殿。

從來多古意。臨眺獨躊躇。
我素來多有懷古之意，當此登臨之際獨自生出萬千感慨。

0013題張氏隱居二首

春山無伴獨相求。伐木丁丁山更幽。
漫遊春山卻無伴侶，因而特意把您訪求，丁丁的伐木聲，更顯出山谷的清幽。

澗道餘寒歷冰雪。石門斜日到林丘。
走過澗道上殘留的凍雪，穿過斜陽輝映的石門，終於來到您的林中茅屋。

不貪夜識金銀氣。遠害朝看麋鹿遊。
您不貪戀財物，夜間不去觀察金銀之氣；只願躲避災禍，每天欣賞麋鹿閑遊。

乘興杳然迷出處。對君疑是泛虛舟。
我乘興而來，被您的淡泊情懷所感，以致迷失了出處。同您在一起漫遊，彷彿是坐上一隻隨意飄浮的小舟。

之子時相見。邀人晚興留。
這位張先生經常與我相見，眼下天色已晚，卻仍然邀我留下，以盡晚間之興。

霽潭鱣發發。春草鹿呦呦。
晴明的潭水上，鱣魚游躍，弄出「發發」的聲響。春天的草野間，傳來「呦呦」的鹿鳴。

杜酒偏勞勸。張梨不外求。
這酒啊，說來本是我們杜家釀造的，現在卻要勞您相勸；晉代的張公之梨當是美味，恰好您也姓張，所以也就不必到大谷求購。

前村山路險。歸醉每無愁。
前村的山路雖然艱險，卻已在醉中走熟；讓我們盡情地喝吧，來個一醉方休。

0022劉九法曹鄭瑕丘石門宴集

秋水清無底。蕭然淨客心。
秋水清清深不見底，清淨冷落得令人心無雜念。

掾曹乘逸興。鞍馬到荒林。
劉、鄭二位屬官乘著雅興，騎馬來到郊野山林。

能吏逢聯璧。華筵直一金。
二位賢能有如一雙美玉，今日得以欣逢；舉辦如此盛大的筵席，其價可値錢幣一金。

晚來橫吹好。泓下亦龍吟。
晚來橫笛吹起美好的樂曲，深水裏的蛟龍也隨之長吟。

0025與任城許主簿遊南池

秋水通溝洫。城隅進小船。
秋水通連起溝溝渠渠，在城的一角我們放船遊覽。

晚涼看洗馬。森木亂鳴蟬。
時當傍晚，天氣涼爽，百姓們在水邊洗馬；茂密的樹林中蟬聲響成一片。

菱熟經時雨。蒲荒八月天。
秋雨過後，水下的菱角已經成熟；時當八月，水邊的野草也已荒殘。

晨朝降白露。遙憶舊青氈。
明天早晨就是白露節了，我不禁憶起遙遠故鄕的舊青氈。

0027對雨書懷走邀許主簿

東岳雲峯起。溶溶滿太虛。
震雷翻幕燕。驟雨落河魚。
座對賢人酒。門聽長者車。
相邀愧泥濘。騎馬到階除。
0030巳上人茅齋

巳公茅屋下。可以賦新詩。
在巳公的茅屋下面，可以寫出新的詩篇。

枕簟入林僻。茶瓜留客遲。
枕席鋪設在樹林間，多麼僻靜；用茶果待客，長時間地把我挽留。

江蓮搖白羽。天棘蔓青絲。
江面上的蓮花像搖動著白色的羽毛，天門冬伸延著青翠的絲蔓。

空忝許詢輩。難酬支遁詞。
我徒然忝列於許詢那樣的名人中，巳公則如高人支遁，精深的議論令我難以酬答。

0034房兵曹胡馬

胡馬大宛名。鋒稜瘦骨成。
房兵曹的馬是著名的大宛馬，骨骼突出，帶角帶棱。

竹批雙耳峻。風入四蹄輕。
雙耳尖削，像斜削的竹筒；四蹄輕快，似捲動的勁風。

所向無空闊。眞堪託死生。
所向之地，不存在漫長的里程，可謂千里一步，眞可託之以生命。

驍騰有如此。萬里可橫行。
有如此善於奔騰的良馬，足可橫行萬里，建立軍功。

0038畫鷹

素練風霜起。蒼鷹畫作殊。
白色的畫絹上彷彿捲起一片肅殺的風霜，哦，這幅蒼鷹繪畫眞是超凡絕俗。

㩳身思狡兔。側目似愁胡。
看那蒼鷹挺著身子，似乎是想搜尋狡兔；斜著眼珠，活像一隻發愁的猴子。

絛鏇光堪擿。軒楹勢可呼。
絛鏇閃著亮光，簡直可以摘下；它像眞鷹一樣立在軒楹之間，完全可以呼之去打獵呢！

何當擊凡鳥。毛血灑平蕪。
啊，應當讓它去出擊凡鳥，它定會把凡鳥的毛血灑棄在平遠〘疑爲「原」〙的草地上！

0042遊龍門奉先寺

已從招提遊。更宿招提境。
有幸遊覽了奉先寺，晚間又住在這裏。

陰壑生虛籟。月林散清影。
陰暗的山谷響起陣陣風聲，月下的樹林閃爍著斑斑清影。

天闕象緯逼。雲臥衣裳冷。
龍門高聳，星辰低垂；榻臥雲裏，寒氣透衣。

欲覺聞晨鐘。令人發深省。
將醒之時聽到佛寺晨鐘敲響，一聲聲叩擊心弦，令人生發深刻的警悟。

0048過宋員外之問舊莊[員外季弟執金吾。見知於代。故有下句]

宋公舊池館。零落首陽阿。
宋之問先生當年的別墅，如今零落在首陽山下。

枉道祗從入。吟詩許更過。
我繞道趕路恰好經過這裏，前輩啊，允許我來相訪吟詩嗎？

淹留問耆老。寂寞向山河。
我停留下來，訪問他的子孫；懷著寂寞的心情，悵望眼前的山河。

更識將軍樹。悲風日暮多。
我還見到了宋之悌將軍栽種的樹木，悲涼的晚風吹過樹間，留下了眾多的訴說。

0053臨邑舍弟書至。苦雨。黃河泛溢。隄防之患。簿領所憂。因寄此詩。用寬其意

二儀積風雨。百谷漏波濤。
天地間風雨不止，條條山谷傾洩著波濤。

聞道洪河坼。遙連滄海高。
聽說黃河已經決口，高高的水浪與遠處的大海連成一片。

職司憂悄悄。郡國訴嗷嗷。
治水的官吏憂心忡忡，災區的百姓哭訴哀號。

舍弟卑栖邑。防川領簿曹。
弟弟屈身在臨邑縣供職，官爲主簿負責防治河水。

尺書前日至。版築不時操。
前天收到你寄來的信，信中說你們正在緊張地加固堤防。

難假黿鼉力。空瞻烏鵲毛。
難以藉助黿鼉之力抵禦洪水，徒然仰望烏鵲前來搭橋。

燕南吹畎畝。濟上沒蓬蒿。
燕南地區莊稼全毀，濟南兗州蓬蒿皆沒。

螺蚌滿近郭。蛟螭乘九皋。
螺蚌無數，生滿城外；蛟螭肆虐，在深澤中橫行。

徐關深水府。碣石小秋毫。
徐關淪爲深深的水府，碣石山變成小小的秋毫。

白屋留孤樹。青天失萬艘。
百姓的茅屋被水沖走，只留下孤零零的樹木。青天之下竟有許多船隻失事沉沒。

吾衰同泛梗。利涉想蟠桃。
我身體衰弱形同漂浮的桃梗，卻仍想涉過大水去摘蟠桃；

卻倚天涯釣。猶能掣巨鼇。
摘來蟠桃當作釣餌，倚在天邊釣起那釀造水患的巨鰲。

0059天寶初。南曹小司寇舅。於我太夫人堂下。壘土爲山。一匱盈尺。以代彼朽木。承諸焚香瓷甌。甌甚安矣。旁植慈竹。蓋茲數峯。嶔岑嬋娟。宛有塵外數致。乃不知興之所至。而作是詩

一匱功盈尺。三峯意出羣。
一筐土就能使山長高一尺，三座小山意態超羣。

望中疑在野。幽處欲生雲。
望過去彷彿是野外的真山，幽深之處幾乎要生出雲霧。

慈竹春陰覆。香爐曉勢分。
慈竹的春陰覆蓋著它們，香爐的曉煙分佈其間。

惟南將獻壽。佳氣日氛氳。
由於它們要像南山一樣爲祖母獻壽，所以佳氣一天比一天顯得鬱勃。

0062李監宅二首

尙覺王孫貴。豪家意頗濃。
屛開金孔雀。褥隱繡芙蓉。
且食雙魚美。誰看異味重。
門闌多喜色。女婿近乘龍。
華館春風起。高城煙霧開。
雜花分戶映。嬌燕入簷迴。
一見能傾座。虛懷只愛才。
鹽車雖絆驥。名是漢庭來。
0068夜宴左氏莊

風林纖月落。衣露淨琴張。
林中微風吹起，一勾纖月墜落西方。夜露打濕了衣裳，我把寧靜的琴兒彈響。

暗水流花徑。春星帶草堂。
暗水流過花徑，水聲縈繞耳旁；夜空星兒歷歷，迤邐帶過草堂。

檢書燒燭短。看劍引杯長。
作詩查檢書籍，已將蠟燭燒短；看劍寄託壯志，頻頻滿飲酒漿。

詩罷聞吳詠。扁舟意不忘。
新詩寫罷，忽聽有人用吳音吟誦，我的心不禁穿過浩渺的時空，飛落到當年范蠡的小船上。

0073龍門

龍門橫野斷。驛樹出城來。
橫踞大野的龍門山陡然中斷，驛道兩旁的樹木自洛陽城門排列而來。

氣色皇居近。金銀佛寺開。
這裏靠近皇城氣象雄闊；眾多寺廟列於眼前，流金溢彩。

往還時屢改。川陸日悠哉。
在我來往於此地的當兒，時光頻頻更移；那山川大地卻長存久留，面貌不改。

相閱征途上。生涯盡幾迴。
哎，征途上欣賞龍門盛景，這樣的事在我一生中還能有幾回？

0076贈李白

二年客東都。所歷厭機巧。
我在洛陽居住的兩年間，對所遇到的投機取巧之徒十分討厭。

野人對羶腥。蔬食常不飽。
眼瞅富貴人家大魚大肉地吃著，我這個在野之人卻連粗飯都經常吃不飽。

豈無青精飯。使我顏色好。
難道就沒有使我容顏美好的青精飯嗎？

苦乏大藥資。山林迹如掃。
只是苦於缺乏煉丹的資財，所以終究沒能走入山林。

李侯金閨彥。脫身事幽討。
李侯是金馬門的才子，如今也離開宮廷要到山林去採藥和訪道。

亦有梁宋遊。方期拾瑤草。
我也想去梁宋一遊，正好與你同行，希望能拾到仙境中的瑤草。

0079陪李北海宴歷下亭[時邑人蹇處士等在座]

東藩駐皁蓋。北渚凌青荷。
李公在歷下亭駐下太守的車蓋，我由北渚經過清河前來拜訪。

海右此亭古。濟南名士多。
歷下亭是齊地最古老的亭台，濟南是名士輩出的地方。

雲山已發興。玉佩仍當歌。
雲山磅礴已令人生發詩興，美人陪飲更令人對酒高歌。

修竹不受暑。交流空湧波。
修長的竹林清爽無比，致使交流的河水徒然湧波送涼。

蘊眞愜所遇。落日將如何。
這裏的景物蘊含眞趣，令人心怡；可惜紅日西沉，宴會將散，無可奈何。

貴賤俱物役。從公難重過。
貴者如公、賤者如我同是被事物役使，恐怕今後難以把您重訪。

0084同李太守登歷下古城員外新亭[亭對鵲湖]

新亭結構罷。隱見清湖陰。
新亭已經落成，掩映在鵲山湖的南面。

迹藉臺觀舊。氣冥海岳深。
坐落於臺觀的舊址，氣象高遠，連接著大海和泰山。

圓荷想自昔。遺堞感至今。
湖中圓荷田田，城上古堞歷歷，令人感到此處自古至今景觀的勝絕。

芳宴此時具。哀絲千古心。
此時，華美的宴席已經備好，哀切的弦聲奏出千古遐思。

主稱壽尊客。筵秩宴北林。
主人舉杯爲尊客祝壽，座席井然有序，開宴於城北林邊。

不阻蓬蓽興。得兼梁甫吟。
主人不阻我這貧士的興致，使我有機會再唱一支《梁甫吟》。

0092暫如臨邑。至㟙山湖亭。奉懷李員外。率爾成興

野亭逼湖水。歇馬高林間。
野亭緊靠著鵲山湖水，我在高大的林間停下馬來。

鼉吼風奔浪。魚跳日映山。
湖中鰐魚吼叫，大風掀動巨浪。魚兒躍出水面，斜陽映著青山。

暫遊阻詞伯。卻望懷青關。
暫時出遊，前來告別詞伯，卻未能如願；回身遙望他所去往的青州，久久將他懷想。

靄靄生雲霧。唯應促駕還。
天色已晚，山水間雲霧密布，正如我迷茫的心情；只盼先生盡快歸還。

0095與李十二白同尋范十隱居

李侯有佳句。往往似陰鏗。
余亦東蒙客。憐君如弟兄。
醉眠秋共被。攜手日同行。
更想幽期處。還尋北郭生。
入門高興發。侍立小童清。
落景聞寒杵。屯雲對古城。
向來吟橘頌。誰欲討蓴羹。
不願論簪笏。悠悠滄海情。
0099贈李白

秋來相顧尙飄蓬。未就丹砂愧葛洪。
痛飲狂歌空度日。飛揚跋扈爲誰雄。
