<?php
/*
生成：本文檔用 PHP 生成。
生成程式：
php H:\github\Dufu-Analysis\analysis_programs\生成版本評論.php 顧
說明：本文檔儲存顧宸《辟疆園杜詩註解》評論。
應用程式： 
php h:\github\Dufu-Analysis\analysis_programs\搜索程式\頁碼、簡稱→評論.php 0003 顧
*/
$顧評論=array(
'〚0013:〛'=>array(
'曰無伴。言可與偕隱者少也。惟無伴。故獨相求。獨相求而山更幽。山中若無人。張氏爲眞隱矣。',
'愚謂石門與澗道爲對。不必實指其地。只言隱居之處。石爲門耳。[不貪]兩句須七字一氣讀下。若作上二字下五字句法。便文義梗碍矣。首曰無伴。結曰對君。似已得伴矣。乃疑是泛虛舟。仍無人也。如此方悟公獨相求之意。方悟公求友而山更幽之意。起結相應有妙理。可與真隱者道。',
'公獨求張氏于空山之中。至歷澗道。披石門，而後相見。則之子匪易見也。及是時始相見耳。故曰之子時相見。若作時時與相見。則張氏非隱居矣。黃常明詩話。子美多用經語。如車轔轔。馬蕭蕭。鱣發發。鹿呦呦。皆渾成嚴重。法度森然。後人不敢用者。豈非造語膚淺不類耶。[另參仇兆鰲《杜詩詳註》]用杜酒張梨。公弄此小巧。若曰。此我家酒也。偏勞爾勸。此爾家梨也。不必外求。然蘊藉不覺。醉于馬上往來輕。正公忘憂良法。',
));
?>