<?php
"詩題"=>"絕句漫興九首",
"詩文"=>"眼見客愁愁不醒。無賴春色到江亭。卽遣花開深造次。便覺鶯語太丁寧。手種桃李非無主。野老牆低還是家。恰似春風相欺得。夜來吹折數枝花。熟知茅齋絕低小。江上燕子故來頻。銜泥點汙琴書內。更接飛蟲打著人。二月已破三月來。漸老逢春能幾迴。莫思身外無窮事。且盡生前有限杯。腸斷江春欲盡頭。杖藜徐步立芳洲。顛狂柳絮隨風去。輕薄桃花逐水流。懶慢無堪不出村。呼兒日在掩柴門。蒼苔濁酒林中靜。碧水春風野外昏。糝徑楊花鋪白氈。點溪荷葉疊青錢。筍根稚子無人見。沙上鳧雛旁母眠。舍西柔桑葉可拈。江畔細麥復纖纖。人生幾何春已夏。不放香醪如蜜甜。隔戶楊柳弱嫋嫋。恰似十五女兒腰。謂誰朝來不作意。狂風挽斷最長條。",
"詩句"=>array("眼見客愁愁不醒","無賴春色到江亭","卽遣花開深造次","便覺鶯語太丁寧","手種桃李非無主","野老牆低還是家","恰似春風相欺得","夜來吹折數枝花","熟知茅齋絕低小","江上燕子故來頻","銜泥點汙琴書內","更接飛蟲打著人","二月已破三月來","漸老逢春能幾迴","莫思身外無窮事","且盡生前有限杯","腸斷江春欲盡頭","杖藜徐步立芳洲","顛狂柳絮隨風去","輕薄桃花逐水流","懶慢無堪不出村","呼兒日在掩柴門","蒼苔濁酒林中靜","碧水春風野外昏","糝徑楊花鋪白氈","點溪荷葉疊青錢","筍根稚子無人見","沙上鳧雛旁母眠","舍西柔桑葉可拈","江畔細麥復纖纖","人生幾何春已夏","不放香醪如蜜甜","隔戶楊柳弱嫋嫋","恰似十五女兒腰","謂誰朝來不作意","狂風挽斷最長條")
?>