<?php
"詩題"=>"春日江村五首",
"詩文"=>"農務村村急。春流岸岸深。乾坤萬里眼。時序百年心。茅屋還堪賦。桃源自可尋。艱難昧生理。飄泊到如今。迢遞來三蜀。蹉跎有六年。客身逢故舊。發興自林泉。過懶從衣結。頻遊任履穿。藩籬無限景。恣意買江天。種竹交加翠。栽桃爛熳紅。經心石鏡月。到面雪山風。赤管隨王命。銀章付老翁。豈知牙齒落。名玷薦賢中。扶病垂朱紱。歸休步紫苔。郊扉存晚計。幕府愧羣材。燕外晴絲卷。鷗邊水葉開。鄰家送魚鼈。問我數能來。羣盜哀王粲。中年召賈生。登樓初有作。前席竟爲榮。宅入先賢傳。才高處士名。異時懷二子。春日復含情。",
"詩句"=>array("農務村村急","春流岸岸深","乾坤萬里眼","時序百年心","茅屋還堪賦","桃源自可尋","艱難昧生理","飄泊到如今","迢遞來三蜀","蹉跎有六年","客身逢故舊","發興自林泉","過懶從衣結","頻遊任履穿","藩籬無限景","恣意買江天","種竹交加翠","栽桃爛熳紅","經心石鏡月","到面雪山風","赤管隨王命","銀章付老翁","豈知牙齒落","名玷薦賢中","扶病垂朱紱","歸休步紫苔","郊扉存晚計","幕府愧羣材","燕外晴絲卷","鷗邊水葉開","鄰家送魚鼈","問我數能來","羣盜哀王粲","中年召賈生","登樓初有作","前席竟爲榮","宅入先賢傳","才高處士名","異時懷二子","春日復含情")
?>