<?php
"詩題"=>"夔州歌十絕句",
"詩文"=>"中巴之東巴東山。江水開闢流其閒。白帝高爲三峽鎮。瞿塘險過百牢關。白帝夔州各異城。蜀江楚峽混殊名。英雄割據非天意。霸主幷吞在物情。羣雄競起問前朝。王者無外見今朝。比訝漁陽結怨恨。元聽舜日舊簫韶。赤甲白鹽俱刺天。閭閻繚繞接山巔。楓林橘樹丹青合。複道重樓錦繡懸。瀼東瀼西一萬家。江北江南春冬花。背飛鶴子遺瓊蘂。相趂鳧雛入蔣芽。東屯稻畦一百頃。北有澗水通青苗。晴浴狎鷗分處處。雨隨神女下朝朝。蜀麻吳鹽自古通。萬斛之舟行若風。長年三老長歌裏。白晝攤錢高浪中。憶昔咸陽都市合。山水之圖張賣時。巫峽曾經寶屛見。楚宮猶對碧峯疑。閬風玄圃與蓬壺。中有高唐天下無。借問夔州壓何處。峽門江腹擁城隅。武侯祠堂不可忘。中有松栢參天長。干戈滿地客愁破。雲日如火炎天涼。",
"詩句"=>array("中巴之東巴東山","江水開闢流其閒","白帝高爲三峽鎮","瞿塘險過百牢關","白帝夔州各異城","蜀江楚峽混殊名","英雄割據非天意","霸主幷吞在物情","羣雄競起問前朝","王者無外見今朝","比訝漁陽結怨恨","元聽舜日舊簫韶","赤甲白鹽俱刺天","閭閻繚繞接山巔","楓林橘樹丹青合","複道重樓錦繡懸","瀼東瀼西一萬家","江北江南春冬花","背飛鶴子遺瓊蘂","相趂鳧雛入蔣芽","東屯稻畦一百頃","北有澗水通青苗","晴浴狎鷗分處處","雨隨神女下朝朝","蜀麻吳鹽自古通","萬斛之舟行若風","長年三老長歌裏","白晝攤錢高浪中","憶昔咸陽都市合","山水之圖張賣時","巫峽曾經寶屛見","楚宮猶對碧峯疑","閬風玄圃與蓬壺","中有高唐天下無","借問夔州壓何處","峽門江腹擁城隅","武侯祠堂不可忘","中有松栢參天長","干戈滿地客愁破","雲日如火炎天涼")
?>