<?php
"詩題"=>"暮春題瀼西新賃草屋五首",
"詩文"=>"久嗟三峽客。再與暮春期。百舌欲無語。繁花能幾時。谷虛雲氣薄。波亂日華遲。戰伐何由定。哀傷不在茲。此邦千樹橘。不見比封君。養拙干戈際。全生麋鹿羣。畏人江北草。旅食瀼西雲。萬里巴渝曲。三年實飽聞。綵雲陰復白。錦樹曉來青。身世雙蓬鬢。乾坤一草亭。哀歌時自短。醉舞爲誰醒。細雨荷鋤立。江猿吟翠屛。壯年學書劍。他日委泥沙。事主非無祿。浮生卽有涯。高齋依藥餌。絕域改春華。喪亂丹心破。王臣未一家。欲陳濟世策。已老尚書郎。未息豺虎鬬。空慚鴛鷺行。時危人事急。風逆羽毛傷。落日悲江漢。中宵淚滿牀。",
"詩句"=>array("久嗟三峽客","再與暮春期","百舌欲無語","繁花能幾時","谷虛雲氣薄","波亂日華遲","戰伐何由定","哀傷不在茲","此邦千樹橘","不見比封君","養拙干戈際","全生麋鹿羣","畏人江北草","旅食瀼西雲","萬里巴渝曲","三年實飽聞","綵雲陰復白","錦樹曉來青","身世雙蓬鬢","乾坤一草亭","哀歌時自短","醉舞爲誰醒","細雨荷鋤立","江猿吟翠屛","壯年學書劍","他日委泥沙","事主非無祿","浮生卽有涯","高齋依藥餌","絕域改春華","喪亂丹心破","王臣未一家","欲陳濟世策","已老尚書郎","未息豺虎鬬","空慚鴛鷺行","時危人事急","風逆羽毛傷","落日悲江漢","中宵淚滿牀")
?>