<?php
"詩題"=>"九日五首",
"詩文"=>"重陽獨酌盃中酒。抱病起登江上臺。竹葉於人既無分。菊花從此不須開。殊方日落玄猿哭。舊國霜前白雁來。弟妹蕭條各何往。干戈衰謝兩相催。舊日重陽日。傳盃不放盃。卽今蓬鬢改。但愧菊花開。北闕心長戀。西江首獨迴。茱萸賜朝士。難得一枝來。舊與蘇司業。兼隨鄭廣文。采花香泛泛。坐客醉紛紛。野樹歌還倚。秋砧醒卻聞。歡娛兩冥莫。西北有孤雲。故里樊川菊。登高素滻源。他時一笑後。今日幾人存?巫峽蟠江路。終南對國門。繫舟身萬里。伏枕淚雙痕。爲客裁烏帽。從兒具綠樽。佳辰對羣盜。愁絕更誰論。",
"詩句"=>array("重陽獨酌盃中酒","抱病起登江上臺","竹葉於人既無分","菊花從此不須開","殊方日落玄猿哭","舊國霜前白雁來","弟妹蕭條各何往","干戈衰謝兩相催","舊日重陽日","傳盃不放盃","卽今蓬鬢改","但愧菊花開","北闕心長戀","西江首獨迴","茱萸賜朝士","難得一枝來","舊與蘇司業","兼隨鄭廣文","采花香泛泛","坐客醉紛紛","野樹歌還倚","秋砧醒卻聞","歡娛兩冥莫","西北有孤雲","故里樊川菊","登高素滻源","他時一笑後","今日幾人存?巫峽蟠江路","終南對國門","繫舟身萬里","伏枕淚雙痕","爲客裁烏帽","從兒具綠樽","佳辰對羣盜","愁絕更誰論"),
"題注"=>"闕一首"
?>