<?php
"詩題"=>"觀公孫大娘弟子舞劍器行",
"詩文"=>"昔有佳人公孫氏。一舞劍器動四方。觀者如山色沮喪。天地爲之久低昂。㸌如羿射九日落。矯如羣帝驂龍翔。來如雷霆收震怒。罷如江海凝清光。絳唇珠袖兩寂寞。況有弟子傳芬芳。臨潁美人在白帝。妙舞此曲神揚揚。與余問答既有以。感時撫事增惋傷。先帝侍女八千人。公孫劍器初第一。五十年間似反掌。風塵澒動昏王室。梨園弟子散如煙。女樂餘姿映寒日。金粟堆南木已拱。瞿唐石城草蕭瑟。玳筵急管曲復終。樂極哀來月東出。老夫不知其所往。足繭荒山轉愁疾。",
"詩句"=>array("昔有佳人公孫氏","一舞劍器動四方","觀者如山色沮喪","天地爲之久低昂","㸌如羿射九日落","矯如羣帝驂龍翔","來如雷霆收震怒","罷如江海凝清光","絳唇珠袖兩寂寞","況有弟子傳芬芳","臨潁美人在白帝","妙舞此曲神揚揚","與余問答既有以","感時撫事增惋傷","先帝侍女八千人","公孫劍器初第一","五十年間似反掌","風塵澒動昏王室","梨園弟子散如煙","女樂餘姿映寒日","金粟堆南木已拱","瞿唐石城草蕭瑟","玳筵急管曲復終","樂極哀來月東出","老夫不知其所往","足繭荒山轉愁疾")
?>