<?php
/*
生成：本文檔用 PHP 生成。
程式：生成版本評論.php
說明：本文檔儲存版本評論。
*/
$名評論=array(
'〚0008:〛'=>'黃生《杜詩說》：前半登樓之景，後半懷古之情，其驅使名勝古迹，能作第一種語。此與《嶽陽樓》詩，並足淩轢千古。',
'〚0008:〛'=>'仇兆鰲《杜詩詳註》：公至兗州省侍而詠南樓也。通首皆登樓所見，「海岱」「青徐」屬遠景，故以「縱目」二字起之。「秦碑」「魯殿」屬近景，故以「臨眺」二字結之。仍在上下四句分截。趙汸云：三四宏闊，俯仰千里。五六微婉，上下千年。曰「從來」則平昔懷抱可知。曰「獨」則登樓者未必皆知。',
'〚0042:〛'=>'王嗣奭《杜臆》：人在塵混中，眞性淪隱，若身離塵表，其情趣自別。而又宿於其境，對鳳月則耳目清曠，近星雲則心神悚惕。已上六句，步緊一步，逼到夢將覺而觸於鐘聲，道心之微忽然呈露，猶之剝復交而天心見，勿淺視此深省語也。',
'〚0042:〛'=>'金聖歎《杜詩解》：題是《遊龍門奉先寺》，及讀其詩起二句，卻云「已從招提遊，更宿招提境」。「已」字「更」字，是結過上文再起下文之法。今用筆如此，豈此詩乃是補寫遊以後事耶？然則當時此題，豈本有二詩，而忘其第一首耶？我反復思之，不得其故。一日無事閑坐，而忽然知之。蓋此篇乃先生教人作詩不得輕易下筆也。卽如是日於正遊時，若欲信手便作，豈便無詩一首，然而「陰壑」「月林」之境必不及矣。夫此境若不及，便是沒交涉；夫作詩沒交涉，便如不曾作。先生是以排徊不去，務盡其理。題中自標「遊」字，詩必成於宿後。如是，便將淺人遊山一切皮語、熟語、村語，掀剝略盡，然後另出手眼，成此新栽。杜詩爲千古絕唱，溝不誣也。',
'〚0943:〛'=>'王嗣奭《杜臆》：昌黎《南山》，韻賦爲詩，少陵《北征》，韻記爲詩，體不相蒙。《南山》琢鏤湊砌，詰屈奇怪，創體傑出，不可無一，不可有二，不易學，亦不必學，總不脫文人習氣。《北征》固是雅調，古來詞人多用之，如韓之《赴江陵寄三學士》等作，庶可與之雁行也。',
'〚0943:〛'=>'葉夢得《石林詩話》：長篇最難，晉、魏以前，無過十韻者，蓋古人以意逆志，初不以敘事傾倒爲工。至杜子美《北征》、《述懷》諸篇，窮極筆力，如太史公記傳，此古今絕唱也。',
'〚0943:〛'=>'胡應麟《詩藪》：杜之《北征》、《述懷》，皆長篇敘事，然高者尙有漢人遺意，平者遂爲元、白濫觴。李《送魏萬》等篇，自是齊、梁，但才力加雄，辭藻增富耳。',
'〚0943:〛'=>'鍾惺《唐詩歸》：讀少陵《奉先詠懷》、《北征》等篇，知五言古長篇不易作。當於潦倒淋漓、忽正忽反、若整若亂、時斷時續處，得其篇法之妙。',
'〚0943:〛'=>'金聖嘆《杜詩解》：北征，先生自行在奉詔還鄜州，迎看家室也。題是北歸，通篇詩全是憂勞朝廷，一片深心至計。雖十六解至二十三解稍敘妻女，然純是心在朝廷，恍惚如夢語。讀之悲感橫生，涕淚交下。');
?>