<?php
/*
生成：本文檔用 PHP 生成。
生成程式：
php H:\github\Dufu-Analysis\analysis_programs\生成版本評論.php 錢
說明：本文檔儲存錢謙益《錢注杜詩》評論。
應用程式： 
php h:\github\Dufu-Analysis\analysis_programs\搜索程式\頁碼、簡稱→評論.php 0003 錢
*/
$錢評論=array(
'〚3789:〛'=>array(
'箋曰：此詩舊箋影略，末悉其篇章次第，鉤鎖開闔。今要而言之：玉露凋傷章。秋興之發端也。江間塞上，狀其悲壯；叢菊孤舟，寫其悽緊。末二句結上生下，故卽以夔府孤城次之。絕塞高城，杪秋薄暮，俄看落日，俄見南斗。爐煙熸而哀猿號，急杵斷而悲笳發。蘿月蘆花，淒情滿眼；蕭辰遙夜，攢簇一時。請看二字，緊映每依南斗，卽連上城高暮砧，當句呼應耳。夜夜如此，朝朝亦然。日日如此，信宿亦然。心抱南斗京華之思，身與漁人燕子爲侶，遠則匡衡、劉向之不如；近則同學輕肥之相笑。第三章正申秋興名篇之意。古人所謂文之心也。然每依北斗望京華一句，是三章中吃緊齧節。蕭條歲晚，身事如此；長安綦局，世事如此。企望京華，平居寂寞，故曰百年世事不勝悲也。次下以乃重章以申之。蓬萊宮闕一章，思全盛日之長安也。瞿唐峽口一章，思陷沒後之長安也。昆明池水一章，思自古帝王之長安也。昆吾御宿一章，思承平昔遊之長安也。由瞿唐鳥道之區，指曲江禁近之地，兵塵秋氣，萬里連延。首章卽云塞上風雲接地陰也。唐時遊幸，莫盛於曲江，故悲陷沒則先舉曲江。漢朝形勝，莫壯於昆明，故追隆古則特舉昆明。曰漢時，曰武帝，正尅指自古帝王也。此章益感歎遣蹟，企想其姸麗，而自傷遠不得見，乃疊申曲江，末句文勢了然。今以爲槪指喪亂則迂矣。天寶之禍，干戈滿地，營壘俱在國西。及郭令收西京，陳於香積寺北、澧水之東，皆漢上林苑地，在昆明御宿之間。然城南故地，風景無恙，故曰自逶迤也。碧梧紅豆，秋色依然；拾翠同舟，春遊如昨。追綵筆於壯盛，感星象於至尊，豈非神遊化人？夢迴帝所，低垂吟望，至是而秋興之能事畢矣。此詩一事疊爲八章，章雖有八，重重鉤攝，有無量樓閣門在。今人都理會不到，但少分理會，便恐隨逐穿穴，如鼷鼠入牛角中耳。餘義則更於分章下詳之。',
),
'〚3789:1:〛'=>array(
'箋曰：《招魂》曰：湛湛江水兮上有楓，目極千里兮傷春心。宋玉以楓樹之茂盛傷心，此以楓樹之凋傷起興也。◯又曰：江間洶湧，則上接風雲；塞上陰森，則下連波浪。此所謂悲壯也。叢菊兩開，儲別淚於他曰；孤舟一繫，僦歸心於故園，此所謂悽緊也。秋夜《客舍》詩云：南菊再逢人臥病。公在夔府，兩見菊花，故有兩開之句。舊箋指樊川故里之菊，非也。《九日》詩云：繫舟身萬里。孤舟一繫，卽巳辨故園之心矣，所謂遠望當歸也。以節則杪秋，以地則高城，以時則薄暮，刀尺苦寒，急砧促別。末句標舉興會，略有五重，所謂嗟峨蕭瑟，眞不可言。公孫白帝城，亦英雄割據之地，此地聞碪，尤爲悽斷。《上白帝城》詩云：老去聞悲角，意亦如此。',
),
'〚3789:2:〛'=>array(
'箋曰：孤城落日，悵望京華，曰每依南斗，蓋無夕而不然也。石上之月，巳映藤蘿，又是依斗望京之候矣。請看二字，緊映每字，無限淒斷，見於言外，如云已又過卻一日矣，不知何日得見京華也。◯又曰：每依南斗望京華，皎然所謂截斷眾流句也。孤城碪斷，日薄虞淵，萬里孤臣，翹首京國。雖復八表昏黃，絕塞慘澹，唯此望闕寸心，與南斗共芒色耳。此句爲八首之綱骨，章重文疊，不出於此。聽猿奉使，伏枕悲笳，遙夜憯悽，莫可爲喩。然石上藤蘿之月，已映洲前蘆荻之花矣，莫遂謂長夜漫漫何時旦也。細思請看二字，又更是不覺乍見訝而歎之之詞。作如是解，此二字喚起有力。此翁老不忘君，千歲而下，可以相泣也。',
),
'〚3789:3:〛'=>array(
'箋曰：漁人燕子，卽所見以自傷也，亦以自況也。公抗疏不減匡衡，而近侍移官，一斥不復，故曰功名薄。若劉向雖數奏封事不用，而猶居近侍，典校五經。公則白頭幕府，深愧平生，故曰心事違也。《七歌》云：長安卿相多少年，所謂同學者，蓋長安卿相也。曰少年，曰輕肥，公之目當時卿相如此。◯又曰：山郭千家，朝暉冷聽，寫出夔府孤城也。信宿漁人，不但自況，以其延緣荻葦；攜家嘯歌，羈栖之客，殆有弗如。還泛泛者，亦羨之之詞也。《九辯》曰：燕翩翩其辭歸兮，蟬寂寞而無聲。以燕遇秋寒，徊翔而畏懼也，故以清秋目之，燕燕于飛，詩人取喩送別。己則繫舟伏枕，而燕乃下上辭歸，飛翔促數，攪余心焉。曰故飛飛者，惱亂之詞，亦觸迕也。抗疏之功名旣薄，傳經之心事又違，旋觀同學少年，五陵衣馬，亦漁人燕子之儔侶耳。故以自輕肥薄之。下一自字，與還泛泛、故飛飛，翻倒相應。杜陵有布衣，老大心轉拙，於長安卿相何有哉。',
),
'〚3789:4:〛'=>array(
'箋曰：長安以奕下棋，言謀國者如奕棋之無定算，故貽禍於百年之後，而不勝其悲也。百年世事，用辛有之言也。王侯第宅，指誤國之人，如林甫、國忠輩也。玄宗寵任蕃將，而肅宗信向中官，俾居朝右，文武衣冠，皆異於昔時也。所謂百年世事者如此。◯又曰：肅宗收京已後，委任中人，中外多故。公不以移官僻遠，憖置君國之憂，故有聞道長安之章。每依南斗望京華，情見於此。白帝城高，目以故國；兼天波浪，歎彼魚龍。曰平居有所思，殆欲以滄江遺老，奮袖屈指，覆定百年舉棋之局。非徒悲傷晼晚，如昔人願得入帝城而已。',
),
'〚3789:5:〛'=>array(
'箋曰：公詩曰：憶獻三賦蓬萊宮，此記其事也。王母函關，記天寶承平盛事，而荒淫失政，亦略見矣。雲移二句，記朝儀之盛。曰識聖顏者，公以布衣朝見，所謂往時文彩動人主也。落句方及拾遺移官之事。◯又曰：此詩追思長安全盛，敍述其宮闕崇麗，朝省尊嚴，而惑傷則見於末句。蓋自靈武迴鑾，放逐蜀郡舊臣，自此中官竊柄，開元、天寶之盛事，不可復見。而公坐此移官，滄江歲晚，能無三歎於今昔乎？幾回青瑣，追數其近侍奉引，時日無幾也。嗟乎！西望瑤池以下，開寶之長安也。王侯第宅以下，肅宗之長安也。徘徊感歎，亦所謂重章而共述也。',
),
'〚3789:6:〛'=>array(
'箋曰：此記長安失陷之事也。玄宗自秦幸蜀，故有瞿唐、曲江、萬里風煙之感，蓋玄宗幸蜀，正八月也。入邊愁，幷指吐蕃陷長安也。歌舞樂遊之地，一切殘毀，則宗廟宮闕。不言而可知矣。◯又曰：開元中，廣花萼樓，築夾城複道，自南內徑達曲江芙蓉園。亂後，御道崩隤，宸遊絕迹，故曰通御氣也。祿山反報至，上欲遷幸，登興慶宮花萼樓，置酒，四顧悽愴，此所謂入邊愁也。舊箋謂幷指吐蕃陷長安，非也。珠簾繡柱，指陸地帟幕之姸華；錦纜牙穡，指水嬉櫂枻之炫耀。《哀江頭》云：江頭宮殿鎖千門，此則痛定而追思也。長安天府，三成帝畿，故曰周以龍興，秦以虎視。至有唐而胡虜長驅，天子下殿，不亦傷乎？落句之意，以爲樂遊歌舞之地，逸豫不戒。馴至於都邑風煙，九廟灰燼，而自古帝王都會，遂有百年爲戎之歎也。王仲宣《七哀》云：南登灞陵岸，回首望長安。迴首之言，良可深省。',
),
'〚3789:7:〛'=>array(
'箋曰：此借武帝以喩玄宗也。《兵車行》云：武皇開邊意未已。韋應物詩云：少事武皇帝。唐人皆然。◯又曰：今人論唐七言長句，推老杜昆明池水爲冠，實不解此詩所以佳。楊用修曰：觀《西京雜記》、《三輔黃圖》所載，則知盛世殷富之景。觀織女機絲四句，則知兵火凋殘之狀。此亦強作解事耳。敍昆明之勝者，莫如孟堅、平子。一則曰：集乎豫章之館，臨乎昆明之池。左牽牛而右織女，若雲漢之無涯。一則曰：豫章珍館。揭焉中峙，牽牛立其左，織女處其右。日月於是乎出入象扶桑與濛汜。此用修所誇盛世之文也。余謂班、張以漢人敍漢事，鋪陳名勝，故有雲漢日日之言。公以唐人敍漢事，摩娑陳迹，故有機絲夜月之詞。此立言之體也。何謂彼頌鑑華而此傷喪亂乎？菰米蓮房，補班張鋪敍所未見。沉雲墜粉，描盡素秋景物，居然金碧粉本，昆池水黑，故賦言黑水玄阯。菰米沉沉，象池水之玄黑，極言其繁殖也。用修言兵火殘破，菰米漂沉不收，不已倍乎？舊箋謂借漢武以喩玄宗，指武皇開邊爲證。玄宗雖興兵南詔，未嘗如武帝穿昆明以習戰，安得有旌旗在眼之語？《兵車行》、《前後出塞》，諷諫窮兵者多矣，安用於此中廋辭致譏，豈主文譎諫之義乎？今謂昆明一章，緊承上章秦中自古帝王州一句而申言之。時則曰漢時，帝則曰武帝。織女、石鯨，蓮房、菰米，金隄靈沼之遺蹟，與戈船樓櫓，並在眼中，而自傷其僻遠而不得見也。於上章末句。尅指其來脈，則此中敍致，襵疊環鎖，了然分明。如是而曰：七言長句，果以此詩爲首，知此老亦爲點頭矣。末二句正寫所思之況。關塞極天，豈非風煙萬里，滿地一漁翁，卽信宿泛泛之漁人耳。上下俛仰，亦在眼中，謂公自指一漁翁。則陋。',
),
'〚3789:8:〛'=>array(
'箋曰：此記遊宴渼陂之事也。仙侶同舟，指岑參兄弟也。公詩云：氣衝星象表，詩感帝王尊，所謂綵筆昔遊干氣象也。公與岑參輩宴遊，在天寶獻賦之後。窮老追思，故有白頭吟望之歎焉。◯又曰：箋以爲思昔遊之長安是矣，今更指昔遊之地，謂亦連躡上章而來。蓋武帝建元中微行數出，廣開上林，東南至宜春、鼎湖、昆吾、御宿，北繞黃山，周袤數百里。元狩三年，始穿昆明池以象滇河。今詩昆吾御宿二句，正指武帝所開城南故地。言自逶迤者，躡昆明池水言之，謂不獨穿鑿昆明爲武帝之功，凡上林、黃山之間，更衣禁禦，建置歷然，亦皆如昆明旗幟常在眼中也。秦州自古帝王一句，亦總結於此，蓋事訖而重申，亦章重而事別矣。公詩如駭雞之犀，四面皆見，故錯綜牙舉，以告知者。',
));
?>