<?php

/*
生成：本文檔用 PHP 生成。
程式：生成書本注釋.php
說明：把注釋集中在一個文檔裏。
*/
$下定雅弘、松原_朗《杜甫全詩訳注》注釋=array(
"〚0013:1〛"=>"開元二十四年（七三六）以降、斉や趙（山東省から河北省南部）の辺りを遊歷していたときの作品。隠棲していた張氏を初めて訪れて、その住まいに詩を書き付けた。張氏は、『旧唐書』巻一九〇下「李白伝」に見える張叔明か、または〇五一五及び杜甫の文の「雑述」に見える張叔卿。両者は同一人もしくは兄弟と考えられる（詳注に引く黄鶴注）。前半で景色を述べ、後半で心情を述べる。
張氏が隠棲しているところを訪ねて酒を楽しんだときのさまを書く。前詩とは別の時の作。「時に相い見る」とあるので幾u度か訪ねているのであろう。「杜酒」と「張梨」は暗に杜甫と張氏の姓を使っている。前詩と詩形は異なるが韻は同じ。",
"〚0042:1〛"=>"開元二十四年（七三六）以降に、東都洛陽（河南省）を旅して奉先寺を訪れ、宿泊した夜の作。龍門は山の名。河南省洛陽市にあり、二つの山が向かいあって宮殿の門のように見える。龍門の石窟はユネスコの世界遺産に登録されている。奉先寺は龍門の西岸にある石窟寺。第二聯と第三聯は寺の夜の情景で、第四聯には奉先寺で迎えた早朝の心持ちが描かれている。自開元二十四年（736年）以後，杜甫曾旅遊東都洛陽（今河南省），並造訪奉先寺，在那裏過夜後作下此詩。龍門是一座山的名稱，位於河南省洛陽市，兩座山相對而立，形狀彷彿宮殿的大門。龍門石窟現已被聯合國教科文組織登錄爲世界遺產。奉先寺是位於龍門西岸的一座石窟寺。詩的第二聯和第三聯描寫了寺中夜晚的景象，第四聯則表現了詩人在奉先寺迎接清晨時的心境。",
"〚0042:3.1.3-4〛"=>"招提：寺院の異名。梵語に由来する。是寺廟的別名。語源來自梵語。",
"〚0042:4.1.1-2〛"=>"陰壑：山の北側の谷。日陰になる。山的北側的谷地。處於陰暗處。",
"〚0042:4.1.4-5〛"=>"虛籟：風の音。自然が発する音。",
"〚0042:4.2.4-5〛"=>"清影：澄んだ月影。月の光。魏・曹植「公讌詩」（『文選』巻二〇）に「明月[め\いげつ]清景[せ/いえい]澄[す]み、列[れ\つ]宿[しゅう]正[ま\さ]に參差[しんし]たり」。唐・李善注に『説文解字』を引いて「景、光なり」。「景」は「影」に同じ。",
"〚0042:5.1.1-2〛"=>"天闕：天の門。二つの山が向かいあう龍門のさまを天然の門ととらえた。將兩座相對的山，即龍門的樣子，看作天然形成的門。",
"〚0042:5.1.3-4〛"=>"象緯：星のつらなり。星座の形象。",
"〚0042:5.2.1-2〛"=>"雲臥：雲に橫たわる。雲の湧く山中に宿ること。橫臥在雲霧之中。雲橫亙天際。棲居於雲氣騰湧之山中。",
"〚0042:6.2.4-5〛"=>"深省：深い悟り。迷いから目覚めること。深刻的覺悟。從迷惘中醒悟過來。",
"〚3428:1〛"=>"永泰元年（七六五）秋、蜀（四川）の忠州（重慶市忠県）から雲安（重慶市雲陽県）に至る[い/た\る]旅中[りょ/ちゅう]舟中泊[とま]の夜に感懐[か/ん￨かい]を詠[よ]んだ詩。",
"〚3428:3.2.3-4〛"=>"獨夜：家族と同行[ど/うこう]するも独[ひと]り寢つかれない夜。[つかれない：疲れる]",
"〚3789:1〛"=>"大曆元年（七六六）、夔[き]州[しゅう]（重慶市奉節県）の西閣における作。「興」[きょう]は心[こころ]に湧[わ]き上[[あ]]がる思[おも]い。潘岳に「秋興の賦」が有[あ]る。其[そ]の一から其の三までの三首は夔州の秋の描写を中心とし、其の四から其の八までの五首は往[おう]時[じ]の長安の回[かい]想[そう]を中心として詠[うた]う。其の一夔州での秋の夕[ゆう]暮[ぐ]れの物[もの]寂[さび]しさ、其の二は夕暮れから深夜に至[いた]るまでの夔州の寂しさを描き、都[みやこ]に思いを寄せる。",
);
?>