<?php

/*
生成：本文檔用 PHP 生成。
程式：生成書本注釋.php
說明：把譯文集中在一個文檔裏。
*/
$下定雅弘、松原_朗《杜甫全詩訳注》譯文=array(
"〚0013:1:5〛"=>"春の山の中を連れもなく一人で張氏を訪ねて行った。木を切る音がかーんかーんと聞こえてくるので、いっそう深い山中に来た思いがする。
我獨自去春山探望張先生，沒有同伴。我能聽到丁丁的砍樹聲，讓我感覺自己進入了大山的更深處。",
"〚0013:1:6〛"=>"冷気が残っている谷間の道の凍った雪の上を渡って、石の堰[せき]に夕日が当たる頃に木々の茂る君の住む丘まで来た。
我踏過山谷裏殘存寒氣的道路上的冰雪，來到了你居住的山上，周圍綠樹成蔭，夕陽正照在石門上。",
"〚0013:1:7〛"=>"君には物欲がないのでかえって夜になると山に埋まっている金銀の気が立ちのぼるのがわかり、危難とは縁のない暮らしをしているので朝には鹿が安心して遊んでいるのが見える。
因為你沒有物慾，晚上你可以感受到埋藏在山裏的金銀氣升起；因為你過著無憂無慮的生活，所以早上你可以看到麋鹿在安寧地嬉戲。",
"〚0013:1:8〛"=>"興趣の湧くままに山奥深く入って帰り道がわからなくなり、君を見れば君は無人の舟が浮かんでいるかのように無心だ。
我滿懷興致，走入深山，找不到回家的路。看到你的時候，你就像漂浮的空船一樣純眞，毫無機心。",
"〚0013:2:12〛"=>"この人とは時々会う。歓待してくれて夜遅くまでゆっくり楽しむ。
我們常常會面。他熱烈地歡迎我，讓我愉快地逗留到深夜。",
"〚0013:2:13〛"=>"雨後の陽に照らされた淵に鯉がぴちぴちと跳ね、春の草が茂る中、鹿がゆうゆうと鳴く。
雨後陽光照入池中，鯉魚跳躍，鹿兒在茂盛的春草中輕聲鳴叫。",
"〚0013:2:14〛"=>"ひたすら酒を勧めてくれ、梨を庭から取ってきてくれる。
他不斷地勸酒，還從院子裏采來了梨子。",
"〚0013:2:15〛"=>"向かいの村の山道は険しいが、帰りは酔っているのでいつも良い気分だ。
村前面的山路雖然陡峭，但回家的路走熟了，雖然醉酒，但心情良好，不會爲路險而發愁。",
"〚0042:3〛"=>"今日は寺で充分に楽しみ、さらに寺の境内に泊めてもらった。
今天在寺裏盡情遊樂，還被允許在寺內留宿。",
"〚0042:4〛"=>"北の谷からは風の音が響き、月の照る林のもとには澄んだ光が散り敷く。
北谷傳來風聲，月照林下，澄澈月光鋪地流轉。",
"〚0042:5〛"=>"龍門山は天に至る門となって星座が近づき、雲の高みに眠れば衣[こ/ろも]が冷たい。
龍門山乃天界之門，星座彷彿近在咫尺；睡在雲深處，衣裳便感冰冷。",
"〚0042:6〛"=>"目覚めに朝の鐘が聞こえてくると、しみじみと深い感慨が湧いてくる。
醒來時聽見清晨的鐘聲，心中深切的感慨油然而生。[晨鐘乍聞於初醒，深情默湧於心頭。]",
"〚3428:3〛"=>"細[ほそ]く柔[やわ]らかい草が茂る長江の岸辺[き/しべ]をそう[沿う]風が吹く中、旅中[りょ/ちゅう]の私は帆柱[ほ･/ば\しら]を立てた舟の中で独り眠れる夜を過[す]ごす。",
"〚3428:4〛"=>"夜空[よ\ぞら]には満天[あ\め]の星[ぼし]が降[ふ]るように輝き[か/がやき]、地上[ち/じょう]の平野[へ/い￨や]はどこまでも広がり[ひ/ろがり]、水面に浮かぶ[う/かぶ]月影[つ/き･かげ 月光]を湧き[わ/き]上がらせるように波立ち[波立つ な/み･だ\~つ]ながら長江は流[なが]れてゆく。",
"〚3428:5〛"=>"私のようながどうして詩文[し/ぶん]で名声[め/い￨せい]を得[え]ることができようか、この老衰[ろ/う￨すい]と病気では（工部員外郎の）職[しょく]もあきらめるしかない。",
"〚3428:6〛"=>"こうしてふらりふらりと天下を流浪[るろう]する私はいつたい何に似ているかといえば、それは天と地の間を漂[ただよ]うあの岸辺の鷗[かもめ]だ。",
);
?>