<?php
/*
php H:\github\Dufu-Analysis\tests\php\lib\坐標字轉換成基文樹_test.php
*/
use Dufu\Exceptions\ConfirmationFailureException;
use Dufu\Exceptions\InvalidPathException;

//設定測試檔( basename( __FILE__ ) );
$debug = false;
require_once(
	dirname( __DIR__, 3 ) . DIRECTORY_SEPARATOR .
	'tools' . DIRECTORY_SEPARATOR .
	"php" . DIRECTORY_SEPARATOR .
	"lib" . DIRECTORY_SEPARATOR .
	"函式.php" );

$input = '{"447-001":{"〚447:001:3.1.1〛":"亂","〚447:001:3.1.2〛":"雪","〚447:001:3.1.3〛":"千","〚447:001:3.1.4〛":"花","〚447:001:3.1.5〛":"落","〚447:001:3.2.1〛":"新","〚447:001:3.2.2〛":"絲","〚447:001:3.2.3〛":"兩","〚447:001:3.2.4〛":"鬢","〚447:001:3.2.5〛":"生","〚447:001:4.1.1〛":"老","〚447:001:4.1.2〛":"除","〚447:001:4.1.3〛":"吳","〚447:001:4.1.4〛":"郡","〚447:001:4.1.5〛":"守","〚447:001:4.2.1〛":"春","〚447:001:4.2.2〛":"別","〚447:001:4.2.3〛":"洛","〚447:001:4.2.4〛":"陽","〚447:001:4.2.5〛":"城","〚447:001:5.1.1〛":"江","〚447:001:5.1.2〛":"上","〚447:001:5.1.3〛":"今","〚447:001:5.1.4〛":"重","〚447:001:5.1.5〛":"去","〚447:001:5.2.1〛":"城","〚447:001:5.2.2〛":"東","〚447:001:5.2.3〛":"更","〚447:001:5.2.4〛":"一","〚447:001:5.2.5〛":"行","〚447:001:6.1.1〛":"別","〚447:001:6.1.2〛":"花","〚447:001:6.1.3〛":"何","〚447:001:6.1.4〛":"用","〚447:001:6.1.5〛":"伴","〚447:001:6.2.1〛":"勸","〚447:001:6.2.2〛":"酒","〚447:001:6.2.3〛":"有","〚447:001:6.2.4〛":"殘","〚447:001:6.2.5〛":"鶯"}}';

$data = json_decode( $input, true );
$output = 坐標字轉換成基文樹( $data );
print_r( $output );
/*
$i++;
$樹 = 提取數據結構( BASE_TEXT_DIR . '0003' );
// need to figure out why no InvalidPathException thrown
確認會丟( function(){ 
	替換路徑字( 
		$樹,
		array( '0002', '3', '1', '5' ), "Hi" );
	}, TypeError::class, "case#: ${i}" );
*/
?>