<?php
/*
生成：本文檔用 PHP 生成。
說明：張志烈主編《杜詩全集（今注本）》中關於《與任城許主簿遊南池》的資料。
*/
$内容=array(
"書名"=>"張志烈主編《杜詩全集（今注本）》1.13",
"注釋"=>
array(
"〚0025:1〛"=>"任城，漢屬東平郡，唐屬兗州。主簿，官名，漢時皆置州縣主簿，歷代相沿，唐時廢州主簿，縣仍設主簿，主管諸簿目。",
"〚0025:3.1.4-5〛"=>"溝洫：田間水道、溝渠。",
"〚0025:3.2.1-2〛"=>"城隅：城角。",
"〚0025:4.2.1-2〛"=>"森木：森林。",
"〚0025:5.1.3-4〛"=>"經時：歷久。",
"〚0025:5.2.1〛"=>"蒲：香蒲。",
"〚0025:6.1.1-2〛"=>"晨朝：第二天早晨。")
,
"大意"=>
array(
"〚0025:3〛"=>"秋水上漲直通田間溝渠，一條小船沿水道向城角駛去。",
"〚0025:4〛"=>"涼爽的夜晚看溝邊有人洗馬，森林中傳來蟬的叫聲。",
"〚0025:5〛"=>"菱角熟時秋雨連綿，香蒲在八月裏就荒蕪一片。",
"〚0025:6〛"=>"明日白露節也。遙憶舊氈，蓋當秋而動鄕思矣。")
,

);
?>