<?php
/*
生成：本文檔用 PHP 生成。
說明：張志烈主編《杜詩全集（今注本）》中關於《遊龍門奉先寺》的資料。
*/
$内容=array(
"書名"=>"張志烈主編《杜詩全集（今注本）》1.3",
"注釋"=>
array(
"〚0042:3.1.3-4〛"=>"招提：本梵語拓斗提奢，義爲四方，後譯時省作拓提，又誤爲招提。四方之僧稱招提僧，四方僧之住處稱招提僧房。北魏太武帝造伽藍，創招提之名，後遂爲寺院的別稱。這裏是指寺僧。",
"〚0042:4.1.4-5〛"=>"虛籟：風聲。",
"〚0042:5.1.1-2〛"=>"天闕：指龍門兩山相對的形勢有若帝王宮門外的雙闕。",
"〚0042:5.1.3-4〛"=>"象緯：星象經緯。",
"〚0042:6.1.2〛"=>"覺：覺醒。",
"〚0042:6.2.5〛"=>"省：省悟，覺悟。")
,
"大意"=>
array(
"〚0042:3〛"=>"詩人隨寺僧遊並宿於寺内。",
"〚0042:4〛"=>"言奉先寺風聲月影皆佳致也。",
"〚0042:5〛"=>"龍門山高逼近星辰；夜宿奉先寺，如臥雲中，衣裳皆冷潤。",
"〚0042:6〛"=>"周甸云：「佛境幽，而平旦清明聞鐘警發，含蓄有深意，謂煩惱可除矣。」")
,

);
?>