<?php
/*
生成：本文檔用 PHP 生成。
說明：張志烈主編《杜詩全集（今注本）》中關於《贈李白》的資料。
*/
$内容=array(
"書名"=>"張志烈主編《杜詩全集（今注本）》1.31",
"注釋"=>
array(
"〚0076:4〛"=>"杜甫面對朱門大戶頓頓魚羊腥羶之食，憎恨討厭，寧蔬食而不飽。",
"〚0076:5.1.3-5〛"=>"青精飯：據陶隱居《登眞隱訣》載：「用南竹草木葉，雜莖皮煮，取
汁浸米蒸之，令飯作青色。」據説吃了可以延年益壽。",
"〚0076:6.1.3-4〛"=>"大藥：金丹。迹如掃：指沒有足迹。",
"〚0076:6〛"=>"此兩句說：杜甫苦於缺乏燒煉服食金丹的資財，
故終於不能到山林中去采藥。",
"〚0076:7.1.3-4〛"=>"金閨：金馬門。",
"〚0076:7.2.1-2〛"=>"李白醉中令高力士脫靴，力士以爲恥，便對楊貴妃說他的壞話，李白
自知不爲所容，於是自求還山，所以說是「脫身」。",
"〚0076:7.2.3-5〛"=>"事幽討：從事於在山林中采藥訪道。",
"〚0076:8.2.2〛"=>"期：相約。",
"〚0076:8〛"=>"這兩句說：也有梁宋同遊，正相約一起去尋求玉芝。")
,

);
?>