<?php
/*
生成：本文檔用 PHP 生成。
說明：張志烈主編《杜詩全集（今注本）》中關於《鄭駙馬宅宴洞中》的資料。
*/
$内容=array(
"書名"=>"張志烈主編《杜詩全集（今注本）》1.42",
"版本"=>
array(
"詩文"=>"主家陰洞細煙霧。留客夏簟青琅玕。春酒杯濃琥珀薄。冰漿碗碧瑪瑙寒。悞疑茅堂過江麓。已入風磴霾雲端。自是秦樓壓鄭谷。時聞雜佩聲珊珊。",),
"注釋"=>
array(
"〚0120:1〛"=>"鄭駙馬指鄭潛曜，鄭潛曜爲鄭虔之侄。玄宗女臨晉公主，皇甫淑妃所生，下嫁鄭潛曜，時官光祿卿，爵曰駙馬都尉。",
"〚0120:3.1.1-2〛"=>"主家：公主之家。",
"〚0120:3.1.3-4〛"=>"陰洞：幽深的洞府。",
"〚0120:3.1.5-7〛"=>"細煙霧：煙霧蒙蒙的樣子。",
"〚0120:3.2.5-7〛"=>"清琅玕：此作青琅玕，青色的美石。",
"〚0120:4.1.1-2〛"=>"春酒：用棗或稻子釀酒，冬釀春熟。",
"〚0120:4.1.5-6〛"=>"琥珀：松科松屬植物的樹脂化石。",
"〚0120:4.2.1-2〛"=>"冰漿：帶冰的飲料。",
"〚0120:4.2.5-6〛"=>"瑪瑙：Agate, 石英的一種隱晶質變體。",
"〚0120:5.1.6-7〛"=>"江麓：江邊的大林。",
"〚0120:5.2.3-4〛"=>"風磴：登山的路，如凌風而上。",
"〚0120:5.2.5〛"=>"霾：天空昏暗的樣子。",
"〚0120:6.1.3-4〛"=>"秦樓：指駙馬與公主。",
"〚0120:6.1.6-7〛"=>"鄭谷：鄭宅。",
"〚0120:6.2.3-4〛"=>"雜佩：各種佩飾之物。",
"〚0120:6.2.6-7〛"=>"珊珊：佩飾互相碰撞的聲音。")
,
"大意"=>
array(
"〚0120:3.2〛"=>"言留客的竹席像青色的美石。",
"〚0120:4〛"=>"以精麗的器物寫出留客。",
"〚0120:5〛"=>"讓人誤以爲茅屋是在江邊大林的那邊，凌風而上的山路遠上雲端，極寫洞中陰涼的情況。")
,

);
?>