<?php
/*
生成：本文檔用 PHP 生成。
說明：張志烈主編《杜詩全集（今注本）》中關於《今夕行》的資料。
*/
$内容=array(
"書名"=>"張志烈主編《杜詩全集（今注本）》1.47",
"注釋"=>
array(
"〚0144:3.1.1-4〛"=>"今夕何夕：今夜是何月之夜。",
"〚0144:3.1.7〛"=>"徂：往。",
"〚0144:3.1.5-7〛"=>"歲云徂：年歲已過去。",
"〚0144:3.2.7〛"=>"孤：辜負。",
"〚0144:4.1.1-2〛"=>"咸陽：西安西北偏西10哩。 34.33782, 108.70599",
"〚0144:4.2.3-4〛"=>"博塞：古代六博和格五等博戲。",
"〚0144:5.1.1〛"=>"馮：凴。",
"〚0144:5.1.1-2〛"=>"馮陵：侵凌、侵逼。",
"〚0144:5.1.6-7〛"=>"五白：古代賭博的五木之戲，五子全白，又稱梟。",
"〚0144:5.1.5-7〛"=>"呼五白：投骰時喝呼勝采，以助賭興。",
"〚0144:5.2.1〛"=>"袒：光著上身。",
"〚0144:5.2.2〛"=>"跣：光著腳。",
"〚0144:5.2.6〛"=>"梟：當是古代六博（一種棋戲，二人對弈，共六個籌碼十二個棋子)的一種變法，今已失傳。",
"〚0144:5.2.7〛"=>"盧：一作牟，相等之意。",
"〚0144:6.2.6-7〛"=>"良圖：良好的願望。",
"〚0144:7.1.4-5〛"=>"劉毅：字希孟，小字盤龍，東晉彭城沛人，生平好賭，一擲百萬。",
"〚0144:7.2.3-4〛"=>"儋石：儋通擔，肩挑。儋容一石。")
,
"大意"=>
array(
"〚0144:3〛"=>"除夕之夜，更長燭明，時光不可辜負。",
"〚0144:5〛"=>"寫賭博遣興時的具體情景：吆五喝六，大聲吼叫；袒胸赤脚，毫無顧忌。",
"〚0144:6〛"=>"卽使英雄有時候也要像這樣（賭博娛樂），何況我們是不期而遇并非沒有遠大的願望。")
,

);
?>